Repository: DOKOS-TAYOS/RegressionLab
Catalog: sphinx-docs/locale/*/LC_MESSAGES/configuration.po
Languages: es

source: Configuration Guide
es: Guía de configuración

source: RegressionLab is highly customizable through a single `.env` file. This guide describes every option, where it applies (desktop, web, or both), and how to change it safely.
es: RegressionLab es altamente personalizable a través de un único archivo `.env`. Esta guía describe cada opción, dónde se aplica (escritorio, web o ambas) y cómo cambiarla de forma segura.

source: Getting Started with Configuration
es: Comenzando con la configuración

source: Configuring from Tkinter (Desktop App)
es: Configurando desde Tkinter (Aplicación de escritorio)

source: If you use the **Tkinter desktop application**, you can change settings without editing files: from the main menu, click **Configure** (or **Configurar** in Spanish). A configuration dialog opens with **collapsible sections**:
es: Si usa la **aplicación de escritorio Tkinter**, puede cambiar la configuración sin editar archivos: desde el menú principal, haga clic en **Configurar** (o **Configurar** en español). Se abre un cuadro de diálogo de configuración con **secciones plegables**:

source: **Language**: Interface language (Spanish, English, German).
es: **Idioma**: Idioma de la interfaz (español, inglés, alemán).

source: **UI**: Window and text colors, button colors (normal, cancel, accent), spacing, button width, font family and size, spinbox/entry widths, and data-preview selection color.
es: **UI**: colores de ventana y texto, colores de botones (normal, cancelar, acento), espaciado, ancho de botón, familia y tamaño de fuente, ancho de entrada/cuadro giratorio y color de selección de vista previa de datos.

source: **Plot**: Figure dimensions, DPI, title visibility, grid display, and line/marker style and colors for generated plots.
es: **Trazado**: Dimensiones de la figura, DPI, visibilidad del título, visualización de cuadrícula y estilo y colores de línea/marcador para los trazados generados.

source: **Font**: Font family and sizes for plot title, axis labels, and tick labels.
es: **Fuente**: familia de fuentes y tamaños para el título del gráfico, las etiquetas de los ejes y las etiquetas de marca.

source: **Paths**: Default input and output folders, filename template for saved plots, and export format (PNG, JPG, PDF).
es: **Rutas**: carpetas de entrada y salida predeterminadas, plantilla de nombre de archivo para trazados guardados y formato de exportación (PNG, JPG, PDF).

source: **Links**: Optional URL for the “Donations” link in the Information dialog.
es: **Enlaces**: URL opcional para el enlace "Donaciones" en el cuadro de diálogo Información.

source: **Updates**: Weekly update check (enable/disable), force check for testing, and URL to fetch the latest version.
es: **Actualizaciones**: verificación de actualización semanal (activar/desactivar), verificación forzada para pruebas y URL para obtener la última versión.

source: **Logging**: Log level (e.g. DEBUG, INFO), log file path, and whether messages are also printed to the console.
es: **Registro**: nivel de registro (por ejemplo, DEBUG, INFO), ruta del archivo de registro y si los mensajes también se imprimen en la consola.

source: Configuration Dialog
es: Diálogo de configuración

source: Each option shows a short description. When you click **Accept**, the values are written to `.env` and the application restarts so the new settings take effect. **Cancel** discards changes. This is the easiest way to customize RegressionLab when using the desktop version.
es: Cada opción muestra una breve descripción. Cuando hace clic en **Aceptar**, los valores se escriben en `.env` y la aplicación se reinicia para que la nueva configuración surta efecto. **Cancelar** descarta los cambios. Esta es la forma más sencilla de personalizar RegressionLab cuando se utiliza la versión de escritorio.

source: Locating the Configuration File
es: Localización del archivo de configuración

source: The configuration file lives in the **root directory** of the RegressionLab project:
es: El archivo de configuración se encuentra en el **directorio raíz** del proyecto RegressionLab:

source: First-time setup
es: Configuración por primera vez

source: If `.env` does not exist yet:
es: Si `.env` aún no existe:

source: Then open and edit `.env` with any text editor, for example:
es: Luego abra y edite `.env` con cualquier editor de texto, por ejemplo:

source: **Visual Studio Code**: `code .env`.
es: **Código de Visual Studio**: `código .env`.

source: **Notepad** (Windows): `notepad .env`.
es: **Bloc de notas** (Windows): `bloc de notas .env`.

source: Configuration Sections
es: Secciones de configuración

source: The `.env` file is grouped into sections that match the Tkinter **Configure** dialog:
es: El archivo `.env` está agrupado en secciones que coinciden con el cuadro de diálogo **Configurar** de Tkinter:

source: [Language Configuration](#1-language-configuration)
es: [Configuración de idioma](#1-language-configuration)

source: [UI Theme Configuration](#2-ui-theme-configuration)
es: [Configuración del tema de la interfaz de usuario](#2-ui-theme-configuration)

source: [Plot Style Configuration](#3-plot-style-configuration)
es: [Configuración de estilo de trama](#3-plot-style-configuration)

source: 1. Language Configuration
es: 1. Configuración del idioma

source: Setting the Application Language
es: Configuración del idioma de la aplicación

source: **Available Languages**:
es: **Idiomas disponibles**:

source: `es`, `español`, `spanish`, `esp` → Spanish (default)
es: `es`, `español`, `spanish`, `esp` → Español (predeterminado)

source: `en`, `english`, `ingles`, `inglés`, `eng` → English
es: `en`, `english`, `ingles`, `inglés`, `eng` → Inglés

source: `de`, `german`, `deutsch`, `ger` → German
es: `de`, `alemán`, `deutsch`, `ger` → alemán

source: **Example**:
es: **Ejemplo**:

source: **Effect**:
es: **Efecto**:

source: Changes menus, buttons, dialogs, and all other interface text to the selected language.
es: Cambia menús, botones, cuadros de diálogo y todos los demás textos de la interfaz al idioma seleccionado.

source: Applies to both the Tkinter desktop app and the Streamlit web interface.
es: Se aplica tanto a la aplicación de escritorio Tkinter como a la interfaz web Streamlit.

source: Does not change column names, file contents, or text you type (e.g. axis labels you enter yourself).
es: No cambia los nombres de las columnas, el contenido de los archivos ni el texto que escribe (por ejemplo, las etiquetas de los ejes que ingresa usted mismo).

source: 2. UI Theme Configuration
es: 2. Configuración del tema de la interfaz de usuario

source: These settings control the look of the Tkinter desktop app (window, buttons, fonts, spacing). The Streamlit web interface uses them where applicable; behavior may differ. Hover and active (click) colors are derived automatically from the base colors you set.
es: Estas configuraciones controlan el aspecto de la aplicación de escritorio Tkinter (ventana, botones, fuentes, espaciado). La interfaz web de Streamlit los utiliza cuando corresponde; el comportamiento puede diferir. Los colores al pasar el cursor y activar (hacer clic) se derivan automáticamente de los colores base que establezca.

source: Color Settings
es: Configuración de color

source: Background and Foreground
es: Fondo y primer plano

source: **UI_BACKGROUND**: Background color of the main window and most panels.
es: **UI_BACKGROUND**: Color de fondo de la ventana principal y de la mayoría de los paneles.

source: **UI_FOREGROUND**: Default text color for labels, entries, and other UI text.
es: **UI_FOREGROUND**: color de texto predeterminado para etiquetas, entradas y otro texto de la interfaz de usuario.

source: **Color options**:
es: **Opciones de color**:

source: **Named colors**: `"white"`, `"black"`, `"navy"`, `"crimson"`, etc.
es: **Colores con nombre**: `"blanco"`, `"negro"`, `"azul marino"`, `"carmesí"`, etc.

source: **Hex codes**: `"#2C3E50"`, `"#FF5733"`, etc.
es: **Códigos hexadecimales**: `"#2C3E50"`, `"#FF5733"`, etc.

source: Button Colors
es: Colores de botones

source: **UI_BUTTON_BG**: Background color of all buttons.
es: **UI_BUTTON_BG**: Color de fondo de todos los botones.

source: **UI_BUTTON_FG**: Text color for standard action buttons.
es: **UI_BUTTON_FG**: color del texto para los botones de acción estándar.

source: **UI_BUTTON_FG_CANCEL**: Text color for cancel, exit, or destructive buttons.
es: **UI_BUTTON_FG_CANCEL**: Color del texto para cancelar, salir o botones destructivos.

source: **UI_BUTTON_FG_ACCENT2**: Text color for secondary accent buttons (e.g. “Accept” in dialogs).
es: **UI_BUTTON_FG_ACCENT2**: Color del texto para los botones de acento secundarios (por ejemplo, "Aceptar" en los cuadros de diálogo).

source: Layout and Widget Sizes
es: Tamaños de diseño y widgets

source: Padding and Button Width
es: Acolchado y ancho de botones

source: **UI_PADDING**: Spacing in pixels between widgets, applied both horizontally and vertically.
es: **UI_PADDING**: Espaciado en píxeles entre widgets, aplicado tanto horizontal como verticalmente.

source: **UI_BUTTON_WIDTH**: Nominal width of buttons in character units. “Wide” buttons use 2.5× this value.
es: **UI_BUTTON_WIDTH**: ancho nominal de botones en unidades de caracteres. Los botones "anchos" utilizan 2,5 veces este valor.

source: Font Settings
es: Configuración de fuente

source: **UI_FONT_FAMILY**: Font used for all UI text (menus, labels, buttons).
es: **UI_FONT_FAMILY**: fuente utilizada para todo el texto de la interfaz de usuario (menús, etiquetas, botones).

source: **UI_FONT_SIZE**: Base font size in points for the desktop interface.
es: **UI_FONT_SIZE**: tamaño de fuente base en puntos para la interfaz de escritorio.

source: **Common font families**:
es: **Familias de fuentes comunes**:

source: **Monospace**: `"Courier"`, `"Courier New"`, `"Menlo"`, `"Monaco"`.
es: **Monoespacio**: `"Courier"`, `"Courier New"`, `"Menlo"`, `"Mónaco"`.

source: Input Widget Sizes
es: Tamaños de widgets de entrada

source: **UI_SPINBOX_WIDTH**: Width of numeric spinbox fields in character units.
es: **UI_SPINBOX_WIDTH**: Ancho de los campos numéricos del cuadro de números en unidades de caracteres.

source: **UI_ENTRY_WIDTH**: Width of text entry fields in character units.
es: **UI_ENTRY_WIDTH**: Ancho de los campos de entrada de texto en unidades de caracteres.

source: Data Preview (Text Widget)
es: Vista previa de datos (widget de texto)

source: **UI_TEXT_SELECT_BG**: Background color of selected text in the data preview area. The preview uses **UI_FOREGROUND** for text; its background is derived from the main UI background.
es: **UI_TEXT_SELECT_BG**: color de fondo del texto seleccionado en el área de vista previa de datos. La vista previa usa **UI_FOREGROUND** para el texto; su fondo se deriva del fondo principal de la interfaz de usuario.

source: Example Themes
es: Temas de ejemplo

source: Professional Dark Theme (default-like)
es: Tema oscuro profesional (predeterminado)

source: Classic Light Theme
es: Tema de luz clásico

source: Ocean Theme
es: Tema del océano

source: 3. Plot Style Configuration
es: 3. Configuración del estilo de trazado

source: These settings control the size, resolution, and visual style of the regression plots (used by both the Tkinter and Streamlit interfaces).
es: Estas configuraciones controlan el tamaño, la resolución y el estilo visual de los gráficos de regresión (utilizados por las interfaces Tkinter y Streamlit).

source: Figure Dimensions
es: Dimensiones de la figura

source: **PLOT_FIGSIZE_WIDTH**: Figure width in inches (for both on-screen display and saved files).
es: **PLOT_FIGSIZE_WIDTH**: Ancho de la figura en pulgadas (tanto para visualización en pantalla como para archivos guardados).

source: **PLOT_FIGSIZE_HEIGHT**: Figure height in inches.
es: **PLOT_FIGSIZE_HEIGHT**: Altura de la figura en pulgadas.

source: **DPI**: Resolution in dots per inch; higher values give sharper output and larger file sizes.
es: **DPI**: Resolución en puntos por pulgada; los valores más altos proporcionan resultados más nítidos y tamaños de archivo más grandes.

source: **Recommendations**:
es: **Recomendaciones**:

source: **Screen display**: 100 DPI.
es: **Visualización de pantalla**: 100 DPI.

source: **High-quality prints**: 300 DPI.
es: **Impresiones de alta calidad**: 300 DPI.

source: **Publications**: 600 DPI.
es: **Publicaciones**: 600 DPI.

source: Title Display
es: Visualización del título

source: **PLOT_SHOW_TITLE**: Whether to display a title above the plot.
es: **PLOT_SHOW_TITLE**: si se muestra un título encima del gráfico.

source: `true`: Show title (derived from the plot name).
es: `true`: muestra el título (derivado del nombre de la trama).

source: `false`: No title (cleaner look for slides or publications).
es: `falso`: Sin título (aspecto más limpio para diapositivas o publicaciones).

source: In the Streamlit app, a checkbox before each fit overrides this value per fit; the default is loaded from this env var.
es: En la aplicación Streamlit, una casilla de verificación antes de cada ajuste anula este valor por ajuste; el valor predeterminado se carga desde esta var de entorno.

source: Grid Display
es: Visualización de cuadrícula

source: **PLOT_SHOW_GRID**: Whether to display a background grid on the plot.
es: **PLOT_SHOW_GRID**: si se muestra una cuadrícula de fondo en el gráfico.

source: `true`: Show grid lines (helps read values from the plot).
es: `true`: muestra líneas de cuadrícula (ayuda a leer los valores del gráfico).

source: `false`: No grid (default; cleaner look for slides or publications).
es: `falso`: Sin cuadrícula (predeterminado; apariencia más limpia para diapositivas o publicaciones).

source: Fitted Curve Style
es: Estilo curvo ajustado

source: **PLOT_LINE_COLOR**: Color of the fitted regression curve.
es: **PLOT_LINE_COLOR**: Color de la curva de regresión ajustada.

source: **PLOT_LINE_WIDTH**: Line width in points (e.g. 1.0 = thin, 2.0 = bold).
es: **PLOT_LINE_WIDTH**: ancho de línea en puntos (por ejemplo, 1,0 = fino, 2,0 = negrita).

source: **PLOT_LINE_STYLE**: Line pattern for the fitted curve.
es: **PLOT_LINE_STYLE**: Patrón de líneas para la curva ajustada.

source: **Line style options**:
es: **Opciones de estilo de línea**:

source: `"-"`: Solid line (default).
es: `"-"`: Línea continua (predeterminado).

source: `"--"`: Dashed line.
es: `"--"`: Línea discontinua.

source: `"-."`: Dash-dot line.
es: `"-."`: Línea de guiones y puntos.

source: `":"`: Dotted line.
es: `":"`: Línea de puntos.

source: Data Points Style
es: Estilo de puntos de datos

source: **PLOT_MARKER_FORMAT**: Marker shape for the measured data points.
es: **PLOT_MARKER_FORMAT**: Forma del marcador para los puntos de datos medidos.

source: **PLOT_MARKER_SIZE**: Marker size in points.
es: **PLOT_MARKER_SIZE**: Tamaño del marcador en puntos.

source: **Marker format options**: `"o"` (circle, default), `"s"` (square), `"^"` (triangle up), `"d"` (diamond), `"*"` (star).
es: **Opciones de formato de marcador**: `"o"` (círculo, predeterminado), `"s"` (cuadrado), `"^"` (triángulo hacia arriba), `"d"` (diamante), `"*"` (estrella).

source: Colors for Data Points
es: Colores para puntos de datos

source: **PLOT_ERROR_COLOR**: Color of the vertical (or horizontal) error bars on data points.
es: **PLOT_ERROR_COLOR**: Color de las barras de error verticales (u horizontales) en los puntos de datos.

source: **PLOT_MARKER_FACE_COLOR**: Fill color of the data point markers.
es: **PLOT_MARKER_FACE_COLOR**: Color de relleno de los marcadores de puntos de datos.

source: **PLOT_MARKER_EDGE_COLOR**: Outline/border color of the markers.
es: **PLOT_MARKER_EDGE_COLOR**: Color de contorno/borde de los marcadores.

source: **Common color names**:
es: **Nombres de colores comunes**:

source: Basic: `"red"`, `"blue"`, `"green"`, `"black"`, `"white"`.
es: Básico: `"rojo"`, `"azul"`, `"verde"`, `"negro"`, `"blanco"`.

source: Extended: `"crimson"`, `"navy"`, `"teal"`, `"gold"`, `"orange"`.
es: Extendido: `"carmesí"`, `"azul marino"`, `"verde azulado"`, `"dorado"`, `"naranja"`.

source: Scientific: `"darkblue"`, `"darkgreen"`, `"darkred"`.
es: Científico: `"azul oscuro"`, `"verde oscuro"`, `"rojo oscuro"`.

source: Example Plot Styles
es: Ejemplos de estilos de trama

source: Publication Style (Black & White)
es: Estilo de publicación (blanco y negro)

source: Colorful Presentation Style
es: Estilo de presentación colorido

source: 4. Font Configuration
es: 4. Configuración de fuentes

source: Control the font family, size, and style of all text drawn on the plots (title, axis labels, and tick numbers).
es: Controle la familia de fuentes, el tamaño y el estilo de todo el texto dibujado en los trazados (título, etiquetas de eje y números de marca).

source: Font Family
es: Familia de fuentes

source: **Options** (Matplotlib generic families; exact font depends on your system):
es: **Opciones** (familias genéricas de Matplotlib; la fuente exacta depende de su sistema):

source: `serif`: Serif fonts (e.g. Times-like); good for formal or printed work.
es: `serif`: fuentes Serif (por ejemplo, tipo Times); bueno para trabajos formales o impresos.

source: `sans-serif`: Sans-serif fonts (e.g. Arial-like); clean and readable on screen.
es: `sans-serif`: fuentes Sans-serif (por ejemplo, tipo Arial); limpio y legible en pantalla.

source: `monospace`: Fixed-width fonts (e.g. Courier-like); useful for technical labels.
es: `monoespacio`: fuentes de ancho fijo (por ejemplo, tipo Courier); útil para etiquetas técnicas.

source: `cursive`: Script-like fonts; decorative use.
es: `cursiva`: fuentes tipo script; uso decorativo.

source: `fantasy`: Decorative/artistic fonts.
es: `fantasía`: Fuentes decorativas/artísticas.

source: Title Font
es: Fuente del título

source: **FONT_TITLE_SIZE**: Relative size of the plot title. Only used when **PLOT_SHOW_TITLE** is `true`.
es: **FONT_TITLE_SIZE**: Tamaño relativo del título de la trama. Solo se usa cuando **PLOT_SHOW_TITLE** es "verdadero".

source: **Size options**: `xx-small`, `x-small`, `small`, `medium`, `large`, `x-large`, `xx-large`.
es: **Opciones de tamaño**: `xx-pequeño`, `x-pequeño`, `pequeño`, `mediano`, `grande`, `x-grande`, `xx-grande`.

source: **FONT_TITLE_WEIGHT**: Font weight (boldness) of the plot title.
es: **FONT_TITLE_WEIGHT**: Peso de fuente (negrita) del título de la trama.

source: **Weight options**: `normal`, `light`, `semibold`, `bold`, `heavy`.
es: **Opciones de peso**: "normal", "ligero", "semibold", "negrita", "pesado".

source: Axis Labels
es: Etiquetas de eje

source: **FONT_AXIS_SIZE**: Font size in points for the x- and y-axis labels.
es: **FONT_AXIS_SIZE**: Tamaño de fuente en puntos para las etiquetas de los ejes x e y.

source: **FONT_AXIS_STYLE**: Font style for axis labels (e.g. variable names are often italic).
es: **FONT_AXIS_STYLE**: estilo de fuente para las etiquetas de los ejes (por ejemplo, los nombres de las variables suelen estar en cursiva).

source: **Style options**: `normal`, `italic`, `oblique`.
es: **Opciones de estilo**: `normal`, `cursiva`, `oblicuo`.

source: Tick Labels
es: Etiquetas de marca

source: **FONT_TICK_SIZE**: Font size in points for the numbers on the axis tick marks.
es: **FONT_TICK_SIZE**: Tamaño de fuente en puntos para los números en las marcas de los ejes.

source: Example Font Configurations
es: Ejemplos de configuraciones de fuentes

source: Academic Publication
es: Publicación Académica

source: Modern Presentation
es: Presentación moderna

source: 5. File Path Configuration
es: 5. Configuración de la ruta del archivo

source: Control the default folders for loading data and saving plots, the naming pattern for saved files, and the image format used when exporting.
es: Controle las carpetas predeterminadas para cargar datos y guardar gráficos, el patrón de nombres de los archivos guardados y el formato de imagen utilizado al exportar.

source: Input Directory
es: Directorio de entrada

source: **Options**:
es: **Opciones**:

source: **Relative path** (from the RegressionLab root): e.g. `"input"`, `"data"`, `"experiments"`.
es: **Ruta relativa** (desde la raíz de RegressionLab): p.e. `"entrada"`, `"datos"`, `"experimentos"`.

source: **Absolute path**: e.g. `"/home/user/data"` or `"C:\\Users\\Name\\Documents\\Data"`.
es: **Ruta absoluta**: p.e. `"/home/usuario/datos"` o `"C:\\Usuarios\\Nombre\\Documentos\\Datos"`.

source: Output Directory
es: Directorio de salida

source: **Relative path**: e.g. `"output"`, `"results"`, `"plots"` (from the RegressionLab root).
es: **Ruta relativa**: p.e. `"salida"`, `"resultados"`, `"gráficos"` (de la raíz de RegressionLab).

source: **Absolute path**: e.g. `"/home/user/results"` or `"C:\\Users\\Name\\Documents\\Results"`.
es: **Ruta absoluta**: p.e. `"/home/usuario/resultados"` o `"C:\\Usuarios\\Nombre\\Documentos\\Resultados"`.

source: **Note**: The output directory is created automatically if it does not exist.
es: **Nota**: El directorio de salida se crea automáticamente si no existe.

source: Filename Template
es: Plantilla de nombre de archivo

source: The `{}` placeholder is replaced with the plot name (e.g. from the loaded file or dialog). The file extension is added automatically based on **FILE_PLOT_FORMAT** (e.g. `.png`).
es: El marcador de posición `{}` se reemplaza con el nombre del trazado (por ejemplo, del archivo o cuadro de diálogo cargado). La extensión del archivo se agrega automáticamente según **FILE_PLOT_FORMAT** (por ejemplo, `.png`).

source: **Examples**:
es: **Ejemplos**:

source: Plot Output Format
es: Formato de salida del trazado

source: **Options**: `png`, `jpg`, `pdf`
es: **Opciones**: `png`, `jpg`, `pdf`

source: **png**: Default; good balance of quality and file size; supports transparency.
es: **png**: Predeterminado; buen equilibrio entre calidad y tamaño de archivo; apoya la transparencia.

source: **jpg**: Smaller files; suitable for sharing or embedding when vector output is not required.
es: **jpg**: archivos más pequeños; adecuado para compartir o incrustar cuando no se requiere salida vectorial.

source: **pdf**: Vector output for publications and printing; in-app preview may still be raster (e.g. PNG).
es: **pdf**: Salida vectorial para publicaciones e impresión; Es posible que la vista previa en la aplicación aún sea rasterizada (por ejemplo, PNG).

source: 6. Links (Optional)
es: 6. Enlaces (opcional)

source: **DONATIONS_URL**: URL displayed as a “Donations” (or similar) link in the desktop app’s **Information** / help dialog, e.g. to support the project. Leave empty to hide the link.
es: **DONACIONES_URL**: URL que se muestra como un enlace "Donaciones" (o similar) en el cuadro de diálogo **Información**/ayuda de la aplicación de escritorio, p. para apoyar el proyecto. Déjelo vacío para ocultar el enlace.

source: 7. Update Check (Tkinter)
es: 7. Comprobación de actualización (Tkinter)

source: The Tkinter desktop app can check for updates once a week when you open it. If a newer version is available, a dialog asks whether you want to update. If you confirm, the app runs `git pull` to update the code. Your `input/`, `output/` folders and `.env` file are not modified.
es: La aplicación de escritorio Tkinter puede buscar actualizaciones una vez a la semana cuando la abre. Si hay una versión más reciente disponible, un cuadro de diálogo le preguntará si desea actualizar. Si confirma, la aplicación ejecuta `git pull` para actualizar el código. Sus carpetas `input/`, `output/` y el archivo `.env` no se modifican.

source: Enable or Disable Update Check
es: Activar o desactivar la comprobación de actualizaciones
