Repository: DOKOS-TAYOS/RegressionLab
Catalog: sphinx-docs/locale/*/LC_MESSAGES/configuration.po
Languages: es

source: `true`: Check for updates weekly when opening the app (default).
es: `true`: busca actualizaciones semanalmente al abrir la aplicación (predeterminado).

source: `false`: Disable the update check entirely; no dialog will appear.
es: `falso`: deshabilita la verificación de actualizaciones por completo; no aparecerá ningún cuadro de diálogo.

source: Force Check (for Testing)
es: Verificación de fuerza (para prueba)

source: `true`: Always run the update check when opening the app, ignoring the 7-day interval. Useful for testing.
es: `verdadero`: ejecute siempre la verificación de actualizaciones al abrir la aplicación, ignorando el intervalo de 7 días. Útil para realizar pruebas.

source: `false`: Use the normal weekly interval (default).
es: `falso`: utiliza el intervalo semanal normal (predeterminado).

source: Version Check URL
es: URL de verificación de versión

source: URL of the remote `pyproject.toml` used to fetch the latest version. Leave empty to use the default (RegressionLab main branch).
es: URL del `pyproject.toml` remoto utilizado para obtener la última versión. Déjelo vacío para usar el valor predeterminado (rama principal de RegressionLab).

source: If you use a fork, set this to your fork's URL.
es: Si usa una bifurcación, configúrelo en la URL de su bifurcación.

source: How It Works
es: Cómo funciona

source: The app stores the last check timestamp in `.last_update_check` (project root). The file is empty; only its modification time is used.
es: La aplicación almacena la marca de tiempo de la última verificación en `.last_update_check` (raíz del proyecto). El archivo está vacío; sólo se utiliza su hora de modificación.

source: If at least 7 days have passed (or `CHECK_UPDATES_FORCE=true`), the app fetches the remote version and compares it with the current one.
es: Si han pasado al menos 7 días (o `CHECK_UPDATES_FORCE=true`), la aplicación recupera la versión remota y la compara con la actual.

source: If a newer version exists, a dialog asks whether to update. If you confirm, `git pull` is run. User data in `input/`, `output/`, and `.env` is preserved.
es: Si existe una versión más reciente, un cuadro de diálogo pregunta si desea actualizar. Si confirma, se ejecuta `git pull`. Los datos del usuario en `input/`, `output/` y `.env` se conservan.

source: 8. Logging Configuration
es: 8. Configuración de registro

source: Control where and how much RegressionLab logs: level of detail, log file location, and whether messages are also printed to the console.
es: Controle dónde y cuánto registra RegressionLab: nivel de detalle, ubicación del archivo de registro y si los mensajes también se imprimen en la consola.

source: Log Level
es: Nivel de registro

source: **Options** (from most to least verbose):
es: **Opciones** (de mayor a menor detalle):

source: `DEBUG`: Very detailed messages (function flow, variable values); useful for development and debugging.
es: `DEBUG`: Mensajes muy detallados (flujo de funciones, valores de variables); Útil para el desarrollo y la depuración.

source: `INFO`: General operational messages (default); good for normal use.
es: `INFO`: Mensajes operativos generales (predeterminado); Bueno para uso normal.

source: `WARNING`: Only warnings and more severe; reduces log noise.
es: `ADVERTENCIA`: Sólo advertencias y más severas; reduce el ruido del tronco.

source: `ERROR`: Only errors and critical issues.
es: `ERROR`: Sólo errores y problemas críticos.

source: `CRITICAL`: Only critical failures.
es: `CRÍTICO`: Sólo fallos críticos.

source: **Recommendation**: Use `INFO` for everyday use; switch to `DEBUG` when troubleshooting.
es: **Recomendación**: Utilice `INFO` para uso diario; cambie a `DEBUG` cuando solucione problemas.

source: Log File
es: Archivo de registro

source: Path to the log file (relative to the RegressionLab root or absolute). Logs are appended; the file is created automatically if it does not exist.
es: Ruta al archivo de registro (relativa a la raíz de RegressionLab o absoluta). Se adjuntan registros; el archivo se crea automáticamente si no existe.

source: Console Logging
es: Registro de consola

source: `true`: Also print log messages to the console/terminal (useful when running from a terminal).
es: `true`: también imprime mensajes de registro en la consola/terminal (útil cuando se ejecuta desde una terminal).

source: `false`: Write only to the log file (default; cleaner when using the GUI).
es: `falso`: escribe solo en el archivo de registro (predeterminado; más limpio cuando se usa la GUI).

source: **Recommendation**: Use `true` when debugging from the command line; use `false` when running the desktop app or for quieter operation.
es: **Recomendación**: Utilice `true` al depurar desde la línea de comando; use "falso" cuando ejecute la aplicación de escritorio o para un funcionamiento más silencioso.

source: Applying Configuration Changes
es: Aplicar cambios de configuración

source: Tkinter (desktop)
es: Tkinter (escritorio)

source: You can change settings in two ways:
es: Puede cambiar la configuración de dos maneras:

source: **By editing `.env`**: Edit `.env` with a text editor, save, then restart the application:
es: **Al editar `.env`**: Edite `.env` con un editor de texto, guarde y luego reinicie la aplicación:

source: Edit the `.env` file and save.
es: Edite el archivo `.env` y guárdelo.

source: Reload the app in your browser (e.g. Ctrl+R or Cmd+R).
es: Vuelva a cargar la aplicación en su navegador (por ejemplo, Ctrl+R o Cmd+R).

source: **Note**: For some changes (e.g. paths or logging), you may need to stop and restart the Streamlit server:
es: **Nota**: Para algunos cambios (por ejemplo, rutas o registros), es posible que tengas que detener y reiniciar el servidor Streamlit:

source: Common Configuration Scenarios
es: Escenarios de configuración comunes

source: Scenario 1: Preparing plots for publication
es: Escenario 1: Preparación de argumentos para publicación

source: Scenario 2: Quick data exploration
es: Escenario 2: exploración rápida de datos

source: Scenario 3: Debugging issues
es: Escenario 3: problemas de depuración

source: Set **LOG_CONSOLE** to `true` so you can see logs in the terminal.
es: Establezca **LOG_CONSOLE** en "verdadero" para que pueda ver los registros en la terminal.

source: Scenario 4: Batch processing
es: Escenario 4: procesamiento por lotes

source: Troubleshooting configuration
es: Configuración de solución de problemas

source: Changes not applied
es: Cambios no aplicados

source: **Problem**: You edited `.env` but the app still shows old behavior.
es: **Problema**: Editaste `.env` pero la aplicación aún muestra un comportamiento anterior.

source: **Solutions**:
es: **Soluciones**:

source: Confirm the `.env` file was saved (check the timestamp).
es: Confirme que se guardó el archivo `.env` (verifique la marca de tiempo).

source: Fully quit and restart the application (not just refresh the window).
es: Salga y reinicie completamente la aplicación (no solo actualice la ventana).

source: Look for syntax errors: missing quotes, stray spaces, or broken lines in `.env`.
es: Busque errores de sintaxis: comillas faltantes, espacios perdidos o líneas discontinuas en `.env`.

source: Ensure `.env` is in the RegressionLab project root (same folder as `src/`, `.env.example`, etc.).
es: Asegúrese de que `.env` esté en la raíz del proyecto de RegressionLab (la misma carpeta que `src/`, `.env.example`, etc.).

source: Invalid color names
es: Nombres de colores no válidos

source: **Problem**: The app reports an invalid or unknown color.
es: **Problema**: La aplicación informa un color no válido o desconocido.

source: Put color values in double quotes: `"midnight blue"` not `midnight blue`.
es: Coloque los valores de color entre comillas dobles: `"azul medianoche"`, no `azul medianoche`.

source: Use a standard color name (e.g. from [Matplotlib](https://matplotlib.org/stable/gallery/color/named_colors.html)) or a hex code like `"#2C3E50"`.
es: Utilice un nombre de color estándar (por ejemplo, de [Matplotlib](https://matplotlib.org/stable/gallery/color/named_colors.html)) o un código hexadecimal como `"#2C3E50"`.

source: Check spelling; multi-word names must be quoted.
es: Revisar la ortografía; los nombres de varias palabras deben citarse.

source: Font not found
es: Fuente no encontrada

source: **Problem**: The UI or plot does not show the font you configured.
es: **Problema**: La interfaz de usuario o el gráfico no muestran la fuente que configuró.

source: Confirm the font is installed on your system (e.g. via Font Book, Windows Fonts).
es: Confirme que la fuente esté instalada en su sistema (por ejemplo, a través del Libro de fuentes, Fuentes de Windows).

source: Prefer generic families (`serif`, `sans-serif`, `monospace`); the system will pick a suitable font.
es: Prefiere familias genéricas (`serif`, `sans-serif`, `monospace`); el sistema elegirá una fuente adecuada.

source: Check the exact font name (e.g. “Times New Roman” vs “Times”).
es: Verifique el nombre exacto de la fuente (por ejemplo, “Times New Roman” frente a “Times”).

source: Path issues
es: Problemas de ruta

source: **Problem**: The app cannot find the input or output directory (or files in it).
es: **Problema**: La aplicación no puede encontrar el directorio de entrada o salida (o los archivos que contiene).

source: On Windows, use forward slashes (`/`) or escaped backslashes (`\\`) in paths.
es: En Windows, utilice barras diagonales (`/`) o barras invertidas de escape (`\\`) en las rutas.

source: For **FILE_INPUT_DIR**, the folder must exist; for **FILE_OUTPUT_DIR**, it is created if missing.
es: Para **FILE_INPUT_DIR**, la carpeta debe existir; para **FILE_OUTPUT_DIR**, se crea si falta.

source: Check read/write permissions for the chosen directories.
es: Verifique los permisos de lectura/escritura para los directorios elegidos.

source: If relative paths fail, try an absolute path to rule out working-directory issues.
es: Si las rutas relativas fallan, pruebe con una ruta absoluta para descartar problemas con el directorio de trabajo.

source: Default configuration
es: Configuración predeterminada

source: To restore default settings, overwrite `.env` with the example file:
es: Para restaurar la configuración predeterminada, sobrescriba `.env` con el archivo de ejemplo:

source: Or delete `.env` and let RegressionLab use built-in defaults.
es: O elimine `.env` y deje que RegressionLab use los valores predeterminados integrados.

source: Next steps
es: Próximos pasos

source: **Go further**: See the [Extending RegressionLab](extending.md) guide for advanced customization.
es: **Ir más lejos**: consulte la guía [Extending RegressionLab](extending.md) para una personalización avanzada.

source: *Need more help? Check the [Troubleshooting Guide](troubleshooting.md) or open an issue on GitHub.*
es: *¿Necesitas más ayuda? Consulte la [Guía de solución de problemas] (troubleshooting.md) o abra un problema en GitHub.*
