Repository: DOKOS-TAYOS/RegressionLab
Catalog: sphinx-docs/locale/*/LC_MESSAGES/contributing.po
Languages: es

source: Contributing to RegressionLab
es: Contribuyendo a RegressionLab

source: Thank you for your interest in contributing to RegressionLab! This guide will help you get started with contributing code, documentation, or other improvements to the project.
es: ¡Gracias por su interés en contribuir a RegressionLab! Esta guía lo ayudará a comenzar a contribuir con código, documentación u otras mejoras al proyecto.

source: Ways to Contribute
es: Formas de contribuir

source: There are many ways to contribute to RegressionLab:
es: Hay muchas maneras de contribuir a RegressionLab:

source: 🐛 **Report bugs**: Help us identify issues.
es: 🐛 **Informar errores**: Ayúdanos a identificar problemas.

source: 💡 **Suggest features**: Share your ideas for improvements.
es: 💡 **Sugerir funciones**: comparte tus ideas para mejorar.

source: 📝 **Improve documentation**: Fix typos, add examples, clarify explanations.
es: 📝 **Mejorar la documentación**: corregir errores tipográficos, agregar ejemplos, aclarar explicaciones.

source: 🔧 **Fix bugs**: Submit patches for known issues.
es: 🔧 **Corregir errores**: envíe parches para problemas conocidos.

source: ✨ **Add features**: Implement new functionality.
es: ✨ **Agregar funciones**: implementar nuevas funciones.

source: 🧪 **Write tests**: Improve code coverage.
es: 🧪 **Pruebas de escritura**: mejora la cobertura del código.

source: 🌍 **Add translations**: Support more languages.
es: 🌍 **Agregar traducciones**: Admite más idiomas.

source: 📊 **Add equations**: Contribute new fitting functions.
es: 📊 **Agregar ecuaciones**: aporta nuevas funciones de ajuste.

source: 🎨 **Improve UI/UX**: Enhance user experience.
es: 🎨 **Mejorar UI/UX**: mejora la experiencia del usuario.

source: Getting Started
es: Empezando

source: 1. Fork and Clone
es: 1. Bifurcar y clonar

source: 2. Set Up Development Environment
es: 2. Configurar el entorno de desarrollo

source: 3. Create a Branch
es: 3. Crea una sucursal

source: **Branch Naming Conventions**:
es: **Convenciones de nomenclatura de sucursales**:

source: `feature/` - New features.
es: `feature/` - Nuevas funciones.

source: `fix/` - Bug fixes.
es: `fix/` - Corrección de errores.

source: `docs/` - Documentation updates.
es: `docs/` - Actualizaciones de documentación.

source: `refactor/` - Code refactoring.
es: `refactor/` - Refactorización de código.

source: `test/` - Adding or updating tests.
es: `test/` - Agregar o actualizar pruebas.

source: Development Guidelines
es: Pautas de desarrollo

source: Code Style
es: Estilo de código

source: RegressionLab follows PEP 8 with some project-specific conventions:
es: RegressionLab sigue PEP 8 con algunas convenciones específicas del proyecto:

source: 1. Line Length
es: 1. Longitud de la línea

source: Maximum 100 characters per line.
es: Máximo 100 caracteres por línea.

source: For long strings, use implicit concatenation or `textwrap`.
es: Para cadenas largas, utilice concatenación implícita o "textwrap".

source: 2. Type Hints
es: 2. Escriba sugerencias

source: Always include type hints for function signatures:
es: Incluya siempre sugerencias de tipo para las firmas de funciones:

source: 3. Docstrings
es: 3. Cadenas de documentos

source: Use Google-style docstrings:
es: Utilice cadenas de documentación al estilo de Google:

source: 4. Imports
es: 4. Importaciones

source: Organize imports in three groups, separated by blank lines:
es: Organice las importaciones en tres grupos, separados por líneas en blanco:

source: 5. Naming Conventions
es: 5. Convenciones de nomenclatura

source: **Functions/variables**: `snake_case`
es: **Funciones/variables**: `snake_case`

source: **Classes**: `PascalCase`
es: **Clases**: `PascalCase`

source: **Constants**: `UPPER_SNAKE_CASE`
es: **Constantes**: `UPPER_SNAKE_CASE`

source: **Private members**: `_leading_underscore`
es: **Miembros privados**: `_leading_underscore`

source: 6. Comments
es: 6. Comentarios

source: Use comments sparingly - prefer self-documenting code
es: Utilice los comentarios con moderación; prefiera el código autodocumentado

source: Comments should explain *why*, not *what*
es: Los comentarios deben explicar *por qué*, no *qué*

source: Keep comments up-to-date when code changes
es: Mantenga los comentarios actualizados cuando cambie el código

source: Testing
es: Pruebas

source: Writing Tests
es: Pruebas de escritura

source: **Location**: Place tests in `tests/` directory
es: **Ubicación**: Coloque las pruebas en el directorio `tests/`

source: **Naming**: Test files should match source files: `test_<module>.py`
es: **Denominación**: los archivos de prueba deben coincidir con los archivos fuente: `test_<módulo>.py`

source: **Structure**: Use pytest conventions
es: **Estructura**: utilice convenciones de pytest

source: Running Tests
es: Ejecución de pruebas

source: Check coverage:
es: Consultar cobertura:

source: Adding New Fitting Functions
es: Agregar nuevas funciones de adaptación

source: See [Extending RegressionLab](extending.md) for detailed guide.
es: Consulte [Extending RegressionLab](extending.md) para obtener una guía detallada.

source: Summary:
es: Resumen:

source: Add mathematical and fitting functions in `src/fitting/functions/` (e.g. `special.py`, `polynomials.py`)
es: Agregue funciones matemáticas y de ajuste en `src/fitting/functions/` (por ejemplo, `special.py`, `polynomials.py`)

source: Export the fit function from `src/fitting/functions/__init__.py`, then register in `src/config/equations.yaml` (add entry with `function`, `formula`, `format`, `param_names`)
es: Exporte la función de ajuste desde `src/fitting/functions/__init__.py`, luego regístrela en `src/config/equations.yaml` (agregue una entrada con `function`, `formula`, `format`, `param_names`)

source: Add translations to `src/locales/` (en.json, es.json, de.json)
es: Agregar traducciones a `src/locales/` (en.json, es.json, de.json)

source: Write tests in `tests/test_fitting_functions.py`
es: Escribe pruebas en `tests/test_fitting_functions.py`

source: Update documentation
es: Actualizar documentación

source: Adding Translations
es: Agregar traducciones

source: To add a new language:
es: Para agregar un nuevo idioma:

source: **Create locale file**: `src/locales/<language_code>.json`
es: **Crear archivo local**: `src/locales/<código_idioma>.json`

source: **Update config**: Add the language code to `SUPPORTED_LANGUAGE_CODES` and `LANGUAGE_ALIASES` in `src/config/constants.py`
es: **Actualizar configuración**: agregue el código de idioma a `SUPPORTED_LANGUAGE_CODES` y `LANGUAGE_ALIASES` en `src/config/constants.py`

source: **Test thoroughly**: Check all UI elements in both interfaces
es: **Pruebe minuciosamente**: verifique todos los elementos de la interfaz de usuario en ambas interfaces

source: **Update documentation**: Add language to README and docs
es: **Actualizar documentación**: agregar idioma a README y documentos

source: Documentation
es: Documentación

source: Updating Documentation
es: Actualización de documentación

source: Documentation is in `docs/` directory
es: La documentación está en el directorio `docs/`

source: Use Markdown format
es: Usar formato Markdown

source: Follow existing structure and style
es: Seguir la estructura y el estilo existentes

source: Include code examples where appropriate
es: Incluya ejemplos de código cuando corresponda

source: Add screenshots for UI changes (place in `docs/images/`)
es: Agregar capturas de pantalla para cambios en la interfaz de usuario (colocar en `docs/images/`)

source: Building Documentation
es: Documentación de construcción

source: Submitting Changes
es: Enviar cambios

source: 1. Commit Your Changes
es: 1. Confirme sus cambios

source: Write clear, descriptive commit messages:
es: Escriba mensajes de confirmación claros y descriptivos:

source: **Commit Message Format**:
es: **Formato de mensaje de confirmación**:

source: **Types**:
es: **Tipos**:

source: `feat`: New feature.
es: `feat`: Nueva característica.

source: `fix`: Bug fix.
es: `arreglar`: Corrección de errores.

source: `docs`: Documentation changes.
es: `docs`: cambios en la documentación.

source: `style`: Code style changes (formatting, no logic change).
es: `style`: cambios de estilo de código (formato, sin cambios de lógica).

source: `refactor`: Code refactoring.
es: `refactor`: refactorización de código.

source: `test`: Adding or updating tests.
es: `test`: Agregar o actualizar pruebas.

source: `chore`: Maintenance tasks.
es: `chore`: Tareas de mantenimiento.

source: **Example**:
es: **Ejemplo**:

source: 2. Push to Your Fork
es: 2. Empuja hacia tu tenedor

source: 3. Create Pull Request
es: 3. Crear solicitud de extracción

source: Go to your fork on GitHub
es: Ve a tu bifurcación en GitHub

source: Click "New Pull Request"
es: Haga clic en "Nueva solicitud de extracción"

source: Select your branch
es: Selecciona tu sucursal

source: Fill out the pull request template:
es: Complete la plantilla de solicitud de extracción:

source: **Title**: Clear, concise summary
es: **Título**: Resumen claro y conciso

source: **Description**: What changes were made and why
es: **Descripción**: Qué cambios se realizaron y por qué

source: **Testing**: How you tested the changes
es: **Pruebas**: Cómo probaste los cambios

source: **Screenshots**: For UI changes
es: **Capturas de pantalla**: para cambios en la interfaz de usuario

source: **Closes**: Reference any related issues
es: **Cierra**: haga referencia a cualquier problema relacionado

source: Pull Request Checklist
es: Lista de verificación de solicitud de extracción

source: Before submitting, ensure:
es: Antes de enviar, asegúrese de:

source: Code follows project style guidelines
es: El código sigue las pautas de estilo del proyecto.

source: All tests pass (`pytest tests/`)
es: Todas las pruebas pasan (`pytest tests/`)

source: New tests added for new functionality
es: Se agregaron nuevas pruebas para nuevas funciones.

source: Documentation updated (if needed)
es: Documentación actualizada (si es necesario)

source: Commit messages are clear and descriptive
es: Los mensajes de confirmación son claros y descriptivos.

source: No unnecessary files included (check `.gitignore`)
es: No se incluyen archivos innecesarios (marque `.gitignore`)

source: Type hints included
es: Sugerencias de tipo incluidas

source: Docstrings added for new functions
es: Cadenas de documentos agregadas para nuevas funciones

source: Translations added (if UI changes)
es: Traducciones agregadas (si la interfaz de usuario cambia)

source: CHANGELOG.md updated (for significant changes)
es: CHANGELOG.md actualizado (para cambios significativos)

source: Review Process
es: Proceso de revisión

source: **Automated checks**: CI/CD runs tests automatically
es: **Comprobaciones automatizadas**: CI/CD ejecuta pruebas automáticamente

source: **Code review**: Maintainer reviews your code
es: **Revisión de código**: el mantenedor revisa su código

source: **Feedback**: Address any requested changes
es: **Comentarios**: Aborde cualquier cambio solicitado

source: **Approval**: Once approved, changes are merged
es: **Aprobación**: una vez aprobados, los cambios se fusionan

source: **Cleanup**: Delete your branch after merge
es: **Limpieza**: elimina tu rama después de la fusión

source: Development Setup
es: Configuración de desarrollo

source: Recommended Tools
es: Herramientas recomendadas

source: **IDE**: Visual Studio Code, PyCharm, or your preference
es: **IDE**: Visual Studio Code, PyCharm o su preferencia

source: **Git Client**: Command line, GitKraken, or GitHub Desktop
es: **Cliente Git**: línea de comando, GitKraken o GitHub Desktop

source: **Python Version**: 3.12 or higher
es: **Versión de Python**: 3.12 o superior

source: **Virtual Environment**: Always use virtual environments
es: **Entorno virtual**: utilice siempre entornos virtuales

source: VS Code Setup
es: Configuración del código VS

source: Recommended extensions:
es: Extensiones recomendadas:

source: Python (Microsoft)
es: Pitón (Microsoft)

source: Python Test Explorer
es: Explorador de pruebas de Python

source: Markdown All in One
es: Rebaja todo en uno

source: Workspace settings (`.vscode/settings.json`):
es: Configuración del espacio de trabajo (`.vscode/settings.json`):

source: The project uses **Ruff** for linting (see `requirements-dev.txt` and `pyproject.toml` optional `[dev]` dependencies). Ruff reads configuration from `pyproject.toml`. Install the [Ruff extension](https://marketplace.visualstudio.com/items?itemName=charliermarsh.ruff) for VS Code.
es: El proyecto usa **Ruff** para linting (consulte las dependencias opcionales `[dev]` de `requirements-dev.txt` y `pyproject.toml`). Ruff lee la configuración de `pyproject.toml`. Instale la [extensión Ruff](https://marketplace.visualstudio.com/items?itemName=charliermarsh.ruff) para VS Code.

source: Project Structure
es: Estructura del proyecto

source: Understanding the codebase:
es: Comprender el código base:

source: Communication
es: Comunicación

source: Asking Questions
es: Hacer preguntas

source: **GitHub Discussions**: For general questions and ideas
es: **Discusiones de GitHub**: para preguntas e ideas generales

source: **GitHub Issues**: For bug reports and feature requests
es: **Problemas de GitHub**: para informes de errores y solicitudes de funciones

source: **Email**: For private inquiries
es: **Correo electrónico**: Para consultas privadas

source: Reporting Bugs
es: Informar errores

source: Use the GitHub issue template and include:
es: Utilice la plantilla de incidencias de GitHub e incluya:

source: **Title**: Clear, specific description
es: **Título**: descripción clara y específica

source: **Version**: RegressionLab version
es: **Versión**: versión de RegressionLab

source: **Environment**: OS, Python version
es: **Entorno**: SO, versión Python

source: **Steps to reproduce**: Exact steps
es: **Pasos para reproducir**: Pasos exactos

source: **Expected behavior**: What should happen
es: **Comportamiento esperado**: ¿Qué debería suceder?

source: **Actual behavior**: What actually happens
es: **Comportamiento real**: lo que realmente sucede

source: **Error messages**: Full traceback
es: **Mensajes de error**: rastreo completo

source: **Sample data**: If possible
es: **Datos de muestra**: Si es posible

source: **Screenshots**: For UI issues
es: **Capturas de pantalla**: para problemas con la interfaz de usuario

source: Suggesting Features
es: Sugerencias de características

source: Use the GitHub feature request template:
es: Utilice la plantilla de solicitud de funciones de GitHub:

source: **Problem description**: What problem does this solve?
es: **Descripción del problema**: ¿Qué problema resuelve esto?

source: **Proposed solution**: How should it work?
es: **Solución propuesta**: ¿Cómo debería funcionar?

source: **Alternatives**: Other solutions considered
es: **Alternativas**: otras soluciones consideradas

source: **Additional context**: Examples, mockups, etc.
es: **Contexto adicional**: Ejemplos, maquetas, etc.

source: Code of Conduct
es: Código de conducta

source: Our Standards
es: Nuestros estándares

source: **Be respectful**: Treat everyone with respect.
es: **Sea respetuoso**: Trate a todos con respeto.

source: **Be constructive**: Provide helpful feedback.
es: **Sea constructivo**: proporcione comentarios útiles.

source: **Be patient**: Everyone is learning.
es: **Ten paciencia**: todos están aprendiendo.

source: **Be professional**: Keep discussions on-topic.
es: **Sea profesional**: mantenga las discusiones centradas en el tema.

source: Unacceptable Behavior
es: Comportamiento inaceptable

source: Harassment or discriminatory language.
es: Acoso o lenguaje discriminatorio.

source: Personal attacks.
es: Ataques personales.

source: Trolling or inflammatory comments.
es: Comentarios trolling o incendiarios.

source: Publishing private information.
es: Publicar información privada.

source: Other unprofessional conduct.
es: Otras conductas no profesionales.

source: Enforcement
es: Aplicación

source: Violations may result in:
es: Las violaciones pueden resultar en:

source: Warning.
es: Advertencia.

source: Temporary ban.
es: Prohibición temporal.

source: Permanent ban.
es: Prohibición permanente.

source: Report issues to: alejandro.mata.ali@gmail.com
es: Reportar problemas a: alejandro.mata.ali@gmail.com

source: License
es: Licencia

source: By contributing to RegressionLab, you agree that your contributions will be licensed under the MIT License.
es: Al contribuir a RegressionLab, usted acepta que sus contribuciones tendrán la licencia MIT.

source: Recognition
es: Reconocimiento

source: Contributors may be recognized in:
es: Los contribuyentes podrán ser reconocidos en:

source: A `CONTRIBUTORS.md` file (if added to the project).
es: Un archivo `CONTRIBUTORS.md` (si se agrega al proyecto).

source: Release notes.
es: Notas de lanzamiento.

source: Documentation credits.
es: Créditos de documentación.

source: Thank you for contributing to RegressionLab! 🎉
es: ¡Gracias por contribuir a RegressionLab! 🎉

source: *Questions about contributing? Open a GitHub Discussion or email alejandro.mata.ali@gmail.com.*
es: *¿Tienes preguntas sobre cómo contribuir? Abra una discusión de GitHub o envíe un correo electrónico a alejandro.mata.ali@gmail.com.*
