Repository: DOKOS-TAYOS/RegressionLab
Catalog: sphinx-docs/locale/*/LC_MESSAGES/customization.po
Languages: es

source: Customizing the Fitting Core
es: Personalización del núcleo de adaptación

source: This guide explains how to replace or modify the curve fitting engine in RegressionLab. By default, RegressionLab uses SciPy's `curve_fit` function, but you may want to use a different optimization library for specific needs.
es: Esta guía explica cómo reemplazar o modificar el motor de ajuste de curvas en RegressionLab. De forma predeterminada, RegressionLab usa la función `curve_fit` de SciPy, pero es posible que desees usar una biblioteca de optimización diferente para necesidades específicas.

source: Overview
es: Descripción general

source: RegressionLab's fitting architecture is modular, making it relatively easy to swap out the optimization backend. This guide covers:
es: La arquitectura adecuada de RegressionLab es modular, lo que hace que sea relativamente fácil cambiar el backend de optimización. Esta guía cubre:

source: **Understanding the current architecture**
es: **Comprensión de la arquitectura actual**

source: **Why you might want to change it**
es: **Por qué es posible que quieras cambiarlo**

source: **How to replace SciPy with another library**
es: **Cómo reemplazar SciPy con otra biblioteca**

source: **Alternative optimization libraries**
es: **Bibliotecas de optimización alternativas**

source: **Performance considerations**
es: **Consideraciones de rendimiento**

source: Current Architecture
es: Arquitectura actual

source: How Fitting Works Now
es: Cómo funciona el ajuste ahora

source: RegressionLab's fitting pipeline:
es: Canal de adaptación de RegressionLab:

source: Key File: `fitting_utils.py`
es: Archivo clave: `fitting_utils.py`

source: The core fitting logic is in `src/fitting/fitting_utils.py`:
es: La lógica de adaptación principal está en `src/fitting/fitting_utils.py`:

source: This function is the **single point of control** for the optimization backend.
es: Esta función es el **único punto de control** para el backend de optimización.

source: Why Change the Fitting Core?
es: ¿Por qué cambiar el núcleo de ajuste?

source: Reasons to Use a Different Library
es: Razones para utilizar una biblioteca diferente

source: **Performance**: Some libraries are faster for specific problem types
es: **Rendimiento**: algunas bibliotecas son más rápidas para tipos de problemas específicos

source: **Robustness**: Better handling of difficult optimization problems
es: **Robustez**: Mejor manejo de problemas de optimización difíciles

source: **Features**: Access to different optimization algorithms (global optimization, constraints, etc.)
es: **Características**: Acceso a diferentes algoritmos de optimización (optimización global, restricciones, etc.)

source: **Licensing**: Some libraries have different licenses
es: **Licencias**: algunas bibliotecas tienen licencias diferentes

source: **Custom needs**: Specialized algorithms for your domain
es: **Necesidades personalizadas**: Algoritmos especializados para tu dominio

source: Popular Alternatives
es: Alternativas populares

source: Library
es: Biblioteca

source: Pros
es: Ventajas

source: Cons
es: Contras

source: **lmfit**
es: ** estoy en forma **

source: High-level API, parameter constraints, many models
es: API de alto nivel, restricciones de parámetros, muchos modelos

source: Additional dependency
es: Dependencia adicional

source: **scipy.optimize.least_squares**
es: **scipy.optimize.mínimos_cuadrados**

source: More options than curve_fit, robust loss functions
es: Más opciones que curve_fit, funciones de pérdida robustas

source: Lower-level API
es: API de nivel inferior

source: **scipy.optimize.minimize**
es: **scipy.optimizar.minimizar**

source: General optimization, many algorithms
es: Optimización general, muchos algoritmos.

source: Not specialized for curve fitting
es: No especializado para ajuste de curvas

source: **PyGMO**
es: **PyGM**

source: Global optimization, parallel evaluation
es: Optimización global, evaluación paralela

source: Complex, heavy dependency
es: Dependencia compleja y fuerte

source: **NLopt**
es: **NLoptar**

source: Fast, many algorithms, constraints
es: Rápido, muchos algoritmos, restricciones.

source: C library binding, harder to install
es: Enlace de biblioteca C, más difícil de instalar

source: GPU acceleration, automatic differentiation
es: Aceleración de GPU, diferenciación automática

source: Overkill for simple fits, steep learning curve
es: Exceso para ajustes simples, curva de aprendizaje pronunciada

source: How to Replace the Fitting Core
es: Cómo reemplazar el núcleo de conexión

source: Method 1: Modify `generic_fit` Function
es: Método 1: modificar la función `generic_fit`

source: This is the recommended approach as it requires minimal changes to the codebase.
es: Este es el enfoque recomendado ya que requiere cambios mínimos en el código base.

source: Example: Using lmfit
es: Ejemplo: uso de lmfit

source: **Step 1: Install lmfit**
es: **Paso 1: Instalar lmfit**

source: Add to `requirements.txt`:
es: Agregar a `requisitos.txt`:

source: **Step 2: Create Alternative Generic Fit**
es: **Paso 2: Crear un ajuste genérico alternativo**

source: Create a new function in `fitting_utils.py`:
es: Crea una nueva función en `fitting_utils.py`:

source: **Step 3: Switch to New Implementation**
es: **Paso 3: Cambiar a una nueva implementación**

source: Option A - Replace original:
es: Opción A - Reemplazar original:

source: Option B - Use configuration flag:
es: Opción B: utilizar el indicador de configuración:

source: Example: Using scipy.optimize.least_squares
es: Ejemplo: uso de scipy.optimize.least_squares

source: For more control and robust loss functions:
es: Para obtener más control y funciones de pérdida sólidas:

source: **Robust Loss Functions**:
es: **Funciones de pérdida robustas**:

source: `'linear'`: Standard least squares (default, same as curve_fit)
es: `'lineal'`: Mínimos cuadrados estándar (predeterminado, igual que curve_fit)

source: `'soft_l1'`: Robust to outliers, smooth transition
es: `'soft_l1'`: Robusto a valores atípicos, transición suave

source: `'huber'`: Robust to outliers, less aggressive
es: ``huber'': Robusto ante valores atípicos, menos agresivo

source: `'cauchy'`: Very robust to outliers, but can converge slowly
es: `'cauchy'`: muy resistente a los valores atípicos, pero puede converger lentamente

source: `'arctan'`: Similar to Cauchy
es: ``arctan'': Similar a Cauchy

source: Method 2: Create Custom Fitting Wrapper
es: Método 2: crear un envoltorio de ajuste personalizado

source: For specialized needs, create domain-specific fitting functions:
es: Para necesidades especializadas, cree funciones de adaptación específicas de dominio:

source: Method 3: Bayesian Fitting with MCMC
es: Método 3: Ajuste bayesiano con MCMC

source: For uncertainty quantification with complex models:
es: Para cuantificación de incertidumbre con modelos complejos:

source: Advanced: Parameter Constraints and Bounds
es: Avanzado: restricciones y límites de parámetros

source: Adding Bounds to Existing Functions
es: Agregar límites a funciones existentes

source: Modify individual fitting functions to include bounds:
es: Modifique funciones de ajuste individuales para incluir límites:

source: Creating a Configurable Bounds System
es: Crear un sistema de límites configurable

source: Add bounds to function metadata:
es: Agregue límites a los metadatos de la función:

source: Performance Considerations
es: Consideraciones de rendimiento

source: Benchmarking Different Backends
es: Evaluación comparativa de diferentes backends

source: Create a benchmark script:
es: Cree un script de referencia:

source: Optimization Tips
es: Consejos de optimización

source: **Vectorize operations**: Use NumPy arrays, not loops
es: **Operaciones de vectorización**: use matrices NumPy, no bucles

source: **Good initial guesses**: Reduces iterations
es: **Buenas conjeturas iniciales**: Reduce las iteraciones

source: **Appropriate tolerances**: Don't over-optimize
es: **Tolerancias adecuadas**: no optimice demasiado

source: **Warm starts**: Reuse previous fits as initial guesses
es: **Comienzos en caliente**: reutilice ajustes anteriores como conjeturas iniciales

source: Example with warm starts:
es: Ejemplo con arranques en caliente:

source: Handling Uncertainty Propagation
es: Manejo de la propagación de la incertidumbre

source: Using uncertainties Package
es: Uso del paquete de incertidumbres

source: For automatic error propagation:
es: Para la propagación automática de errores:

source: Configuration File Approach
es: Enfoque del archivo de configuración

source: Create a comprehensive configuration system:
es: Cree un sistema de configuración integral:

source: Users can then switch backends by editing the config package (e.g. `config/constants.py`) without modifying code.
es: Luego, los usuarios pueden cambiar de backend editando el paquete de configuración (por ejemplo, `config/constants.py`) sin modificar el código.

source: Testing New Backends
es: Probando nuevos backends

source: Always test thoroughly when changing the fitting core:
es: Pruebe siempre minuciosamente al cambiar el núcleo del accesorio:

source: Summary
es: Resumen

source: Approach
es: Acercarse

source: Difficulty
es: Dificultad

source: Flexibility
es: Flexibilidad

source: When to Use
es: Cuando usar

source: Modify `generic_fit`
es: Modificar `generic_fit`

source: Easy
es: Fácil

source: Low
es: Bajo

source: Simple backend swap
es: Intercambio de backend simple

source: Add backend option
es: Agregar opción de backend

source: Medium
es: Medio

source: Support multiple backends
es: Admite múltiples servidores

source: Custom fitting functions
es: Funciones de ajuste personalizadas

source: High
es: Alto

source: Specialized needs per equation
es: Necesidades especializadas por ecuación

source: Configuration system
es: Sistema de configuración

source: Hard
es: Duro

source: Very High
es: muy alto

source: Production deployments
es: Implementaciones de producción

source: **Recommendations**:
es: **Recomendaciones**:

source: **Start simple**: Modify `generic_fit` directly
es: **Empiece de forma sencilla**: modifique `generic_fit` directamente

source: **For production**: Use configuration system
es: **Para producción**: Usar sistema de configuración

source: **For research**: Create specialized fitting functions
es: **Para investigación**: cree funciones de adaptación especializadas

source: **Always test**: Verify results match expectations
es: **Prueba siempre**: verifica que los resultados coincidan con las expectativas

source: Next Steps
es: Próximos pasos

source: **Test thoroughly**: Use known data to validate new backend
es: **Prueba minuciosamente**: utiliza datos conocidos para validar el nuevo backend

source: **Benchmark**: Compare performance with original
es: **Parámetro**: compare el rendimiento con el original

source: **Document**: Explain why you chose a different backend
es: **Documento**: Explica por qué elegiste un backend diferente

source: **Contribute**: Share your improvements with the community!
es: **Contribuye**: ¡Comparte tus mejoras con la comunidad!

source: *For more technical details, see the [API Documentation](api/index).*
es: *Para obtener más detalles técnicos, consulte la [Documentación API](api/index).*
