Repository: DOKOS-TAYOS/RegressionLab
Catalog: sphinx-docs/locale/*/LC_MESSAGES/extending.po
Languages: es

source: Extending RegressionLab
es: Ampliación del laboratorio de regresión

source: This guide explains how to add new fitting functions to RegressionLab. Whether you want to add a specific equation for your research or extend the library with new mathematical models, this guide will walk you through the process.
es: Esta guía explica cómo agregar nuevas funciones de adaptación a RegressionLab. Ya sea que desee agregar una ecuación específica para su investigación o ampliar la biblioteca con nuevos modelos matemáticos, esta guía lo guiará a través del proceso.

source: Overview
es: Descripción general

source: Adding a new fitting function involves four main steps:
es: Agregar una nueva función de adaptación implica cuatro pasos principales:

source: **Implement the model and fit function**: In the right module under `src/fitting/functions/`, add the mathematical function and a fitting wrapper that uses `generic_fit` (or `curve_fit` directly for advanced cases).
es: **Implemente el modelo y la función de ajuste**: en el módulo derecho en `src/fitting/functions/`, agregue la función matemática y un contenedor de ajuste que use `generic_fit` (o `curve_fit` directamente para casos avanzados).

source: **Export the fit function**: Add the new `fit_*` to the exports in `src/fitting/functions/__init__.py` so the app can resolve it by name.
es: **Exportar la función de ajuste**: agregue el nuevo `fit_*` a las exportaciones en `src/fitting/functions/__init__.py` para que la aplicación pueda resolverlo por nombre.

source: **Register in configuration**: Add an entry in `src/config/equations.yaml` (with `function`, `formula`, `format`, `param_names`) and add translations in `src/locales/`.
es: **Registrarse en configuración**: Agregue una entrada en `src/config/equations.yaml` (con `function`, `formula`, `format`, `param_names`) y agregue traducciones en `src/locales/`.

source: **Test**: Run the app (Tkinter or Streamlit) and optionally add tests.
es: **Prueba**: ejecuta la aplicación (Tkinter o Streamlit) y, opcionalmente, agrega pruebas.

source: The app resolves fit functions by name: it reads the `function` key from `equations.yaml` (e.g. `fit_exponential_function`) and does `getattr(fitting_functions, function_name)`. The `fitting_functions` package re-exports everything from `fitting.functions`, so any new `fit_*` must be implemented in one of the modules under `fitting/functions/` and re-exported from `fitting/functions/__init__.py`.
es: La aplicación resuelve funciones de ajuste por nombre: lee la tecla `función` de `equations.yaml` (por ejemplo, `fit_exponential_function`) y hace `getattr(fitting_functions, function_name)`. El paquete `fitting_functions` reexporta todo desde `fitting.functions`, por lo que cualquier nuevo `fit_*` debe implementarse en uno de los módulos en `fitting/functions/` y reexportarse desde `fitting/functions/__init__.py`.

source: Prerequisites
es: Requisitos previos

source: Required Knowledge
es: Conocimiento requerido

source: **Basic Python**: Functions, variables, imports
es: **Python básico**: funciones, variables, importaciones

source: **NumPy basics**: Arrays, mathematical operations
es: **Conceptos básicos de NumPy**: matrices, operaciones matemáticas

source: **Basic mathematics**: Understanding the equation you want to add
es: **Matemáticas básicas**: comprender la ecuación que deseas sumar

source: Files You'll Modify
es: Archivos que modificarás

source: Step-by-Step Guide
es: Guía paso a paso

source: Step 1: Implement the Model and Fit Function
es: Paso 1: implementar el modelo y la función de ajuste

source: Open the appropriate module under `src/fitting/functions/` (e.g. `special.py` for exponential/Gaussian, `polynomials.py` for polynomial models). Add the mathematical model (e.g. `_my_function`) and the fitting wrapper (`fit_my_function`). The model can be a private function (e.g. `_gaussian_function`) if it is only used inside that module.
es: Abra el módulo apropiado en `src/fitting/functions/` (por ejemplo, `special.py` para modelos exponenciales/gaussianos, `polynomials.py` para modelos polinomiales). Agregue el modelo matemático (por ejemplo, `_my_function`) y el contenedor de ajuste (`fit_my_function`). El modelo puede ser una función privada (por ejemplo, `_gaussian_function`) si solo se usa dentro de ese módulo.

source: Example: Adding an Exponential Function
es: Ejemplo: agregar una función exponencial

source: **Key Points**:
es: **Puntos clave**:

source: **Type hints**: Use `Numeric` type for variables that can be scalar or array
es: **Sugerencias de tipo**: use el tipo `Numeric` para variables que pueden ser escalares o de matriz

source: **Docstring**: Explain what the function does, its parameters, and return value
es: **Docstring**: Explique qué hace la función, sus parámetros y el valor de retorno.

source: **NumPy functions**: Use `np.exp()`, `np.sin()`, etc. for array compatibility
es: **Funciones NumPy**: utilice `np.exp()`, `np.sin()`, etc. para compatibilidad con matrices

source: **Parameter order**: After `t`, list all fitting parameters
es: **Orden de parámetros**: después de `t`, enumere todos los parámetros de ajuste

source: More Examples
es: Más ejemplos

source: **Power Law**:
es: **Ley de potencia**:

source: **Gaussian**:
es: **Gaussiano**:

source: **Logistic**:
es: **Logístico**:

source: **Hyperbola**:
es: **Hipérbola**:

source: Step 2: Create the Fitting Wrapper
es: Paso 2: cree el envoltorio adecuado

source: In the same module under `fitting/functions/`, create a fitting wrapper. The wrapper must have this signature and return type:
es: En el mismo módulo, en `fitting/functions/`, cree un contenedor de ajuste. El contenedor debe tener esta firma y tipo de devolución:

source: **Signature**: `(data, x_name, y_name, initial_guess_override=None, bounds_override=None)`
es: **Firma**: `(datos, nombre_x, nombre_y, inicial_guess_override=Ninguno, límites_override=Ninguno)`

source: **Return**: Your wrapper can return `(text, y_fitted, equation)` or the full 4-tuple from `generic_fit`: `(text, y_fitted, equation, fit_info)`. R² is included in `text`. Callers (e.g. Streamlit) use the first three values.
es: **Retorno**: Su contenedor puede devolver `(text, y_fitted, ecuación)` o la tupla completa de `generic_fit`: `(text, y_fitted, ecuación, fit_info)`. R² está incluido en "texto". Las personas que llaman (por ejemplo, Streamlit) utilizan los primeros tres valores.

source: Use `get_equation_param_names_for_function('fit_<name>')` and `get_equation_format_for_function('fit_<name>')` so parameter names and the equation format live only in `equations.yaml`. That way you define them once in config.
es: Utilice `get_equation_param_names_for_function('fit_<name>')` y `get_equation_format_for_function('fit_<name>')` para que los nombres de los parámetros y el formato de la ecuación vivan solo en `equations.yaml`. De esa manera los defines una vez en config.

source: Basic Template
es: Plantilla básica

source: **Signature**: Include `initial_guess_override` and `bounds_override` so the workflow can pass user overrides; they can be `None` if you do not use them.
es: **Firma**: incluya `initial_guess_override` y `bounds_override` para que el flujo de trabajo pueda pasar las anulaciones del usuario; pueden ser "Ninguno" si no los usa.

source: **Config-driven params**: Prefer `get_equation_param_names_for_function` and `get_equation_format_for_function` so the equation is defined once in `equations.yaml`.
es: **Parámetros controlados por configuración**: prefiera `get_equation_param_names_for_function` y `get_equation_format_for_function` para que la ecuación se defina una vez en `equations.yaml`.

source: **Return**: `generic_fit` returns `(text, y_fitted, equation, fit_info)` (four values). Your wrapper can `return generic_fit(...)`; callers that only need text, y_fitted, and equation use the first three elements.
es: **Retorno**: `generic_fit` devuelve `(text, y_fitted, ecuación, fit_info)` (cuatro valores). Su contenedor puede `devolver generic_fit(...)`; las personas que llaman que solo necesitan texto, y_fitted y ecuación usan los primeros tres elementos.

source: With Initial Guess and Bounds
es: Con conjeturas y límites iniciales

source: For complex functions, use estimators (from `_base` or `estimators`) and merge helpers:
es: Para funciones complejas, use estimadores (de `_base` o `estimators`) y combine ayudantes:

source: Step 3: Export the Fit Function
es: Paso 3: Exportar la función Ajustar

source: The app resolves the fit function by name with `getattr(fitting_functions, function_name)`. The `fitting_functions` package re-exports from `fitting.functions`, so you must export your new `fit_*` from `src/fitting/functions/__init__.py`.
es: La aplicación resuelve la función de ajuste por nombre con `getattr(fitting_functions, function_name)`. El paquete `fitting_functions` se reexporta desde `fitting.functions`, por lo que debes exportar tu nuevo `fit_*` desde `src/fitting/functions/__init__.py`.

source: Add your fit function to the appropriate `from .<module> import ...` (e.g. `from .special import ..., fit_my_function`).
es: Agregue su función de ajuste al `from .<module> import...` apropiado (por ejemplo, `from .special import..., fit_my_function`).

source: Add the same name to the `__all__` list in that file.
es: Agregue el mismo nombre a la lista `__all__` en ese archivo.

source: If you omit this step, the app will raise `AttributeError` when the user selects your equation.
es: Si omite este paso, la aplicación generará "AttributeError" cuando el usuario seleccione su ecuación.

source: Step 4: Register in Configuration
es: Paso 4: Regístrese en Configuración

source: Add to equations.yaml
es: Agregar a ecuaciones.yaml

source: Open `src/config/equations.yaml` and add a new entry. The key is the equation ID (e.g. `exponential_function`). The order of entries defines the order in the UI.
es: Abra `src/config/equations.yaml` y agregue una nueva entrada. La clave es el ID de la ecuación (por ejemplo, "función_exponencial"). El orden de las entradas define el orden en la interfaz de usuario.

source: **`function`**: Exact name of your fitting function (e.g. `fit_exponential_function`). Must match the name exported from `fitting.functions`.
es: **`función`**: Nombre exacto de su función de ajuste (por ejemplo, `fit_exponential_function`). Debe coincidir con el nombre exportado desde `fitting.functions`.

source: **`formula`**: Display string for the UI (Tkinter and Streamlit).
es: **`fórmula`**: Cadena de visualización para la interfaz de usuario (Tkinter y Streamlit).

source: **`format`**: Template with `{param}` placeholders used to build the fitted equation string (e.g. `y={a} exp({b}x)`). Required by `generic_fit` when using `get_equation_format_for_function`.
es: **`format`**: Plantilla con marcadores de posición `{param}` utilizados para construir la cadena de ecuación ajustada (por ejemplo, `y={a} exp({b}x)`). Requerido por `generic_fit` cuando se usa `get_equation_format_for_function`.

source: **`param_names`**: List of parameter names in the order expected by your mathematical function (same order as in the model signature after the independent variable).
es: **`param_names`**: Lista de nombres de parámetros en el orden esperado por su función matemática (el mismo orden que en la firma del modelo después de la variable independiente).

source: The application loads this file at startup; `AVAILABLE_EQUATION_TYPES` and `EQUATIONS` in `config.constants` are built from it, so you do not need to edit `constants.py`.
es: La aplicación carga este archivo al inicio; `AVAILABLE_EQUATION_TYPES` y `EQUACIONES` en `config.constants` se crean a partir de él, por lo que no es necesario editar `constants.py`.

source: Add Translations
es: Agregar traducciones

source: Add translations for the equation ID in the `equations` section of each locale file:
es: Agregue traducciones para el ID de la ecuación en la sección "ecuaciones" de cada archivo local:

source: **English** (`src/locales/en.json`):
es: **Inglés** (`src/locales/en.json`):

source: **Spanish** (`src/locales/es.json`):
es: **Español** (`src/locales/es.json`):

source: **German** (`src/locales/de.json`):
es: **Alemán** (`src/locales/de.json`):

source: Step 5: Test Your Function
es: Paso 5: prueba tu función

source: Create Test Data
es: Crear datos de prueba

source: Create a test file in `input/` folder:
es: Cree un archivo de prueba en la carpeta `input/`:

source: Run the script:
es: Ejecute el script:

source: Test in Tkinter
es: Prueba en Tkinter

source: Run RegressionLab
es: Ejecute el laboratorio de regresión

source: Select "Normal Fitting"
es: Seleccione "Ajuste normal"

source: Choose "Exponential Function" from equation dropdown
es: Elija "Función exponencial" en el menú desplegable de ecuaciones

source: Load `exponential_test.csv`
es: Cargar `exponential_test.csv`

source: Select x and y variables
es: Seleccionar variables x e y

source: View results and check:
es: Ver resultados y comprobar:

source: Parameters are reasonable (a ≈ 2.5, b ≈ 0.8)
es: Los parámetros son razonables (a ≈ 2,5, b ≈ 0,8)

source: R² is high (> 0.95)
es: R² es alto (> 0,95)

source: Plot looks good
es: La trama se ve bien

source: Test in Streamlit
es: Prueba en Streamlit

source: Run `streamlit run src/streamlit_app/app.py`
es: Ejecute `streamlit run src/streamlit_app/app.py`

source: Upload `exponential_test.csv`
es: Sube `exponential_test.csv`

source: Select "Exponential Function"
es: Seleccione "Función exponencial"

source: Verify results
es: Verificar resultados

source: Advanced Topics
es: Temas avanzados

source: Parameter Bounds
es: Límites de parámetros

source: `generic_fit` accepts a `bounds` argument. Pass `(lower_bounds, upper_bounds)` when building your fit (see "With Initial Guess and Bounds" above). For full control (e.g. custom formatting), use `curve_fit` directly and then build the same return tuple `(text, y_fitted, equation[, fit_info])` that `generic_fit` returns, including R² in the text.
es: `generic_fit` acepta un argumento `límites`. Pase `(límites_inferiores, límites_superiores)` cuando desarrolle su ajuste (consulte "Con estimaciones y límites iniciales" más arriba). Para un control total (por ejemplo, formato personalizado), use `curve_fit` directamente y luego cree la misma tupla de retorno `(text, y_fitted, ecuación[, fit_info])` que devuelve `generic_fit`, incluido R² en el texto.

source: Fixed Parameters
es: Parámetros fijos

source: Fit with some parameters fixed: define a reduced model that takes only the free parameters and pass the corresponding `param_names` and `equation_template` (or register a separate equation in `equations.yaml` with its own `format` and `param_names`).
es: Ajuste con algunos parámetros fijos: defina un modelo reducido que tome solo los parámetros libres y pase los correspondientes `param_names` y `equation_template` (o registre una ecuación separada en `equations.yaml` con su propio `format` y `param_names`).

source: Multi-Dimensional Functions
es: Funciones multidimensionales

source: For functions of multiple variables (e.g., z = f(x, y)), you'll need to use `curve_fit` directly since `generic_fit` is designed for single-variable functions:
es: Para funciones de múltiples variables (por ejemplo, z = f(x, y)), necesitarás usar `curve_fit` directamente ya que `generic_fit` está diseñado para funciones de una sola variable:

source: Piecewise Functions
es: Funciones por partes

source: Functions with different behaviors in different regions:
es: Funciones con diferentes comportamientos en diferentes regiones:

source: Code Style Guidelines
es: Pautas de estilo de código

source: Follow Existing Conventions
es: Siga las convenciones existentes

source: **Naming**:
es: **Denominación**:

source: Mathematical functions: `<name>_function` (e.g., `exponential_function`)
es: Funciones matemáticas: `<nombre>_función` (por ejemplo, `función_exponencial`)

source: Fitting functions: `fit_<name>` (e.g., `fit_exponential`)
es: Funciones de ajuste: `fit_<nombre>` (por ejemplo, `fit_exponential`)

source: Use snake_case for function names
es: Utilice Snake_case para nombres de funciones

source: **Type Hints**:
es: **Sugerencias de tipo**:

source: **Docstrings**:
es: **Cadenas de documentos**:

source: For fitting wrapper functions:
es: Para funciones de envoltura de montaje:

source: **Error Handling**: `generic_fit` raises `FittingError` on failure. You can wrap your fit in try/except to log or re-raise; the workflow controller already handles errors from the fit function.
es: **Manejo de errores**: `generic_fit` genera `FittingError` en caso de falla. Puedes terminar tu ajuste en try/except para iniciar sesión o volver a subir; el controlador de flujo de trabajo ya maneja los errores de la función de ajuste.

source: Testing
es: Pruebas

source: Create a test file in `tests/` directory:
es: Cree un archivo de prueba en el directorio `tests/`:

source: Run tests:
es: Ejecutar pruebas:

source: Common Patterns
es: Patrones comunes

source: Pattern 1: Simple Function
es: Patrón 1: función simple

source: For straightforward equations without special requirements:
es: Para ecuaciones sencillas sin requisitos especiales:

source: Pattern 2: Function with Estimation
es: Patrón 2: Función con estimación

source: For complex functions needing initial guesses, use estimators from `_base` (or add one in `estimators.py` and re-export from `_base`) and `merge_initial_guess` / `merge_bounds`:
es: Para funciones complejas que necesitan conjeturas iniciales, use estimadores de `_base` (o agregue uno en `estimators.py` y vuelva a exportarlo desde `_base`) y `merge_initial_guess`/`merge_bounds`:

source: Pattern 3: Specialized Function
es: Patrón 3: función especializada

source: For functions with constraints or special handling, use `curve_fit` directly and build the same return tuple `(text, y_fitted, equation[, fit_info])` that `generic_fit` returns (include R² in the text). See existing implementations in `fitting/functions/special.py` for examples with bounds and custom estimators.
es: Para funciones con restricciones o manejo especial, use `curve_fit` directamente y cree la misma tupla de retorno `(text, y_fitted, ecuación[, fit_info])` que devuelve `generic_fit` (incluya R² en el texto). Consulte las implementaciones existentes en `fitting/functions/special.py` para ver ejemplos con límites y estimadores personalizados.

source: Example: Complete Implementation
es: Ejemplo: implementación completa

source: Here's a complete example adding a Stretched Exponential function.
es: Aquí hay un ejemplo completo que agrega una función exponencial extendida.

source: **1. Add to `fitting/functions/special.py`:**
es: **1. Agregar a `fitting/functions/special.py`:**

source: **2. Export in `fitting/functions/__init__.py`:** Add `fit_stretched_exponential` to the `from .special import ...` list and to `__all__`.
es: **2. Exportar en `fitting/functions/__init__.py`:** Agregue `fit_stretched_exponential` a la lista `from .special import...` y a `__all__`.

source: **3. Add to `config/equations.yaml`:**
es: **3. Agregar a `config/equations.yaml`:**

source: **4. Add translations** in `src/locales/en.json`, `es.json`, and `de.json` under the `equations` key:
es: **4. Agregue traducciones** en `src/locales/en.json`, `es.json` y `de.json` bajo la clave `equations`:

source: **5. Test:** Create test data (e.g. in `input/stretched_exp_test.csv`) and run the app (Tkinter or Streamlit) to verify the new equation appears and fits correctly.
es: **5. Prueba:** Cree datos de prueba (por ejemplo, en `input/stretched_exp_test.csv`) y ejecute la aplicación (Tkinter o Streamlit) para verificar que la nueva ecuación aparezca y se ajuste correctamente.

source: Next Steps
es: Próximos pasos

source: **Study existing functions**: Look at the modules under `fitting/functions/` for more examples
es: **Estudiar funciones existentes**: consulte los módulos en `fitting/functions/` para obtener más ejemplos

source: **Test thoroughly**: Create synthetic data with known parameters
es: **Pruebe minuciosamente**: cree datos sintéticos con parámetros conocidos

source: **Document well**: Write clear docstrings and comments
es: **Documente bien**: escriba cadenas de documentación y comentarios claros

source: **Contribute**: Submit your functions as pull requests to help others!
es: **Contribuya**: envíe sus funciones como solicitudes de extracción para ayudar a otros.

source: For more advanced customization, see [Customizing the Fitting Core](customization.md).
es: Para una personalización más avanzada, consulte [Personalizar el núcleo de adaptación] (customization.md).

source: *Have questions? Open an issue on GitHub or check the [API Documentation](api/index).*
es: *¿Tiene preguntas? Abra una incidencia en GitHub o consulte la [Documentación de API](api/index).*
