Repository: DOKOS-TAYOS/RegressionLab
Catalog: sphinx-docs/locale/*/LC_MESSAGES/installation.po
Languages: es

source: Installation Guide
es: Guía de instalación

source: This guide will help you install RegressionLab on your computer. There are multiple installation methods available, from a quick automated setup to manual installation for advanced users.
es: Esta guía te ayudará a instalar RegressionLab en tu ordenador. Hay múltiples métodos de instalación disponibles, desde una instalación automática rápida hasta la instalación manual para usuarios avanzados.

source: Prerequisites
es: Requisitos previos

source: Before installing RegressionLab, ensure you have:
es: Antes de instalar RegressionLab, asegúrate de tener:

source: Required Software
es: Software requerido

source: **Git**: Version control system for cloning the repository.
es: **Git**: Sistema de control de versiones para clonar el repositorio.

source: Windows: Download from [git-scm.com](https://git-scm.com/install/windows).
es: Windows: Descarga desde [git-scm.com](https://git-scm.com/install/windows).

source: macOS: Install via Homebrew `brew install git` or download from [git-scm.com](https://git-scm.com/install/mac).
es: macOS: Instala vía Homebrew `brew install git` o descarga desde [git-scm.com](https://git-scm.com/install/mac).

source: Linux: `sudo apt-get install git` (Debian/Ubuntu), `sudo dnf install git` (Fedora), `sudo zypper install git` (openSUSE), or `sudo pacman -S git` (Arch). The `install.sh` script can also offer to install Git automatically on supported distributions.
es: Linux: `sudo apt-get install git` (Debian/Ubuntu), `sudo dnf install git` (Fedora), `sudo zypper install git` (openSUSE) o `sudo pacman -S git` (Arch). El script `install.sh` también puede ofrecer instalar Git automáticamente en distribuciones compatibles.

source: **Python**: Version 3.12 or higher (3.13 supported).
es: **Python**: Versión 3.12 o superior (3.13 compatible).

source: Download from [python.org](https://www.python.org/downloads/).
es: Descarga desde [python.org](https://www.python.org/downloads/).

source: Verify installation: `python --version` or `python3 --version`. On some systems (e.g. Arch Linux) the command may be `python` only; the setup script detects either.
es: Verifica la instalación: `python --version` o `python3 --version`. En algunos sistemas (p. ej. Arch Linux) el comando puede ser solo `python`; el script de configuración detecta ambos.

source: System Requirements
es: Requisitos del sistema

source: **Operating System**: Windows 10/11, macOS 10.14+, or Linux.
es: **Sistema operativo**: Windows 10/11, macOS 10.14+ o Linux.

source: **RAM**: 4 GB minimum, 8 GB recommended.
es: **RAM**: 4 GB mínimo, 8 GB recomendado.

source: **Disk Space**: 1 GB minimum, 2 GB recommended for application and dependencies.
es: **Espacio en disco**: 1 GB mínimo, 2 GB recomendado para la aplicación y dependencias.

source: **Display**: 1280x720 minimum resolution recommended.
es: **Pantalla**: Resolución mínima 1280x720 recomendada.

source: Installation Methods
es: Métodos de instalación

source: Method 1: Quick Installation (Recommended)
es: Método 1: Instalación rápida (recomendado)

source: This is the fastest and easiest way to install RegressionLab. The installation script will:
es: Esta es la forma más rápida y fácil de instalar RegressionLab. El script de instalación:

source: Clone the repository.
es: Clonará el repositorio.

source: Create a virtual environment.
es: Creará un entorno virtual.

source: Install all dependencies.
es: Instalará todas las dependencias.

source: Create a desktop shortcut.
es: Creará un acceso directo en el escritorio.

source: Download the installation script:
es: Descarga el script de instalación:

source: Right-click on [`install.bat`](https://raw.githubusercontent.com/DOKOS-TAYOS/RegressionLab/main/install.bat) and select "Save link as..." to download from the repository
es: Haz clic derecho en [`install.bat`](https://raw.githubusercontent.com/DOKOS-TAYOS/RegressionLab/main/install.bat) y selecciona "Guardar enlace como..." para descargar desde el repositorio

source: Or visit the GitHub repository and download it directly
es: O visita el repositorio de GitHub y descárgalo directamente

source: Navigate to the folder where you want to install RegressionLab
es: Navega a la carpeta donde quieras instalar RegressionLab

source: Run the installation script:
es: Ejecuta el script de instalación:

source: Double-click `install.bat` ![Windows Installer](../images/en_documentation/tkinter_docs/installer.png)
es: Haz doble clic en `install.bat` ![Instalador de Windows](../images/en_documentation/tkinter_docs/installer.png)

source: Windows Installer
es: Instalador de Windows

source: Or open Command Prompt/PowerShell in the folder and run:
es: O abre Símbolo del sistema/PowerShell en la carpeta y ejecuta:

source: Wait for the installation to complete. The script will:
es: Espera a que termine la instalación. El script:

source: Clone the repository into a `RegressionLab` folder.
es: Clonará el repositorio en una carpeta `RegressionLab`.

source: Set up a Python virtual environment.
es: Configurará un entorno virtual de Python.

source: Install all required dependencies.
es: Instalará todas las dependencias requeridas.

source: Create a desktop shortcut named "RegressionLab".
es: Creará un acceso directo en el escritorio llamado "RegressionLab".

source: ![Installation Process](../images/en_documentation/tkinter_docs/install.png)
es: ![Proceso de instalación](../images/en_documentation/tkinter_docs/install.png)

source: Installation Process
es: Proceso de instalación

source: Launch RegressionLab:
es: Inicie RegressionLab:

source: Double-click the desktop shortcut ![Desktop Shortcut](../images/en_documentation/tkinter_docs/shortcut.png)
es: ¡Haga doble clic en el acceso directo del escritorio![Acceso directo al escritorio](../images/en_documentation/tkinter_docs/shortcut.png)

source: Desktop Shortcut
es: Acceso directo al escritorio

source: Or run `bin\run.bat` from the installation folder
es: O ejecute `bin\run.bat` desde la carpeta de instalación

source: Right-click on [`install.sh`](https://raw.githubusercontent.com/DOKOS-TAYOS/RegressionLab/main/install.sh) and select "Save link as..." to download from the repository
es: Haga clic derecho en [`install.sh`](https://raw.githubusercontent.com/DOKOS-TAYOS/RegressionLab/main/install.sh) y seleccione "Guardar enlace como..." para descargar desde el repositorio.

source: Or use wget/curl:
es: O use wget/curl:

source: Make the script executable:
es: Haga que el script sea ejecutable:

source: **Check Git**: If Git is not installed, on Linux it will offer to install it automatically (apt, dnf, yum, zypper, or pacman depending on your distribution).
es: **Verifique Git**: Si Git no está instalado, en Linux ofrecerá instalarlo automáticamente (apt, dnf, yum, zypper o pacman dependiendo de su distribución).

source: **Clone the repository** into a `regressionlab` folder in the current directory. If this folder already exists, you will be asked whether to remove it and clone again, or to run `setup.sh` in the existing directory.
es: **Clonar el repositorio** en una carpeta `regressionlab` en el directorio actual. Si esta carpeta ya existe, se le preguntará si desea eliminarla y clonarla nuevamente o ejecutar `setup.sh` en el directorio existente.

source: **Run `setup.sh`** inside the cloned repository. The setup script will:
es: **Ejecute `setup.sh`** dentro del repositorio clonado. El script de configuración:

source: Check Python 3.12+; on Linux it can offer to install Python 3.12 automatically if missing.
es: Consulte Python 3.12+; en Linux puede ofrecer instalar Python 3.12 automáticamente si falta.

source: Check Tkinter; on Linux it can install the system package (`python3.12-tk`, `python3-tkinter`, etc.) if needed.
es: Consulte Tkinter; en Linux puede instalar el paquete del sistema (`python3.12-tk`, `python3-tkinter`, etc.) si es necesario.

source: Create a virtual environment in `.venv`.
es: Cree un entorno virtual en `.venv`.

source: Install dependencies from `requirements.txt`.
es: Instale dependencias desde `requirements.txt`.

source: Create `.env` from `.env.example`.
es: Cree `.env` a partir de `.env.example`.

source: Create a desktop shortcut (`RegressionLab.desktop`) on Desktop, Escritorio, or your home directory.
es: Cree un acceso directo en el escritorio (`RegressionLab.desktop`) en Desktop, Escritorio o su directorio de inicio.

source: Double-click the desktop shortcut (if supported)
es: Haga doble clic en el acceso directo del escritorio (si es compatible)

source: Or run `bin/run.sh` from the installation folder:
es: O ejecute `bin/run.sh` desde la carpeta de instalación:

source: Method 2: Installation with Git
es: Método 2: instalación con Git

source: This method gives you more control over where the repository is cloned and allows you to easily update the application.
es: Este método le brinda más control sobre dónde se clona el repositorio y le permite actualizar fácilmente la aplicación.

source: Step 1: Clone the Repository
es: Paso 1: clonar el repositorio

source: Step 2: Choose Your Setup Method
es: Paso 2: elija su método de configuración

source: Option A: Automated Setup (Recommended)
es: Opción A: Configuración automatizada (recomendada)

source: This will:
es: Esto:

source: Check Python 3.12+ (on Linux, optionally install it if missing).
es: Verifique Python 3.12+ (en Linux, instálelo opcionalmente si falta).

source: Check Tkinter (on Linux, optionally install the system package if missing).
es: Marque Tkinter (en Linux, opcionalmente instale el paquete del sistema si falta).

source: Copy `.env.example` to `.env`.
es: Copie `.env.example` a `.env`.

source: Option B: Manual Virtual Environment Setup
es: Opción B: Configuración manual del entorno virtual

source: Option C: Using Poetry (Advanced)
es: Opción C: Usar poesía (avanzado)

source: If you prefer Poetry for dependency management:
es: Si prefieres Poesía para la gestión de la dependencia:

source: Method 3: Manual Installation (Advanced Users)
es: Método 3: instalación manual (usuarios avanzados)

source: For users who want complete control over the installation process:
es: Para usuarios que desean un control total sobre el proceso de instalación:

source: Step 1: Download or Clone the Repository
es: Paso 1: descargar o clonar el repositorio

source: Or download the ZIP file from GitHub and extract it.
es: O descargue el archivo ZIP de GitHub y extráigalo.

source: Step 2: Create Virtual Environment (Optional but Recommended)
es: Paso 2: crear un entorno virtual (opcional pero recomendado)

source: Step 3: Install Dependencies
es: Paso 3: instalar dependencias

source: Choose one of the following methods:
es: Elija uno de los siguientes métodos:

source: **Using requirements.txt:**
es: **Usando requisitos.txt:**

source: **Using pyproject.toml:**
es: **Usando pyproject.toml:**

source: This installs the same runtime dependencies as `requirements.txt` (including Pillow and Streamlit).
es: Esto instala las mismas dependencias de tiempo de ejecución que `requirements.txt` (incluidos Pillow y Streamlit).

source: **For development (testing, linting with Ruff, formatting with Black, type checking with mypy, pre-commit):**
es: **Para desarrollo (pruebas, linting con Ruff, formateo con Black, verificación de tipos con mypy, confirmación previa):**

source: Step 4: Configure Environment
es: Paso 4: configurar el entorno

source: See the [Configuration Guide](configuration.md) for details on available options.
es: Consulte la [Guía de configuración] (configuration.md) para obtener detalles sobre las opciones disponibles.

source: Step 5: Verify Installation
es: Paso 5: verificar la instalación

source: Test that everything is working (from the project root, with virtual environment activated if you use one):
es: Prueba que todo esté funcionando (desde la raíz del proyecto, con el entorno virtual activado si usas uno):

source: Running RegressionLab
es: Ejecutando RegressionLab

source: After installation, you can run RegressionLab in several ways:
es: Después de la instalación, puede ejecutar RegressionLab de varias maneras:

source: Desktop Version (Tkinter)
es: Versión de escritorio (Tkinter)

source: **Method 1: Desktop Shortcut**
es: **Método 1: acceso directo al escritorio**

source: Double-click the "RegressionLab" shortcut on your desktop ![Desktop Shortcut](../images/en_documentation/tkinter_docs/shortcut.png)
es: ¡Haga doble clic en el acceso directo "RegressionLab" en su escritorio![Acceso directo al escritorio](../images/en_documentation/tkinter_docs/shortcut.png)

source: **Method 2: Shell Scripts**
es: **Método 2: scripts de Shell**

source: The `bin/` scripts activate the project virtual environment and run the app. They require that you have run `setup.bat` (Windows) or `setup.sh` (macOS/Linux) first; otherwise they exit with "Virtual environment not found".
es: Los scripts `bin/` activan el entorno virtual del proyecto y ejecutan la aplicación. Requieren que haya ejecutado primero `setup.bat` (Windows) o `setup.sh` (macOS/Linux); de lo contrario, salen con "Entorno virtual no encontrado".

source: Windows:
es: Ventanas:

source: **Method 3: Direct Python Execution**
es: **Método 3: Ejecución directa de Python**

source: Web Version (Streamlit)
es: Versión web (transmitida)

source: **Method 1: Shell Scripts**
es: **Método 1: scripts de Shell**

source: Same as the desktop version: ensure the virtual environment exists (run setup first). Then:
es: Igual que la versión de escritorio: asegúrese de que exista el entorno virtual (ejecute primero la configuración). Entonces:

source: **Method 2: Direct Streamlit Command**
es: **Método 2: Comando Streamlit directo**

source: **Method 3: Online Version**
es: **Método 3: Versión en línea**

source: Access the hosted version at: [https://regressionlab.streamlit.app/](https://regressionlab.streamlit.app/)
es: Acceda a la versión alojada en: [https://regressionlab.streamlit.app/](https://regressionlab.streamlit.app/)

source: Updating RegressionLab
es: Actualizando RegressionLab

source: In-App Update Check (Tkinter, Git Install)
es: Comprobación de actualización en la aplicación (Tkinter, Git Install)

source: If you installed RegressionLab via Git and use the **Tkinter desktop app**, the app checks for updates **once a week** when you open it. If a newer version is available, a dialog asks whether you want to update. If you confirm, the app runs `git pull` to update the code. Your `input/`, `output/` folders and `.env` file are not modified.
es: Si instaló RegressionLab a través de Git y usa la **aplicación de escritorio Tkinter**, la aplicación busca actualizaciones **una vez por semana** cuando la abre. Si hay una versión más reciente disponible, un cuadro de diálogo le preguntará si desea actualizar. Si confirma, la aplicación ejecuta `git pull` para actualizar el código. Sus carpetas `input/`, `output/` y el archivo `.env` no se modifican.

source: You can disable this in **Configure** → **Updates** (`CHECK_UPDATES=false` in `.env`) or force a check every time (`CHECK_UPDATES_FORCE=true`). See the [Configuration Guide](configuration.md#7-update-check-tkinter) for details.
es: Puede desactivar esto en **Configurar** → **Actualizaciones** (`CHECK_UPDATES=false` en `.env`) o forzar una verificación cada vez (`CHECK_UPDATES_FORCE=true`). Consulte la [Guía de configuración] (configuration.md#7-update-check-tkinter) para obtener más detalles.

source: If Installed via Git (Manual Update)
es: Si se instala a través de Git (actualización manual)

source: If Installed via Download
es: Si se instala mediante descarga

source: Download the latest version and repeat the installation process, or switch to the Git method for easier updates.
es: Descargue la última versión y repita el proceso de instalación, o cambie al método Git para obtener actualizaciones más sencillas.

source: Troubleshooting Installation
es: Solución de problemas de instalación

source: Python Not Found
es: Python no encontrado

source: **Error**: `'python' is not recognized as an internal or external command`
es: **Error**: `'python' no se reconoce como un comando interno o externo`

source: **Solution**:
es: **Solución**:

source: Ensure Python is installed and added to PATH.
es: Asegúrese de que Python esté instalado y agregado a PATH.

source: Try using `python3` instead of `python`.
es: Intente usar `python3` en lugar de `python`.

source: Reinstall Python and check "Add Python to PATH" during installation.
es: Reinstale Python y marque "Agregar Python a PATH" durante la instalación.

source: Permission Denied (macOS/Linux)
es: Permiso denegado (macOS/Linux)

source: **Error**: `Permission denied` when running shell scripts
es: **Error**: `Permiso denegado` al ejecutar scripts de shell

source: Module Not Found
es: Módulo no encontrado

source: **Error**: `ModuleNotFoundError: No module named 'numpy'` (or other modules)
es: **Error**: `ModuleNotFoundError: No hay módulo llamado 'numpy'` (u otros módulos)

source: Ensure virtual environment is activated.
es: Asegúrese de que el entorno virtual esté activado.

source: Reinstall dependencies: `pip install -r requirements.txt`.
es: Reinstale las dependencias: `pip install -r requisitos.txt`.

source: Check that you're using the correct Python interpreter.
es: Compruebe que esté utilizando el intérprete de Python correcto.

source: Virtual Environment Issues
es: Problemas del entorno virtual

source: **Error**: Virtual environment activation fails
es: **Error**: falla la activación del entorno virtual

source: **Solution Windows**:
es: **Solución Windows**:

source: Run PowerShell as Administrator
es: Ejecute PowerShell como administrador

source: Execute: `Set-ExecutionPolicy RemoteSigned`
es: Ejecutar: `Set-ExecutionPolicy RemoteSigned`

source: Try activating again
es: Intenta activar de nuevo

source: **Solution macOS/Linux**:
es: **Solución macOS/Linux**:

source: Ensure `.venv/bin/activate` exists
es: Asegúrese de que exista `.venv/bin/activate`

source: Check Python installation: `python3 --version`
es: Verifique la instalación de Python: `python3 --version`

source: Git Clone Fails
es: El clon de Git falla

source: **Error**: `fatal: unable to access 'https://github.com/...'`
es: **Error**: `fatal: no se puede acceder a 'https://github.com/...'`

source: Check internet connection.
es: Verifique la conexión a Internet.

source: Verify Git is installed: `git --version`.
es: Verifique que Git esté instalado: `git --version`.

source: Try using HTTPS instead of SSH or vice versa.
es: Intente utilizar HTTPS en lugar de SSH o viceversa.

source: Uninstalling RegressionLab
es: Desinstalación de RegressionLab

source: To remove RegressionLab from your system:
es: Para eliminar RegressionLab de su sistema:

source: Delete the RegressionLab folder.
es: Elimine la carpeta RegressionLab.

source: Delete the desktop shortcut (if created).
es: Elimine el acceso directo del escritorio (si se creó).

source: Remove the virtual environment (if created separately).
es: Elimine el entorno virtual (si se crea por separado).

source: Next Steps
es: Próximos pasos

source: Now that RegressionLab is installed:
es: Ahora que RegressionLab está instalado:

source: **Configure**: Customize your settings in the [Configuration Guide](configuration.md).
es: **Configurar**: personalice sus ajustes en la [Guía de configuración] (configuration.md).

source: **Learn**: Read the [User Guide](usage.md) to understand how to use RegressionLab.
es: **Aprenda**: lea la [Guía del usuario](usage.md) para comprender cómo utilizar RegressionLab.

source: **Explore**: Try the different operation modes with sample datasets in the `input/` folder.
es: **Explorar**: Pruebe los diferentes modos de operación con conjuntos de datos de muestra en la carpeta `input/`.

source: *Having issues? Check the [Troubleshooting Guide](troubleshooting.md) or open an issue on GitHub.*
es: *¿Tienes problemas? Consulte la [Guía de solución de problemas] (troubleshooting.md) o abra un problema en GitHub.*
