Repository: DOKOS-TAYOS/RegressionLab
Catalog: sphinx-docs/locale/*/LC_MESSAGES/introduction.po
Languages: es

source: Introduction to RegressionLab
es: Introducción a RegressionLab

source: 🎯 What is RegressionLab?
es: 🎯 ¿Qué es RegressionLab?

source: **RegressionLab** is a comprehensive curve fitting application designed to help you analyze experimental data and find the mathematical relationships within your datasets. Whether you're a student learning about data analysis, a researcher processing experimental results, or an engineer validating models, RegressionLab provides the tools you need.
es: **RegressionLab** es una aplicación completa de ajuste de curvas diseñada para ayudarte a analizar datos experimentales y encontrar las relaciones matemáticas en tus conjuntos de datos. Ya seas estudiante aprendiendo análisis de datos, investigador procesando resultados experimentales o ingeniero validando modelos, RegressionLab te proporciona las herramientas necesarias.

source: ![RegressionLab Main Interface](../images/en_documentation/tkinter_docs/main.png)
es: ![Interfaz principal de RegressionLab](../images/es_documentation/tkinter_docs/main.png)

source: RegressionLab Main Interface
es: Interfaz principal de RegressionLab

source: For Everyone
es: Para todos

source: At its core, RegressionLab helps you answer a simple question: **"What mathematical equation best describes my data?"**
es: En esencia, RegressionLab te ayuda a responder una pregunta simple: **"¿Qué ecuación matemática describe mejor mis datos?"**

source: Imagine you've collected measurements from an experiment - maybe you're measuring how the temperature of water changes over time, or how the speed of a car varies with the force applied. RegressionLab takes your data points and tries different mathematical formulas to find the one that best fits your observations. It then shows you:
es: Imagina que has recogido mediciones de un experimento: quizá mides cómo cambia la temperatura del agua con el tiempo, o cómo varía la velocidad de un coche con la fuerza aplicada. RegressionLab toma tus puntos de datos y prueba diferentes fórmulas matemáticas para encontrar la que mejor se ajusta a tus observaciones. Luego te muestra:

source: The equation that describes your data.
es: La ecuación que describe tus datos.

source: A graph comparing your actual measurements with the predicted values.
es: Un gráfico que compara tus mediciones reales con los valores predichos.

source: How accurate the fit is (using statistical measures).
es: Qué tan preciso es el ajuste (usando medidas estadísticas).

source: You don't need to be a programmer or mathematician to use RegressionLab - the interface is designed to be intuitive and user-friendly.
es: No necesitas ser programador ni matemático para usar RegressionLab: la interfaz está diseñada para ser intuitiva y fácil de usar.

source: For Technical Users
es: Para usuarios técnicos

source: RegressionLab is a Python-based scientific application that implements curve fitting using non-linear least squares optimization (via SciPy's `curve_fit`). It provides:
es: RegressionLab es una aplicación científica basada en Python que implementa el ajuste de curvas mediante optimización por mínimos cuadrados no lineales (vía `curve_fit` de SciPy). Proporciona:

source: **Multiple fitting functions**: Linear, polynomial, trigonometric (including tangent), logarithmic, exponential, inverse, hyperbolic, Gaussian, sigmoid, and custom formulas.
es: **Múltiples funciones de ajuste**: lineales, polinomiales, trigonométricas (incluyendo tangente), logarítmicas, exponenciales, inversas, hiperbólicas, gaussianas, sigmoides y fórmulas personalizadas.

source: **Multidimensional regression**: Custom formulas can use 2 or more independent variables. With 2 independent variables, an interactive 3D plot is shown; with more than 2, a residuals plot is displayed.
es: **Regresión multidimensional**: Las fórmulas personalizadas pueden usar 2 o más variables independientes. Con 2 variables se muestra un gráfico 3D interactivo; con más de 2, un gráfico de residuos.

source: **Prediction window**: In the desktop version, a "Prediction" button in the result window lets you evaluate the fitted function at user-specified inputs, with uncertainty propagation when parameter covariance is available.
es: **Ventana de predicción**: En la versión de escritorio, un botón "Predicción" en la ventana de resultados te permite evaluar la función ajustada en entradas especificadas por el usuario, con propagación de incertidumbre cuando la covarianza de parámetros está disponible.

source: **Statistical analysis**: Automatic calculation of R², RMSE, chi-squared, reduced chi-squared, degrees of freedom, parameter uncertainties (from the fit covariance), and 95% confidence intervals for parameters.
es: **Análisis estadístico**: Cálculo automático de R², RMSE, chi-cuadrado, chi-cuadrado reducido, grados de libertad, incertidumbres de parámetros (desde la covarianza del ajuste) e intervalos de confianza del 95% para los parámetros.

source: **Flexible data formats**: Support for CSV, TXT (whitespace or tab-separated), and Excel (.xlsx) files with automatic uncertainty column detection.
es: **Formatos de datos flexibles**: Soporte para archivos CSV, TXT (separados por espacios o tabulaciones) y Excel (.xlsx) con detección automática de columnas de incertidumbre.

source: **Batch processing**: Fit multiple datasets or equations simultaneously.
es: **Procesamiento por lotes**: Ajusta múltiples conjuntos de datos o ecuaciones simultáneamente.

source: **Extensible architecture**: Easy to add new fitting functions or replace the optimization backend.
es: **Arquitectura extensible**: Fácil añadir nuevas funciones de ajuste o reemplazar el backend de optimización.

source: 🌟 Key Benefits
es: 🌟 Beneficios principales

source: 1. **Dual Interface**
es: 1. **Doble interfaz**

source: Choose the interface that works best for you:
es: Elige la interfaz que mejor te funcione:

source: **Web version** (Streamlit): Access from any browser, no installation required.
es: **Versión web** (Streamlit): Acceso desde cualquier navegador, sin instalación.

source: **Desktop version** (Tkinter): Full-featured native application with advanced options.
es: **Versión de escritorio** (Tkinter): Aplicación nativa completa con opciones avanzadas.

source: **Tkinter (desktop)**: Main menu with mode buttons (Normal Fitting, Multiple Datasets, Checker Fitting, Total Fitting, Watch Data), **Information** (help with collapsible sections), **Configure** (edit .env options in a dialog; saving restarts the app), and Exit.
es: **Tkinter (escritorio)**: Menú principal con botones de modo (Ajuste normal, Múltiples conjuntos, Ajuste verificador, Ajuste total, Ver datos), **Información** (ayuda con secciones colapsables), **Configurar** (editar opciones .env en un diálogo; guardar reinicia la app) y Salir.

source: **Streamlit (web)**: Sidebar for language and mode; main area for upload, variables, equation, and results. Configuration is done via the `.env` file (no in-app config dialog).
es: **Streamlit (web)**: Barra lateral para idioma y modo; área principal para subida, variables, ecuación y resultados. La configuración se hace mediante el archivo `.env` (sin diálogo de configuración en la app).

source: 3. **Multiple Operation Modes**
es: 3. **Múltiples modos de operación**

source: RegressionLab offers five operation modes so you can match the workflow to your task:
es: RegressionLab ofrece cinco modos de operación para adaptar el flujo de trabajo a tu tarea:

source: **Normal fitting**: Fits one equation to one dataset. Ideal when you already know the model and want a single, precise fit. Optionally use **loop mode** (Tkinter) or **loop fitting** (Streamlit: fit another file with the same equation without changing mode) for iterative refits.
es: **Ajuste normal**: Ajusta una ecuación a un conjunto de datos. Ideal cuando ya conoces el modelo y quieres un único ajuste preciso. Opcionalmente usa **modo bucle** (Tkinter) o **ajuste en bucle** (Streamlit: ajustar otro archivo con la misma ecuación sin cambiar de modo) para reajustes iterativos.

source: **Fit multiple datasets**: Applies the *same* equation to several datasets at once. Use it when you want to test the same hypothesis on different data series (e.g., the same experiment on different days) and compare results systematically.
es: **Ajustar múltiples conjuntos**: Aplica la *misma* ecuación a varios conjuntos de datos a la vez. Úsalo cuando quieras probar la misma hipótesis en diferentes series de datos (p. ej. el mismo experimento en distintos días) y comparar resultados sistemáticamente.

source: **Fit multiple functions**: Tests *different* equations on the *same* dataset. Lets you explore which model (e.g., linear vs. quadratic vs. exponential) best describes your data.
es: **Ajustar múltiples funciones**: Prueba *diferentes* ecuaciones sobre el *mismo* conjunto de datos. Te permite explorar qué modelo (p. ej. lineal vs. cuadrático vs. exponencial) describe mejor tus datos.

source: **Fit all functions**: Applies every available equation to one dataset. Use it for hypothesis exploration when you want to see which built-in or custom function fits best in one go.
es: **Ajustar todas las funciones**: Aplica cada ecuación disponible a un conjunto de datos. Úsalo para explorar hipótesis cuando quieras ver qué función integrada o personalizada se ajusta mejor de una vez.

source: **View data**: Inspect data from a file (table and pair plots) without performing any fitting. Transform (FFT, DCT, Hilbert, Laplace, log, etc.), clean (drop NaN, outliers, etc.), and save (or download) the processed data.
es: **Ver datos**: Inspecciona datos de un archivo (tabla y gráficos de pares) sin realizar ajustes. Transforma (FFT, DCT, Hilbert, Laplace, log, etc.), limpia (eliminar NaN, valores atípicos, etc.) y guarda (o descarga) los datos procesados.

source: 4. **Wide Range of Fitting Functions**
es: 4. **Amplia gama de funciones de ajuste**

source: Built-in support for:
es: Soporte integrado para:

source: Linear functions (with and without intercept).
es: Funciones lineales (con y sin ordenada al origen).

source: Polynomial functions (quadratic, quartic, complete polynomials).
es: Funciones polinomiales (cuadráticas, cuárticas, polinomios completos).

source: Trigonometric functions (sine, cosine, tangent, with phase shifts).
es: Funciones trigonométricas (seno, coseno, tangente, con desfases).

source: Hyperbolic functions (sinh, cosh).
es: Funciones hiperbólicas (sinh, cosh).

source: Logarithmic and exponential functions.
es: Funciones logarítmicas y exponenciales.

source: Inverse functions (1/x, 1/x²).
es: Funciones inversas (1/x, 1/x²).

source: Additional models: Gaussian, sigmoid (logistic), square pulse, Hermite polynomials.
es: Modelos adicionales: gaussiana, sigmoide (logística), pulso cuadrado, polinomios de Hermite.

source: 5. **Professional Visualization**
es: 5. **Visualización profesional**

source: High-quality publication-ready plots.
es: Gráficos de alta calidad listos para publicación.

source: Error bars for measurement uncertainties.
es: Barras de error para incertidumbres de medición.

source: Customizable plot styles and themes.
es: Estilos y temas de gráficos personalizables.

source: Automatic equation and parameter display.
es: Visualización automática de ecuación y parámetros.

source: Export plots as PNG, JPG, or PDF (configurable). ![2D Fit Result](../images/en_documentation/tkinter_docs/result.png)
es: Exporta gráficos como PNG, JPG o PDF (configurable). ![Resultado de ajuste 2D](../images/es_documentation/tkinter_docs/result.png)

source: 6. **Uncertainty Handling**
es: 6. **Manejo de incertidumbres**

source: Automatic detection and visualization of measurement uncertainties:
es: Detección y visualización automáticas de incertidumbres de medición:

source: Supports uncertainty columns with `u` prefix (e.g., `ux`, `uy`).
es: Soporta columnas de incertidumbre con prefijo `u` (p. ej. `ux`, `uy`).

source: Weighted fitting based on uncertainties.
es: Ajuste ponderado basado en incertidumbres.

source: Error bar visualization.
es: Visualización de barras de error.

source: 7. **Multidimensional Regression and Predictions**
es: 7. **Regresión multidimensional y predicciones**

source: **Multidimensional fitting**: Use custom formulas with 2 or more independent variables. With 2 variables you get an interactive 3D surface plot; with 3+ you get a residuals plot.
es: **Ajuste multidimensional**: Usa fórmulas personalizadas con 2 o más variables independientes. Con 2 variables obtienes un gráfico de superficie 3D interactivo; con 3 o más, un gráfico de residuos.

source: 8. **Batch Processing**
es: 8. **Procesamiento por lotes**

source: Save time by:
es: Ahorra tiempo:

source: Fitting multiple datasets with one click (same equation, many files).
es: Ajustando múltiples conjuntos con un clic (misma ecuación, muchos archivos).

source: Testing all available equations on one dataset automatically (fit all functions).
es: Probando todas las ecuaciones disponibles en un conjunto de datos automáticamente (ajustar todas las funciones).

source: Loop mode for iterative data refinement (add data, refit, repeat without reconfiguring).
es: Modo bucle para refinamiento iterativo de datos (añadir datos, reajustar, repetir sin reconfigurar).

source: 9. **Internationalization**
es: 9. **Internacionalización**

source: Full support for multiple languages:
es: Soporte completo para múltiples idiomas:

source: Spanish (es) – default.
es: Español (es) – por defecto.

source: English (en).
es: Inglés (en).

source: German (de).
es: Alemán (de).

source: Easy to add more languages via JSON files in `src/locales/`.
es: Fácil añadir más idiomas mediante archivos JSON en `src/locales/`.

source: 10. **Highly Configurable**
es: 10. **Altamente configurable**

source: Customize through the **Configure** dialog (Tkinter) or the `.env` file:
es: Personaliza mediante el diálogo **Configurar** (Tkinter) o el archivo `.env`:

source: **Language**: Spanish, English, German.
es: **Idioma**: Español, inglés, alemán.

source: **UI (Tkinter)**: Colors, fonts, padding, button sizes, data-preview text style.
es: **Interfaz (Tkinter)**: Colores, fuentes, espaciado, tamaños de botones, estilo del texto de vista previa de datos.

source: **Plots**: Size, DPI, line/marker style, colors, title on/off.
es: **Gráficos**: Tamaño, DPI, estilo de línea/marcador, colores, título activado/desactivado.

source: **Fonts in plots**: Family, title/axis/tick size and style.
es: **Fuentes en gráficos**: Familia, tamaño y estilo de título/ejes/etiquetas.

source: **Paths**: Input/output directories, filename template, plot format (PNG/JPG/PDF).
es: **Rutas**: Directorios de entrada/salida, plantilla de nombre de archivo, formato de gráficos (PNG/JPG/PDF).

source: **Links**: Donations URL (optional).
es: **Enlaces**: URL de donaciones (opcional).

source: **Logging**: Level, file path, console output. ![Configuration Dialog](../images/en_documentation/tkinter_docs/config.png)
es: **Registro**: Nivel, ruta del archivo, salida en consola. ![Diálogo de configuración](../images/es_documentation/tkinter_docs/config.png)

source: 11. **Extensible and Open Source**
es: 11. **Extensible y código abierto**

source: MIT License - free for academic and commercial use.
es: Licencia MIT: libre para uso académico y comercial.

source: Well-documented codebase.
es: Base de código bien documentada.

source: Easy to add new fitting functions.
es: Fácil añadir nuevas funciones de ajuste.

source: Modular architecture for customization.
es: Arquitectura modular para personalización.

source: 12. **Cross-Platform**
es: 12. **Multiplataforma**

source: Works on:
es: Funciona en:

source: 🌐 Getting RegressionLab
es: 🌐 Obtener RegressionLab

source: Option 1: Web Version (Easiest)
es: Opción 1: Versión web (la más fácil)

source: Access RegressionLab instantly through your web browser:
es: Accede a RegressionLab al instante desde tu navegador:

source: No installation required! Just:
es: ¡Sin instalación! Solo:

source: Open the link.
es: Abre el enlace.

source: Upload your data file.
es: Sube tu archivo de datos.

source: Select your fitting options.
es: Selecciona tus opciones de ajuste.

source: Download the results.
es: Descarga los resultados.

source: **Note**: If the app is sleeping, click "Start" and wait a moment for it to wake up.
es: **Nota**: Si la app está en reposo, haz clic en "Iniciar" y espera un momento a que se active.

source: Option 2: Desktop Version (Most Features)
es: Opción 2: Versión de escritorio (más funciones)

source: Install RegressionLab on your computer for:
es: Instala RegressionLab en tu ordenador para:

source: Faster performance.
es: Mayor rendimiento.

source: Offline use.
es: Uso sin conexión.

source: Advanced customization options.
es: Opciones de personalización avanzadas.

source: Access to all features.
es: Acceso a todas las funciones.

source: See the [Installation Guide](installation.md) for detailed instructions.
es: Consulta la [Guía de instalación](installation.md) para instrucciones detalladas.

source: 📊 Use Cases
es: 📊 Casos de uso

source: Academic Research
es: Investigación académica

source: Analyzing experimental data from physics, chemistry, or biology labs.
es: Análisis de datos experimentales de laboratorios de física, química o biología.

source: Validating theoretical models with empirical data.
es: Validación de modelos teóricos con datos empíricos.

source: Teaching data analysis and curve fitting concepts.
es: Enseñanza de conceptos de análisis de datos y ajuste de curvas.

source: Engineering
es: Ingeniería

source: Calibration curve generation.
es: Generación de curvas de calibración.

source: System identification and modeling.
es: Identificación de sistemas y modelado.

source: Quality control and process optimization.
es: Control de calidad y optimización de procesos.

source: Data Science
es: Ciencia de datos

source: Exploratory data analysis.
es: Análisis exploratorio de datos.

source: Feature engineering.
es: Ingeniería de características.

source: Model validation.
es: Validación de modelos.

source: Education
es: Educación

source: Learning about different mathematical functions.
es: Aprender sobre diferentes funciones matemáticas.

source: Understanding least squares fitting.
es: Comprender el ajuste por mínimos cuadrados.

source: Visualizing how equations relate to data.
es: Visualizar cómo las ecuaciones se relacionan con los datos.

source: 🎓 What You'll Learn
es: 🎓 Qué aprenderás

source: By using RegressionLab, you'll gain experience with:
es: Usando RegressionLab, ganarás experiencia en:

source: **Curve fitting techniques**: Understanding how to match mathematical models to data.
es: **Técnicas de ajuste de curvas**: Entender cómo ajustar modelos matemáticos a los datos.

source: **Statistical analysis**: Interpreting R², RMSE, chi-squared, and parameter uncertainties.
es: **Análisis estadístico**: Interpretar R², RMSE, chi-cuadrado e incertidumbres de parámetros.

source: **Data visualization**: Creating publication-quality plots.
es: **Visualización de datos**: Crear gráficos de calidad para publicación.

source: **Scientific computing**: Working with numerical analysis tools.
es: **Computación científica**: Trabajar con herramientas de análisis numérico.

source: **Best practices**: Proper data formatting and uncertainty handling.
es: **Buenas prácticas**: Formato correcto de datos y manejo de incertidumbres.

source: 🚀 Next Steps
es: 🚀 Próximos pasos

source: Ready to get started?
es: ¿Listo para empezar?

source: **Install RegressionLab**: Follow the [Installation Guide](installation.md).
es: **Instala RegressionLab**: Sigue la [Guía de instalación](installation.md).

source: **Learn the basics**: Read the [User Guide](usage.md).
es: **Aprende lo básico**: Lee la [Guía de usuario](usage.md).

source: **Customize**: Configure your preferences in the [Configuration Guide](configuration.md).
es: **Personaliza**: Configura tus preferencias en la [Guía de configuración](configuration.md).

source: **Explore**: Try different fitting modes with your data.
es: **Explora**: Prueba diferentes modos de ajuste con tus datos.

source: Or jump straight to the web version and start fitting curves immediately!
es: ¡O ve directo a la versión web y empieza a ajustar curvas de inmediato!

source: *RegressionLab: Making curve fitting accessible to everyone.*
es: *RegressionLab: Haciendo el ajuste de curvas accesible para todos.*
