Repository: DOKOS-TAYOS/RegressionLab
Catalog: sphinx-docs/locale/*/LC_MESSAGES/license.po
Languages: es

source: License
es: Licencia

source: MIT License
es: Licencia MIT

source: Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:
es: Por el presente se otorga permiso, sin cargo, a cualquier persona que obtenga una copia de este software y los archivos de documentación asociados (el "Software"), para operar con el Software sin restricciones, incluidos, entre otros, los derechos de uso, copia, modificación, fusión, publicación, distribución, sublicencia y/o venta de copias del Software, y para permitir que las personas a quienes se proporciona el Software lo hagan, sujeto a las siguientes condiciones:

source: The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.
es: El aviso de derechos de autor anterior y este aviso de permiso se incluirán en todas las copias o partes sustanciales del Software.

source: THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
es: EL SOFTWARE SE PROPORCIONA "TAL CUAL", SIN GARANTÍA DE NINGÚN TIPO, EXPRESA O IMPLÍCITA, INCLUYENDO PERO NO LIMITADO A LAS GARANTÍAS DE COMERCIABILIDAD, IDONEIDAD PARA UN PROPÓSITO PARTICULAR Y NO INFRACCIÓN. EN NINGÚN CASO LOS AUTORES O TITULARES DE DERECHOS DE AUTOR SERÁN RESPONSABLES DE NINGÚN RECLAMO, DAÑO U OTRA RESPONSABILIDAD, YA SEA EN UNA ACCIÓN CONTRACTUAL, AGRAVIO O DE OTRA MANERA, QUE SURJA DE, FUERA DE O EN RELACIÓN CON EL SOFTWARE O EL USO U OTRAS NEGOCIOS EN EL SOFTWARE.

source: What This Means
es: Qué significa esto

source: The MIT License is one of the most permissive open-source licenses. Here's what it means in plain language:
es: La licencia MIT es una de las licencias de código abierto más permisivas. Esto es lo que significa en lenguaje sencillo:

source: ✅ You CAN:
es: ✅ Tú PUEDES:

source: **Use** the software for any purpose (commercial or non-commercial)
es: **Usar** el software para cualquier propósito (comercial o no comercial)

source: **Copy** the software and distribute it
es: **Copia** el software y distribúyelo

source: **Modify** the software and create derivative works
es: **Modificar** el software y crear trabajos derivados.

source: **Merge** the software with other projects
es: **Fusionar** el software con otros proyectos

source: **Publish** the software or modified versions
es: **Publicar** el software o las versiones modificadas

source: **Sublicense** the software
es: **Sublicenciar** el software

source: **Sell** the software or products that include it
es: **Vender** el software o productos que lo incluyen

source: ⚠️ You MUST:
es: ⚠️ DEBES:

source: **Include the license notice**: Include the MIT License text and copyright notice in all copies or substantial portions of the software
es: **Incluir el aviso de licencia**: incluya el texto de la licencia MIT y el aviso de derechos de autor en todas las copias o partes sustanciales del software.

source: **Include the copyright notice**: Credit the original author (Alejandro Mata Ali)
es: **Incluir el aviso de copyright**: Dar crédito al autor original (Alejandro Mata Ali)

source: ❌ You CANNOT:
es: ❌ NO PUEDES:

source: **Hold the author liable**: The software is provided "as is" without warranty
es: **Hacer responsable al autor**: el software se proporciona "tal cual" sin garantía

source: **Remove the copyright notice**: The original copyright must remain
es: **Eliminar el aviso de derechos de autor**: los derechos de autor originales deben permanecer

source: **Use the author's name for endorsement**: Without explicit permission
es: **Use el nombre del autor para respaldo**: Sin permiso explícito

source: Dependencies
es: Dependencias

source: RegressionLab uses several open-source libraries, each with their own licenses:
es: RegressionLab utiliza varias bibliotecas de código abierto, cada una con sus propias licencias:

source: Core Dependencies
es: Dependencias principales

source: Package
es: Paquete

source: Use
es: Usar

source: **NumPy**
es: **Número**

source: BSD-3-Clause
es: Cláusula BSD-3

source: Numerical computing
es: Computación numérica

source: PSF-based
es: basado en PSF

source: Plotting and visualization
es: Trazado y visualización

source: **SciPy**
es: **Ciencia**

source: Scientific computing and optimization
es: Computación científica y optimización.

source: Data manipulation
es: Manipulación de datos

source: Excel file support
es: Soporte de archivos Excel

source: **Pillow**
es: **Almohada**

source: Image processing
es: Procesamiento de imágenes

source: Environment variable management
es: Gestión de variables de entorno.

source: Colored terminal output
es: Salida de terminal de color

source: YAML config (equations, etc.)
es: Configuración YAML (ecuaciones, etc.)

source: **Streamlit**
es: **Iluminado**

source: Web application framework
es: Marco de aplicación web

source: All of these licenses are permissive and compatible with the MIT License.
es: Todas estas licencias son permisivas y compatibles con la licencia MIT.

source: For version ranges, full license texts of selected dependencies (including PyYAML), and compliance notes, see **[THIRD_PARTY_LICENSES.md](../THIRD_PARTY_LICENSES.md)** in the project root.
es: Para conocer los rangos de versiones, los textos de licencia completos de las dependencias seleccionadas (incluido PyYAML) y las notas de cumplimiento, consulte **[THIRD_PARTY_LICENSES.md](../THIRD_PARTY_LICENSES.md)** en la raíz del proyecto.

source: License Compatibility
es: Compatibilidad de licencia

source: The MIT License is compatible with:
es: La Licencia MIT es compatible con:

source: BSD licenses
es: licencias BSD

source: Apache License 2.0
es: Licencia Apache 2.0

source: GPL (can be relicensed as GPL)
es: GPL (se puede volver a licenciar como GPL)

source: Commercial software
es: software comercial

source: Using RegressionLab in Your Project
es: Usando RegressionLab en su proyecto

source: Academic Use
es: Uso Académico

source: If you use RegressionLab in academic research, please cite:
es: Si utiliza RegressionLab en investigaciones académicas, cite:

source: BibTeX entry:
es: Entrada BibTeX:

source: Commercial Use
es: Uso comercial

source: RegressionLab can be used in commercial projects without restrictions. However:
es: RegressionLab se puede utilizar en proyectos comerciales sin restricciones. Sin embargo:

source: **Include the license**: The MIT License and copyright notice must be included
es: **Incluir la licencia**: Se debe incluir la licencia MIT y el aviso de derechos de autor.

source: **No warranty**: The software is provided "as is" without warranty
es: **Sin garantía**: el software se proporciona "tal cual" sin garantía

source: **Attribution**: Credit the original project (appreciated but not required)
es: **Atribución**: acredita el proyecto original (se agradece pero no es obligatorio)

source: Derivative Works
es: Obras derivadas

source: If you create a modified version of RegressionLab:
es: Si crea una versión modificada de RegressionLab:

source: **You can** distribute it under any license (including proprietary)
es: **Puedes** distribuirlo bajo cualquier licencia (incluida la propietaria)

source: **You must** include the original MIT License for RegressionLab code
es: **Debe** incluir la licencia MIT original para el código de RegressionLab

source: **You should** clearly indicate what changes were made
es: **Debes** indicar claramente qué cambios se realizaron

source: **Consider** contributing improvements back to the original project
es: **Considere** contribuir con mejoras al proyecto original.

source: Example attribution:
es: Atribución de ejemplo:

source: Warranty Disclaimer
es: Descargo de responsabilidad de garantía

source: THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED.
es: EL SOFTWARE SE PROPORCIONA "TAL CUAL", SIN GARANTÍA DE NINGÚN TIPO, EXPRESA O IMPLÍCITA.

source: This means:
es: Esto significa:

source: **No guarantee of fitness**: The software may not be suitable for your specific purpose
es: **Sin garantía de idoneidad**: Es posible que el software no sea adecuado para su propósito específico

source: **No guarantee of accuracy**: Results should be independently verified for critical applications
es: **No hay garantía de precisión**: Los resultados deben verificarse de forma independiente para aplicaciones críticas

source: **No guarantee of maintenance**: Updates and bug fixes are provided on a best-effort basis
es: **No hay garantía de mantenimiento**: las actualizaciones y correcciones de errores se proporcionan según el mejor esfuerzo posible.

source: **No liability**: The authors are not responsible for any damages arising from the use of the software
es: **Sin responsabilidad**: Los autores no son responsables de ningún daño que surja del uso del software.

source: Important for Scientific Use
es: Importante para uso científico

source: While RegressionLab has been carefully developed and tested, users are responsible for:
es: Si bien RegressionLab ha sido desarrollado y probado cuidadosamente, los usuarios son responsables de:

source: **Validating results**: Always check that results make physical sense
es: **Validación de resultados**: compruebe siempre que los resultados tengan sentido físico

source: **Verifying accuracy**: Compare with known solutions when possible
es: **Verificación de la precisión**: compare con soluciones conocidas cuando sea posible

source: **Understanding limitations**: Be aware of numerical precision and algorithm limitations
es: **Comprensión de las limitaciones**: tenga en cuenta la precisión numérica y las limitaciones de los algoritmos

source: **Citing properly**: In scientific publications, cite the tool and methods used
es: **Citar correctamente**: En publicaciones científicas, citar la herramienta y los métodos utilizados.

source: Copyright
es: Derechos de autor

source: Original Work
es: Trabajo Original

source: The following materials are original works created by Alejandro Mata Ali for RegressionLab:
es: Los siguientes materiales son trabajos originales creados por Alejandro Mata Ali para RegressionLab:

source: **Source Code**: All software code written specifically for RegressionLab.
es: **Código fuente**: todo el código de software escrito específicamente para RegressionLab.

source: **Documentation**: All user guides, API references, and example content.
es: **Documentación**: todas las guías de usuario, referencias de API y contenido de ejemplo.

source: **Design**: UI/UX layouts, application structure, and architectural diagrams.
es: **Diseño**: diseños UI/UX, estructura de aplicaciones y diagramas arquitectónicos.

source: **Images and Icons**: All images and icons included with RegressionLab are original creations.
es: **Imágenes e íconos**: Todas las imágenes e íconos incluidos con RegressionLab son creaciones originales.

source: **Sample Data**: All provided sample datasets are original and created for use with RegressionLab.
es: **Datos de muestra**: todos los conjuntos de datos de muestra proporcionados son originales y están creados para su uso con RegressionLab.

source: Third-Party Components
es: Componentes de terceros

source: RegressionLab uses certain third-party resources, including:
es: RegressionLab utiliza ciertos recursos de terceros, que incluyen:

source: **Mathematical Algorithms**: Implemented based on standard, widely accepted numerical methods.
es: **Algoritmos matemáticos**: Implementado en base a métodos numéricos estándar y ampliamente aceptados.

source: Contributing
es: Contribuyendo

source: By contributing to RegressionLab, you agree that:
es: Al contribuir a RegressionLab, aceptas que:

source: **You own** or have the rights to the contributed code
es: **Eres propietario** o tienes los derechos sobre el código aportado.

source: **You grant** the project a perpetual, worldwide, non-exclusive license to use your contribution
es: **Otorgas** al proyecto una licencia perpetua, mundial y no exclusiva para utilizar tu contribución.

source: **Your contribution** will be licensed under the MIT License
es: **Su contribución** tendrá la licencia MIT.

source: **You understand** your contribution may be used commercially
es: **Entiendes** que tu contribución puede usarse comercialmente

source: See [Contributing Guide](contributing.md) for details.
es: Consulte la [Guía de contribución] (contributing.md) para obtener más detalles.

source: Trademark
es: Marca

source: "RegressionLab" is not a registered trademark. You may:
es: "RegressionLab" no es una marca registrada. Puedes:

source: Use the name "RegressionLab" to refer to this software
es: Utilice el nombre "RegressionLab" para referirse a este software.

source: State that your project "uses RegressionLab"
es: Indique que su proyecto "usa RegressionLab"

source: State that your project is "based on RegressionLab"
es: Indique que su proyecto está "basado en RegressionLab"

source: You may not:
es: No puedes:

source: Imply official endorsement without permission
es: Implica respaldo oficial sin permiso.

source: Use the name in a way that causes confusion with the original project
es: Usar el nombre de una manera que cause confusión con el proyecto original.

source: Register "RegressionLab" or similar names as trademarks
es: Registre "RegressionLab" o nombres similares como marcas comerciales

source: Contact
es: Contacto

source: For licensing questions or commercial inquiries:
es: Para preguntas sobre licencias o consultas comerciales:

source: **Email**: alejandro.mata.ali@gmail.com **GitHub**: [Project Repository](https://github.com/)
es: **Correo electrónico**: alejandro.mata.ali@gmail.com **GitHub**: [Repositorio de proyectos](https://github.com/)

source: Full License Text
es: Texto de licencia completo

source: The complete MIT License text is also available in the `LICENSE` file in the root directory of the repository.
es: El texto completo de la licencia MIT también está disponible en el archivo `LICENCIA` en el directorio raíz del repositorio.

source: Version History
es: Historial de versiones

source: **v0.9.1** (February 2026): Current license (MIT)
es: **v0.9.1** (febrero de 2026): licencia actual (MIT)

source: License has remained MIT since project inception
es: La licencia sigue siendo MIT desde el inicio del proyecto.

source: Frequently Asked Questions
es: Preguntas frecuentes

source: Can I use RegressionLab in my company?
es: ¿Puedo utilizar RegressionLab en mi empresa?

source: **Yes**, the MIT License allows commercial use without restrictions or fees.
es: **Sí**, la Licencia MIT permite el uso comercial sin restricciones ni tarifas.

source: Do I need to make my code open source if I use RegressionLab?
es: ¿Necesito hacer que mi código sea de código abierto si uso RegressionLab?

source: **No**, the MIT License does not require you to open-source your code. You can use RegressionLab in proprietary software.
es: **No**, la licencia MIT no requiere que abra su código. Puede utilizar RegressionLab en software propietario.

source: Can I sell a product that includes RegressionLab?
es: ¿Puedo vender un producto que incluya RegressionLab?

source: **Yes**, you can sell products that include or are based on RegressionLab. You must include the MIT License and copyright notice.
es: **Sí**, puedes vender productos que incluyan o estén basados ​​en RegressionLab. Debe incluir la licencia MIT y el aviso de derechos de autor.

source: Do I need to credit RegressionLab?
es: ¿Necesito acreditar a RegressionLab?

source: **You must** include the license and copyright notice in your distribution. Attribution beyond that is appreciated but not required.
es: **Debes** incluir la licencia y el aviso de derechos de autor en tu distribución. La atribución más allá de eso se agradece pero no es obligatoria.

source: Can I modify RegressionLab and keep my changes private?
es: ¿Puedo modificar RegressionLab y mantener mis cambios privados?

source: **Yes**, you can modify the code and keep your changes private. There's no requirement to share modifications.
es: **Sí**, puedes modificar el código y mantener tus cambios en privado. No es necesario compartir modificaciones.

source: What if I find a bug or security issue?
es: ¿Qué pasa si encuentro un error o un problema de seguridad?

source: Please report it on GitHub or via email. While the license disclaims warranty, we take bugs and security seriously and will address issues as quickly as possible.
es: Infórmalo en GitHub o por correo electrónico. Si bien la licencia excluye la garantía, nos tomamos en serio los errores y la seguridad y solucionaremos los problemas lo más rápido posible.

source: Can I use RegressionLab in academic papers?
es: ¿Puedo utilizar RegressionLab en trabajos académicos?

source: **Yes**, it's free to use for academic purposes. Please cite the software appropriately (see citation information above).
es: **Sí**, su uso es gratuito para fines académicos. Cite el software de forma adecuada (consulte la información de citas más arriba).

source: What if I want to contribute code back?
es: ¿Qué pasa si quiero contribuir con el código?

source: **Great!** See the [Contributing Guide](contributing.md). Your contributions will also be under the MIT License.
es: **¡Genial!** Consulte la [Guía de contribución](contributing.md). Tus contribuciones también estarán bajo la Licencia MIT.

source: *For any other questions about licensing, please contact alejandro.mata.ali@gmail.com.*
es: *Para cualquier otra pregunta sobre licencias, comuníquese con alejandro.mata.ali@gmail.com.*
