Repository: DOKOS-TAYOS/RegressionLab
Catalog: sphinx-docs/locale/*/LC_MESSAGES/streamlit-guide.po
Languages: es

source: Streamlit Guide
es: Guía Streamlit

source: This guide covers the web-based interface of RegressionLab built with Streamlit. The Streamlit version provides a modern, browser-based experience for curve fitting operations.
es: Esta guía cubre la interfaz basada en web de RegressionLab creada con Streamlit. La versión Streamlit proporciona una experiencia moderna basada en navegador para operaciones de ajuste de curvas.

source: Overview
es: Descripción general

source: The Streamlit interface offers:
es: La interfaz Streamlit ofrece:

source: **Modern UI**: Clean, intuitive design.
es: **IU moderna**: diseño limpio e intuitivo.

source: **Accessibility**: Works on any device with a browser.
es: **Accesibilidad**: Funciona en cualquier dispositivo con navegador.

source: **No installation**: Use the online version instantly.
es: **Sin instalación**: Utilice la versión en línea al instante.

source: **Visual feedback**: Real-time updates and progress indicators.
es: **Comentarios visuales**: actualizaciones en tiempo real e indicadores de progreso.

source: Configuration (language, UI colors, fonts, plot style, paths, etc.) is the same as the Tkinter app: edit the `.env` file or use the Tkinter **Configure** menu. The Streamlit UI has no in-app configuration dialog; it reads `LANGUAGE`, `UI_BACKGROUND`, `UI_FOREGROUND`, `UI_BUTTON_*`, `UI_FONT_*`, and the rest of the env schema. The initial language and the entire look (background, sidebar, buttons, text) follow the same rules as the desktop version. The sidebar is rendered slightly lighter than the main area for visual separation.
es: La configuración (idioma, colores de la interfaz de usuario, fuentes, estilo de trazado, rutas, etc.) es la misma que la de la aplicación Tkinter: edite el archivo `.env` o use el menú **Configurar** de Tkinter. La interfaz de usuario de Streamlit no tiene un cuadro de diálogo de configuración en la aplicación; lee `LANGUAGE`, `UI_BACKGROUND`, `UI_FOREGROUND`, `UI_BUTTON_*`, `UI_FONT_*` y el resto del esquema de entorno. El idioma inicial y el aspecto completo (fondo, barra lateral, botones, texto) siguen las mismas reglas que la versión de escritorio. La barra lateral se vuelve ligeramente más clara que el área principal para la separación visual.

source: Accessing Streamlit
es: Accediendo a Streamlit

source: Online Version (Recommended)
es: Versión en línea (recomendada)

source: Visit: [https://regressionlab.streamlit.app/](https://regressionlab.streamlit.app/)
es: Visita: [https://regressionlab.streamlit.app/](https://regressionlab.streamlit.app/)

source: **First-time access**:
es: **Acceso por primera vez**:

source: Open the URL in your browser.
es: Abra la URL en su navegador.

source: If you see "App is sleeping", click "Start".
es: Si ve "La aplicación está inactiva", haga clic en "Iniciar".

source: Wait 30-60 seconds for the app to wake up.
es: Espere entre 30 y 60 segundos para que se active la aplicación.

source: The app will load and be ready to use.
es: La aplicación se cargará y estará lista para usar.

source: Local Version
es: Versión Local

source: If you have RegressionLab installed locally:
es: Si tiene RegressionLab instalado localmente:

source: **Or use the direct command:**
es: **O use el comando directo:**

source: The app will open automatically in your default browser at `http://localhost:8501`.
es: La aplicación se abrirá automáticamente en su navegador predeterminado en `http://localhost:8501`.

source: Interface Layout
es: Diseño de interfaz

source: The Streamlit interface consists of three main areas:
es: La interfaz Streamlit consta de tres áreas principales:

source: 1. Sidebar (Left)
es: 1. Barra lateral (izquierda)

source: Slightly lighter background than the main area (same theme rules as Tkinter).
es: Fondo ligeramente más claro que el área principal (las mismas reglas del tema que Tkinter).

source: **Language**: One button that cycles through all supported languages (Spanish → English → Deutsch → Spanish). The button label shows the *next* language (e.g. "English 🇬🇧" when current is Spanish). Initial value comes from `.env` `LANGUAGE`.
es: **Idioma**: Un botón que recorre todos los idiomas admitidos (español → inglés → alemán → español). La etiqueta del botón muestra el *siguiente* idioma (por ejemplo, "inglés 🇬🇧" cuando el actual es español). El valor inicial proviene de `.env` `LANGUAGE`.

source: **Mode Selection**: Choose your operation mode:
es: **Selección de modo**: Elija su modo de operación:

source: Normal Fitting.
es: Ajuste normal.

source: Multiple Datasets.
es: Múltiples conjuntos de datos.

source: Checker Fitting.
es: Ajuste corrector.

source: Total Fitting.
es: Ajuste total.

source: View Data.
es: Ver datos.

source: 2. Main Area (Center)
es: 2. Área Principal (Centro)

source: **Logo and Title**: RegressionLab branding.
es: **Logotipo y título**: marca RegressionLab.

source: **Results Display**: Plots and fitting results.
es: **Visualización de resultados**: Gráficos y resultados de ajuste.

source: 3. Results Section (Bottom)
es: 3. Sección de Resultados (Abajo)

source: ![Results](../images/en_documentation/streamlit_docs/result.png)
es: ![Resultados](../images/es_documentation/streamlit_docs/result.png)

source: **Three columns**: Equation (formula and formatted equation, left), Parameters (fit parameters with uncertainties and IC 95%, center), Statistics (R², RMSE, χ², etc., right).
es: **Tres columnas**: Ecuación (fórmula y ecuación formateada, izquierda), Parámetros (parámetros de ajuste con incertidumbres e IC 95%, centro), Estadísticas (R², RMSE, χ², etc., derecha).

source: **Plot Display**: Visualization of fitted curves below the columns.
es: **Visualización de trazado**: Visualización de curvas ajustadas debajo de las columnas.

source: **Download Button**: Below each plot; save as PNG, JPG, or PDF (when configured).
es: **Botón Descargar**: Debajo de cada gráfico; guárdelo como PNG, JPG o PDF (cuando esté configurado).

source: Language Selection
es: Selección de idioma

source: Changing the Language
es: Cambiar el idioma

source: Look at the sidebar (left side).
es: Mire la barra lateral (lado izquierdo).

source: Click the language button. The button always shows the *next* language in the cycle:
es: Haga clic en el botón de idioma. El botón siempre muestra el *siguiente* idioma del ciclo:

source: **"English 🇬🇧"** → switch to English (when current is Spanish).
es: **"Inglés 🇬🇧"** → cambiar a inglés (cuando el actual sea español).

source: **"Deutsch 🇩🇪"** → switch to German (when current is English).
es: **"Deutsch 🇩🇪"** → cambiar a alemán (cuando el actual sea inglés).

source: **"Español 🇪🇸"** → switch to Spanish (when current is German).
es: **"Español 🇪🇸"** → cambiar a español (cuando lo actual es alemán).

source: The entire interface updates immediately. Click again to cycle to the next language.
es: Toda la interfaz se actualiza inmediatamente. Haga clic nuevamente para pasar al siguiente idioma.

source: **Available Languages** (cycle order: es → en → de → es):
es: **Idiomas disponibles** (orden de ciclo: es → en → de → es):

source: Spanish (Español) – default.
es: Español (Español) – predeterminado.

source: English.
es: Inglés.

source: German (Deutsch).
es: Alemán (Deutsch).

source: Operation Modes
es: Modos de operación

source: Mode 1: Normal Fitting
es: Modo 1: Ajuste normal

source: **Purpose**: Fit one equation to one dataset.
es: **Propósito**: Ajustar una ecuación a un conjunto de datos.

source: **Steps**:
es: **Pasos**:

source: **Select Mode**:
es: **Seleccionar modo**:

source: In the sidebar, ensure "Normal Fitting" is selected.
es: En la barra lateral, asegúrese de que esté seleccionado "Ajuste normal".

source: **Optional: Loop fitting**:
es: **Opcional: Conexión de bucle**:

source: Check "Do you want loop fitting?" if you plan to fit another file with the same equation later.
es: Marque "¿Quiere un ajuste de bucle?" si planeas ajustar otro archivo con la misma ecuación más adelante.

source: When enabled, after the first fit an expander lets you upload another file and click "Fit again" without changing the equation.
es: Cuando está habilitado, después del primer ajuste, un expansor le permite cargar otro archivo y hacer clic en "Ajustar de nuevo" sin cambiar la ecuación.

source: **Upload Data**:
es: **Subir datos**:

source: Click "Browse files" or drag and drop your file.
es: Haga clic en "Buscar archivos" o arrastre y suelte su archivo.

source: Supported formats: CSV, XLSX, TXT.
es: Formatos soportados: CSV, XLSX, TXT.

source: Wait for the file to upload and process.
es: Espere a que el archivo se cargue y procese.

source: **View Data** (Optional): ![Data](../images/en_documentation/streamlit_docs/data.png)
es: **Ver datos** (opcional): ![Datos](../images/es_documentation/streamlit_docs/data.png)

source: Expand "Show Data" to preview your dataset.
es: Expanda "Mostrar datos" para obtener una vista previa de su conjunto de datos.

source: Verify columns are loaded correctly.
es: Verifique que las columnas estén cargadas correctamente.

source: **Select Variables**: ![Names](../images/en_documentation/streamlit_docs/names.png)
es: **Seleccionar variables**: ![Nombres](../images/es_documentation/streamlit_docs/names.png)

source: **Independent Variable (X)**: Choose from dropdown (e.g., "time").
es: **Variable independiente (X)**: elija del menú desplegable (por ejemplo, "tiempo").

source: **Dependent Variable (Y)**: Choose from dropdown (e.g., "temperature").
es: **Variable dependiente (Y)**: elija del menú desplegable (por ejemplo, "temperatura").

source: **Plot Name**: Enter a name for the output file (e.g., "experiment1").
es: **Nombre de la trama**: ingrese un nombre para el archivo de salida (por ejemplo, "experimento1").

source: **Select Equation**:
es: **Seleccione ecuación**:

source: Choose an equation type from the dropdown.
es: Elija un tipo de ecuación del menú desplegable.

source: Options include Linear, Quadratic, Sine, Cosine, Logarithmic, etc.
es: Las opciones incluyen lineal, cuadrática, seno, coseno, logarítmica, etc.

source: Formula shown next to each option (e.g., "Linear with intercept - y=mx+n").
es: Fórmula que se muestra junto a cada opción (por ejemplo, "Lineal con intersección - y=mx+n").

source: **Plot Options** (optional):
es: **Opciones de trama** (opcional):

source: **Show plot title**: Checkbox to show or hide the title on the plot. Default comes from the `PLOT_SHOW_TITLE` environment variable; you can override it per fit without changing the config.
es: **Mostrar título del gráfico**: casilla de verificación para mostrar u ocultar el título del gráfico. El valor predeterminado proviene de la variable de entorno `PLOT_SHOW_TITLE`; puedes anularlo por ajuste sin cambiar la configuración.

source: **Fit the Curve**:
es: **Ajustar la curva**:

source: Click "Normal Fitting" button (blue button).
es: Haga clic en el botón "Ajuste normal" (botón azul).

source: Wait for processing (spinner appears).
es: Espere el procesamiento (aparece la ruleta).

source: Results appear below.
es: Los resultados aparecen a continuación.

source: **Review Results** (three columns + plot): ![Results](../images/en_documentation/streamlit_docs/result.png)
es: **Revisar resultados** (tres columnas + gráfico): ![Resultados](../images/es_documentation/streamlit_docs/result.png)

source: **Equation** (left): Formula and formatted equation with fitted values.
es: **Ecuación** (izquierda): Fórmula y ecuación formateada con valores ajustados.

source: **Parameters** (center): Fit parameters (e.g. a, b, c) with uncertainties and IC 95%.
es: **Parámetros** (centro): Ajuste de parámetros (por ejemplo, a, b, c) con incertidumbres e IC del 95 %.

source: **Statistics** (right): R², RMSE, χ², χ²_red, degrees of freedom.
es: **Estadísticas** (derecha): R², RMSE, χ², χ²_red, grados de libertad.

source: **Plot**: Data points and fitted curve below the columns (title uses the plot name if enabled).
es: **Gráfico**: puntos de datos y curva ajustada debajo de las columnas (el título usa el nombre del gráfico si está habilitado).

source: **Download**: Button below the plot (PNG/JPG/PDF depending on configuration).
es: **Descargar**: Botón debajo del gráfico (PNG/JPG/PDF según configuración).

source: **Download Plot**:
es: **Descargar argumento**:

source: Click the "📥 Download" button below the plot.
es: Haga clic en el botón "📥 Descargar" debajo del gráfico.

source: File format is that configured for the app (default PNG); if PDF is configured, the in-app preview is PNG but the download is PDF. The plot title (when shown) uses the plot name you entered; no numeric suffix is added.
es: El formato de archivo es el configurado para la aplicación (PNG predeterminado); Si se configura PDF, la vista previa en la aplicación es PNG pero la descarga es PDF. El título de la trama (cuando se muestra) utiliza el nombre de la trama que usted ingresó; no se agrega ningún sufijo numérico.

source: **Custom Formula**:
es: **Fórmula personalizada**:

source: If "Custom Formula" is selected:
es: Si se selecciona "Fórmula personalizada":

source: **Enter Number of Parameters**: Use the number input (1-10).
es: **Ingrese el número de parámetros**: utilice la entrada numérica (1-10).

source: **Name Parameters**: Enter names in the input boxes (e.g., "a", "b", "c").
es: **Parámetros de nombre**: ingrese nombres en los cuadros de entrada (por ejemplo, "a", "b", "c").

source: Example: `a*x**2 + b*x + c`.
es: Ejemplo: `a*x**2 + b*x + c`.

source: Use `x` as the independent variable.
es: Utilice `x` como variable independiente.

source: Use parameter names defined above.
es: Utilice los nombres de parámetros definidos anteriormente.

source: Supported: `+`, `-`, `*`, `/`, `**` (power), `np.sin()`, `np.cos()`, `np.exp()`, `np.log()`, etc.
es: Soportado: `+`, `-`, `*`, `/`, `**` (potencia), `np.sin()`, `np.cos()`, `np.exp()`, `np.log()`, etc.

source: **Example Workflow**:
es: **Flujo de trabajo de ejemplo**:

source: Mode 2: Multiple Datasets
es: Modo 2: múltiples conjuntos de datos

source: **Purpose**: Apply the same equation to multiple different files.
es: **Propósito**: Aplicar la misma ecuación a varios archivos diferentes.

source: In sidebar, click "Multiple Datasets".
es: En la barra lateral, haga clic en "Múltiples conjuntos de datos".

source: **Select Equation First**:
es: **Seleccione la ecuación primero**:

source: Choose the equation type you'll use for all datasets.
es: Elija el tipo de ecuación que usará para todos los conjuntos de datos.

source: If using custom formula, define it here.
es: Si utiliza una fórmula personalizada, defínala aquí.

source: **Upload Multiple Files**:
es: **Subir varios archivos**:

source: Click "Browse files".
es: Haga clic en "Buscar archivos".

source: **Hold Ctrl (Windows/Linux) or Cmd (Mac)** to select multiple files.
es: **Mantenga presionada la tecla Ctrl (Windows/Linux) o Cmd (Mac)** para seleccionar varios archivos.

source: Or use drag-and-drop for multiple files.
es: O utilice arrastrar y soltar para varios archivos.

source: All files upload simultaneously.
es: Todos los archivos se cargan simultáneamente.

source: **Configure Each Dataset**:
es: **Configurar cada conjunto de datos**:

source: For each uploaded file:
es: Para cada archivo cargado:

source: File name shown as heading.
es: El nombre del archivo se muestra como encabezado.

source: Select X variable.
es: Seleccione la variable X.

source: Select Y variable.
es: Seleccione la variable Y.

source: Enter plot name (defaults to filename).
es: Ingrese el nombre de la trama (el valor predeterminado es nombre de archivo).

source: **Show plot title**: Checkbox to show or hide the title on all plots. Default from `PLOT_SHOW_TITLE` env var.
es: **Mostrar título del gráfico**: casilla de verificación para mostrar u ocultar el título en todos los gráficos. Valor predeterminado de `PLOT_SHOW_TITLE` env var.

source: **Fit All Datasets**:
es: **Ajustar a todos los conjuntos de datos**:

source: Click the "Multiple Datasets" button (centered, blue).
es: Haga clic en el botón "Múltiples conjuntos de datos" (centrado, azul).

source: All datasets are fitted sequentially.
es: Todos los conjuntos de datos se ajustan secuencialmente.

source: Progress indicators shown.
es: Se muestran indicadores de progreso.

source: **Review All Results**:
es: **Revisar todos los resultados**:

source: Results displayed for each dataset.
es: Resultados mostrados para cada conjunto de datos.

source: Each has its own:
es: Cada uno tiene el suyo:

source: Equation.
es: Ecuación.

source: Parameters.
es: Parámetros.

source: Plot.
es: Trama.

source: Download button.
es: Botón de descarga.

source: Scroll through results to compare.
es: Desplácese por los resultados para comparar.

source: **Tips**:
es: **Consejos**:

source: All files should have similar column names.
es: Todos los archivos deben tener nombres de columnas similares.

source: X and Y variables can be different for each file if needed.
es: Las variables X e Y pueden ser diferentes para cada archivo si es necesario.

source: Results appear in upload order.
es: Los resultados aparecen en orden de carga.

source: You can upload another set of files and click the button again for another round of fits with the same equation.
es: Puede cargar otro conjunto de archivos y hacer clic en el botón nuevamente para otra ronda de ajustes con la misma ecuación.

source: Mode 3: Checker Fitting
es: Modo 3: Ajuste corrector

source: **Purpose**: Test multiple equations on the same dataset to find the best fit.
es: **Propósito**: Probar varias ecuaciones en el mismo conjunto de datos para encontrar el mejor ajuste.

source: In sidebar, click "Checker Fitting".
es: En la barra lateral, haga clic en "Comprobador de ajuste".

source: Upload your single data file.
es: Cargue su archivo de datos único.

source: **Select Variables**:
es: **Seleccionar variables**:

source: Choose X and Y variables.
es: Elija las variables X e Y.

source: Enter plot name.
es: Introduzca el nombre de la trama.

source: **Select Multiple Equations**:
es: **Seleccione varias ecuaciones**:

source: Click in the "Select equation" dropdown.
es: Haga clic en el menú desplegable "Seleccionar ecuación".

source: **Select multiple options** by clicking each one.
es: **Seleccione varias opciones** haciendo clic en cada una.

source: Options remain in the dropdown (multi-select).
es: Las opciones permanecen en el menú desplegable (selección múltiple).

source: Default: First 3 equations pre-selected.
es: Valor predeterminado: primeras 3 ecuaciones preseleccionadas.

source: Custom formulas not available in this mode.
es: Fórmulas personalizadas no disponibles en este modo.

source: **Run Checker Fitting**:
es: **Ejecutar ajuste del verificador**:

source: Click "Checker Fitting" button.
es: Haga clic en el botón "Ajuste del inspector".

source: Progress bar shows completion.
es: La barra de progreso muestra la finalización.

source: Each equation fitted sequentially.
es: Cada ecuación se ajustó secuencialmente.

source: **Compare Results**:
es: **Comparar resultados**:

source: All results displayed vertically.
es: Todos los resultados se muestran verticalmente.

source: Compare:
es: Comparar:

source: R² values (higher is better).
es: Valores R² (cuanto más alto, mejor).

source: Visual fit quality in plots.
es: Calidad de ajuste visual en las parcelas.

source: Parameter values.
es: Valores de los parámetros.

source: Identify the best-fitting equation.
es: Identifique la ecuación que mejor se ajuste.

source: Mode 4: View Data
es: Modo 4: Ver datos

source: **Purpose**: View data from a file without performing any fitting. Includes transform, clean, and download options.
es: **Propósito**: Ver datos de un archivo sin realizar ningún ajuste. Incluye opciones de transformación, limpieza y descarga.

source: In the sidebar, select "View Data" (or "Mirar datos" in Spanish).
es: En la barra lateral, seleccione "Ver datos" (o "Mirar datos" en español).

source: **View Data**:
es: **Ver datos**:

source: Expand the data section to see the table. ![Data](../images/en_documentation/streamlit_docs/data.png)
es: Expanda la sección de datos para ver la tabla. ![Datos](../images/es_documentation/streamlit_docs/data.png)

source: Click **Show variable pairs** (or equivalent in your language) for scatter matrix (pair plots).
es: Haga clic en **Mostrar pares de variables** (o equivalente en su idioma) para ver la matriz de dispersión (gráficos de pares).

source: If there are more than 10 variables, a multiselect appears to choose which variables to display (max 10 for readability).
es: Si hay más de 10 variables, aparece un selector múltiple para elegir cuáles mostrar (máx. 10 para mejor legibilidad).

source: **Transform Data** (optional):
es: **Transformar datos** (opcional):

source: Click **Transform** to apply. The table updates immediately.
es: Haga clic en **Transformar** para aplicar. La tabla se actualiza inmediatamente.

source: **Clean Data** (optional):
es: **Limpiar datos** (opcional):

source: Select a cleaning option: drop NaN rows, drop duplicates, fill NaN (mean/median/zero), or remove outliers (IQR or z-score).
es: Seleccione una opción de limpieza: elimine filas de NaN, elimine duplicados, complete NaN (media/mediana/cero) o elimine valores atípicos (IQR o puntuación z).

source: Click **Clean** to apply. The table updates immediately.
es: Haga clic en **Limpiar** para aplicar. La tabla se actualiza inmediatamente.

source: **Download Updated Data** (optional):
es: **Descargar datos actualizados** (opcional):

source: Choose format (CSV, TXT, XLSX) from the dropdown.
es: Elija el formato (CSV, TXT, XLSX) en el menú desplegable.

source: Click the download button to save the current (possibly transformed/cleaned) data.
es: Haga clic en el botón de descarga para guardar los datos actuales (posiblemente transformados/limpiados).

source: **Help** (optional):
es: **Ayuda** (opcional):

source: Expand the Help section for a reference with pair plots, transform options (each with a detailed description), clean options (each with a detailed description), and save. Content available in Spanish, English, and German.
es: Expanda la sección Ayuda para obtener una referencia con gráficos de pares, opciones de transformación (cada una con una descripción detallada), opciones de limpieza (cada una con una descripción detallada) y guarde. Contenido disponible en español, inglés y alemán.

source: **Use case**: Inspect columns, check data quality, transform or clean data, visualize variable pairs, or download processed data before deciding on a fitting mode.
es: **Caso de uso**: inspeccione columnas, verifique la calidad de los datos, transforme o limpie datos, visualice pares de variables o descargue datos procesados ​​antes de decidirse por un modo de ajuste.

source: Mode 5: Total Fitting
es: Modo 5: Ajuste total

source: **Purpose**: Automatically test ALL available equations on your dataset.
es: **Propósito**: Probar automáticamente TODAS las ecuaciones disponibles en su conjunto de datos.

source: In sidebar, click "Total Fitting".
es: En la barra lateral, haga clic en "Ajuste total".

source: Upload your data file.
es: Sube tu archivo de datos.

source: **Run Total Fitting**:
es: **Ejecutar ajuste total**:

source: Info message shows: "Total Fitting: [N] equations".
es: El mensaje informativo muestra: "Ajuste total: [N] ecuaciones".

source: Click "Total Fitting" button.
es: Haga clic en el botón "Ajuste total".

source: **All** predefined equations fitted automatically.
es: **Todas** las ecuaciones predefinidas se ajustan automáticamente.

source: Takes longer than other modes.
es: Tarda más que otros modos.
