Repository: DOKOS-TAYOS/RegressionLab
Catalog: sphinx-docs/locale/*/LC_MESSAGES/streamlit-guide.po
Languages: es

source: Comprehensive results for all equation types.
es: Resultados completos para todo tipo de ecuaciones.

source: Scroll through to find the best fit.
es: Desplácese para encontrar la mejor opción.

source: Look for highest R² value.
es: Busque el valor R² más alto.

source: **Use Cases**:
es: **Casos de uso**:

source: Exploratory data analysis.
es: Análisis de datos exploratorios.

source: No prior knowledge of expected relationship.
es: Sin conocimiento previo de la relación esperada.

source: Creating comprehensive reports.
es: Creación de informes completos.

source: Educational purposes (see all function types).
es: Fines educativos (ver todos los tipos de funciones).

source: Data Upload
es: Carga de datos

source: Supported Formats
es: Formatos admitidos

source: **CSV** (`.csv`): Comma-separated values.
es: **CSV** (`.csv`): valores separados por comas.

source: **Excel** (`.xlsx`): Microsoft Excel files.
es: **Excel** (`.xlsx`): archivos de Microsoft Excel.

source: **TXT** (`.txt`): Tab-separated or space-separated text files.
es: **TXT** (`.txt`): archivos de texto separados por tabulaciones o espacios.

source: File Size Limits
es: Límites de tamaño de archivo

source: **Online version**: Limited by Streamlit Cloud (typically 200 MB).
es: **Versión en línea**: Limitada por Streamlit Cloud (normalmente 200 MB).

source: **Local version**: Limited by your computer's memory.
es: **Versión local**: Limitada por la memoria de tu computadora.

source: Upload Methods
es: Subir métodos

source: **Click "Browse files"**: Opens file picker dialog.
es: **Haga clic en "Examinar archivos"**: abre el cuadro de diálogo del selector de archivos.

source: **Drag and drop**: Drag files from your file manager into the upload area.
es: **Arrastrar y soltar**: arrastre archivos desde su administrador de archivos al área de carga.

source: Multiple File Upload
es: Carga de múltiples archivos

source: Hold **Ctrl** (Windows/Linux) or **Cmd** (Mac) while selecting.
es: Mantenga presionada **Ctrl** (Windows/Linux) o **Cmd** (Mac) mientras selecciona.

source: Or drag multiple files at once.
es: O arrastre varios archivos a la vez.

source: Only available in "Multiple Datasets" mode.
es: Sólo disponible en el modo "Múltiples conjuntos de datos".

source: Data Preview
es: Vista previa de datos

source: After upload, expand "Show Data" to see:
es: Después de la carga, expanda "Mostrar datos" para ver:

source: First and last rows.
es: Primera y última fila.

source: All columns.
es: Todas las columnas.

source: Data types.
es: Tipos de datos.

source: Verify data loaded correctly.
es: Verifique los datos cargados correctamente.

source: Understanding Results
es: Comprender los resultados

source: Results are shown in three columns, then the plot, then the download button.
es: Los resultados se muestran en tres columnas, luego el gráfico y luego el botón de descarga.

source: Column 1: Equation
es: Columna 1: Ecuación

source: **Formula** (if available): The generic equation form (e.g. *y = mx + n*).
es: **Fórmula** (si está disponible): la forma de ecuación genérica (por ejemplo, *y = mx + n*).

source: **Formatted equation**: The equation with fitted parameter values (e.g. *y = 5.123·x + 2.456*).
es: **Ecuación formateada**: La ecuación con valores de parámetros ajustados (por ejemplo, *y = 5,123·x + 2,456*).

source: Uses standard mathematical symbols (·, ², etc.).
es: Utiliza símbolos matemáticos estándar (·, ², etc.).

source: Column 2: Parameters
es: Columna 2: Parámetros

source: Fit parameters (e.g. a, b, c or m, n) with uncertainties and confidence intervals:
es: Ajuste los parámetros (por ejemplo, a, b, c o m, n) con incertidumbres e intervalos de confianza:

source: Each parameter: value and uncertainty (e.g. *m = 5.123 , σ(m) = 0.045*).
es: Cada parámetro: valor e incertidumbre (por ejemplo, *m = 5,123, σ(m) = 0,045*).

source: IC 95%: 95% confidence interval for each parameter.
es: IC 95%: intervalo de confianza del 95% para cada parámetro.

source: Column 3: Statistics
es: Columna 3: Estadísticas

source: **R²**: Coefficient of determination.
es: **R²**: Coeficiente de determinación.

source: **RMSE**: Root mean square error.
es: **RMSE**: raíz del error cuadrático medio.

source: **χ²**: Chi-squared.
es: **χ²**: Chi-cuadrado.

source: **χ²_red**: Reduced chi-squared.
es: **χ²_red**: Chi-cuadrado reducido.

source: **ν (g.l.)**: Degrees of freedom.
es: **ν (g.l.)**: Grados de libertad.

source: Plot Components
es: Componentes de la trama

source: **Data Points**:
es: **Puntos de datos**:

source: Red circles (or other markers).
es: Círculos rojos (u otros marcadores).

source: Error bars if uncertainties provided.
es: Barras de error si se proporcionan incertidumbres.

source: Your original measurements.
es: Tus medidas originales.

source: **Fitted Curve**:
es: **Curva ajustada**:

source: Black line (or configured color).
es: Línea negra (o color configurado).

source: Smooth curve through data.
es: Curva suave a través de datos.

source: Based on fitted equation.
es: Basado en la ecuación ajustada.

source: **Axis Labels**:
es: **Etiquetas de eje**:

source: X-axis: Your X variable name.
es: Eje X: el nombre de su variable X.

source: Y-axis: Your Y variable name.
es: Eje Y: el nombre de su variable Y.

source: **Legend** (if shown):
es: **Leyenda** (si se muestra):

source: Equation with parameters.
es: Ecuación con parámetros.

source: R² value.
es: Valor R².

source: R² Value (Coefficient of Determination)
es: Valor R² (Coeficiente de Determinación)

source: **Interpretation**:
es: **Interpretación**:

source: **R² = 1.0**: Perfect fit (rare in real data).
es: **R² = 1,0**: Ajuste perfecto (poco común en datos reales).

source: **R² > 0.95**: Excellent fit ✓.
es: **R² > 0,95**: Excelente ajuste ✓.

source: **R² > 0.85**: Good fit ✓.
es: **R² > 0,85**: Buen ajuste ✓.

source: **R² > 0.70**: Acceptable fit ⚠️.
es: **R² > 0,70**: Ajuste aceptable ⚠️.

source: **R² < 0.70**: Poor fit - try different equation ✗.
es: **R² < 0,70**: Ajuste deficiente: pruebe con una ecuación diferente ✗.

source: **What it means**:
es: **Qué significa**:

source: Percentage of variance explained by the model.
es: Porcentaje de varianza explicada por el modelo.

source: R² = 0.95 means 95% of variance explained.
es: R² = 0,95 significa que se explica el 95% de la varianza.

source: Higher is better.
es: Cuanto más alto es mejor.

source: Downloading Plots
es: Descargando Parcelas

source: Scroll to the result you want (plot is above the download button).
es: Desplácese hasta el resultado que desee (el gráfico está encima del botón de descarga).

source: File is saved with the configured format (default PNG); filename: `[plot_name].png` (or `.pdf` if configured).
es: El archivo se guarda con el formato configurado (PNG predeterminado); nombre de archivo: `[plot_name].png` (o `.pdf` si está configurado).

source: **Download Tips**:
es: **Descargar consejos**:

source: Download all plots you need before closing the browser.
es: Descargue todos los gráficos que necesite antes de cerrar el navegador.

source: Plots are high-resolution (configured DPI).
es: Los gráficos son de alta resolución (DPI configurados).

source: If the app is configured for PDF output, the in-app preview is shown as PNG but the downloaded file is PDF.
es: Si la aplicación está configurada para salida PDF, la vista previa en la aplicación se muestra como PNG pero el archivo descargado es PDF.

source: Tips and Best Practices
es: Consejos y mejores prácticas

source: Performance Tips
es: Consejos de rendimiento

source: **Use local version for large datasets**: Faster than online.
es: **Utilice la versión local para conjuntos de datos grandes**: más rápido que en línea.

source: **Close unused browser tabs**: Frees memory.
es: **Cerrar pestañas del navegador que no se utilicen**: libera memoria.

source: **One mode at a time**: Don't switch modes mid-analysis.
es: **Un modo a la vez**: no cambie de modo a mitad del análisis.

source: **Clear results**: Refresh page to clear old results and free memory.
es: **Borrar resultados**: actualice la página para borrar resultados antiguos y liberar memoria.

source: Data Tips
es: Consejos sobre datos

source: **Check data preview**: Always expand "Show Data" to verify upload.
es: **Ver vista previa de datos**: expanda siempre "Mostrar datos" para verificar la carga.

source: **Name columns clearly**: Use descriptive names like "time_s", "voltage_V".
es: **Nombre las columnas claramente**: utilice nombres descriptivos como "time_s", "voltage_V".

source: **Remove headers in Excel**: Only column names in first row, data starts row 2.
es: **Eliminar encabezados en Excel**: solo los nombres de las columnas en la primera fila, los datos comienzan en la fila 2.

source: **Consistent units**: Ensure all data uses the same units.
es: **Unidades consistentes**: asegúrese de que todos los datos utilicen las mismas unidades.

source: Workflow Tips
es: Consejos para el flujo de trabajo

source: **Start with Normal Fitting**: Test single equation first.
es: **Comience con el ajuste normal**: Pruebe primero una ecuación única.

source: **Use Checker for exploration**: When uncertain about best equation.
es: **Utilice Checker para exploración**: cuando no esté seguro de cuál es la mejor ecuación.

source: **Use Total for comprehensive analysis**: When time permits.
es: **Utilice Total para un análisis exhaustivo**: cuando el tiempo lo permita.

source: **Document your results**: Download all relevant plots.
es: **Documente sus resultados**: descargue todos los gráficos relevantes.

source: Uncertainty Handling
es: Manejo de la incertidumbre

source: If your data has uncertainties:
es: Si tus datos tienen incertidumbres:

source: Name columns `ux`, `uy` (lowercase 'u' + variable name).
es: Nombre las columnas `ux`, `uy` (minúscula 'u' + nombre de la variable).

source: Example: for variable `time`, uncertainty column is `utime`.
es: Ejemplo: para la variable "tiempo", la columna de incertidumbre es "utime".

source: Error bars appear automatically in plots.
es: Las barras de error aparecen automáticamente en los gráficos.

source: Fitting is weighted by uncertainties.
es: El ajuste está ponderado por las incertidumbres.

source: Custom Formula Tips
es: Consejos de fórmulas personalizadas

source: **Test simple formulas first**: Try `a*x` before complex expressions.
es: **Pruebe primero fórmulas simples**: pruebe `a*x` antes de expresiones complejas.

source: **Use parentheses**: `a/(1+b*x)` not `a/1+b*x`.
es: **Utilice paréntesis**: `a/(1+b*x)`, no `a/1+b*x`.

source: **Available functions**: `np.sin()`, `np.cos()`, `np.exp()`, `np.log()`, `np.sqrt()`.
es: **Funciones disponibles**: `np.sin()`, `np.cos()`, `np.exp()`, `np.log()`, `np.sqrt()`.

source: **Check parameter count**: Must match number of parameters defined.
es: **Verificar recuento de parámetros**: debe coincidir con el número de parámetros definidos.

source: Troubleshooting
es: Solución de problemas

source: Upload Issues
es: Subir problemas

source: **Problem**: File won't upload.
es: **Problema**: el archivo no se carga.

source: **Solutions**:
es: **Soluciones**:

source: Check file format (CSV, XLSX, TXT only).
es: Verifique el formato del archivo (solo CSV, XLSX, TXT).

source: Try smaller file.
es: Pruebe con un archivo más pequeño.

source: Check internet connection (online version).
es: Verifique la conexión a Internet (versión en línea).

source: Refresh page and try again.
es: Actualiza la página e inténtalo de nuevo.

source: Fitting Fails
es: El ajuste falla

source: **Problem**: "Fitting error" message appears.
es: **Problema**: Aparece el mensaje "Error de instalación".

source: **Possible causes**:
es: **Posibles causas**:

source: Not enough data points (need at least 5-10).
es: No hay suficientes puntos de datos (se necesitan al menos entre 5 y 10).

source: Data doesn't match equation type.
es: Los datos no coinciden con el tipo de ecuación.

source: Infinite or NaN values in data.
es: Valores infinitos o NaN en los datos.

source: All Y values are the same.
es: Todos los valores de Y son iguales.

source: Check data for errors.
es: Verifique los datos en busca de errores.

source: Try different equation type.
es: Pruebe diferentes tipos de ecuaciones.

source: Ensure sufficient data points.
es: Asegúrese de que haya suficientes puntos de datos.

source: Remove outliers or bad data.
es: Elimine valores atípicos o datos incorrectos.

source: Results Not Showing
es: Los resultados no se muestran

source: **Problem**: Clicked fit button but no results appear.
es: **Problema**: Se hizo clic en el botón de ajuste pero no aparecen resultados.

source: Wait for processing (check for spinner).
es: Espere el procesamiento (verifique la ruleta).

source: Scroll down (results may be below viewport).
es: Desplácese hacia abajo (los resultados pueden estar debajo de la ventana gráfica).

source: Check browser console for errors (F12).
es: Verifique la consola del navegador en busca de errores (F12).

source: App is Slow
es: La aplicación es lenta

source: **Problem**: App responds slowly or freezes.
es: **Problema**: La aplicación responde lentamente o se congela.

source: Use local version instead of online.
es: Utilice la versión local en lugar de en línea.

source: Reduce dataset size.
es: Reducir el tamaño del conjunto de datos.

source: Close other browser tabs.
es: Cierra otras pestañas del navegador.

source: Clear browser cache.
es: Borrar caché del navegador.

source: Refresh the app.
es: Actualiza la aplicación.

source: Download Doesn't Work
es: La descarga no funciona

source: **Problem**: Can't download plots.
es: **Problema**: No se pueden descargar gráficos.

source: Check browser's download settings.
es: Verifique la configuración de descarga del navegador.

source: Allow downloads from streamlit.app domain.
es: Permitir descargas desde el dominio streamlit.app.

source: Try right-click → "Save image as".
es: Intente hacer clic derecho → "Guardar imagen como".

source: Use different browser.
es: Utilice un navegador diferente.

source: Keyboard Shortcuts
es: Atajos de teclado

source: While Streamlit doesn't have extensive keyboard shortcuts, these work:
es: Si bien Streamlit no tiene atajos de teclado extensos, estos funcionan:

source: **Ctrl+R / Cmd+R**: Refresh the app.
es: **Ctrl+R / Cmd+R**: actualiza la aplicación.

source: **F5**: Refresh the page.
es: **F5**: Actualiza la página.

source: **F11**: Full screen mode.
es: **F11**: Modo de pantalla completa.

source: **Ctrl+Plus / Cmd+Plus**: Zoom in.
es: **Ctrl+Más / Cmd+Más**: Acercar.

source: **Ctrl+Minus / Cmd+Minus**: Zoom out.
es: **Ctrl+Menos / Cmd+Menos**: Alejar.

source: Mobile and Tablet Usage
es: Uso de dispositivos móviles y tabletas

source: The Streamlit interface is responsive and works on mobile devices:
es: La interfaz Streamlit responde y funciona en dispositivos móviles:

source: **Recommendations**:
es: **Recomendaciones**:

source: Use landscape orientation for better plot viewing.
es: Utilice la orientación horizontal para ver mejor la trama.

source: Tap and pinch to zoom plots.
es: Toque y pellizca para ampliar los gráficos.

source: Use tablet or larger for easier interaction.
es: Utilice una tableta o una más grande para facilitar la interacción.

source: Desktop recommended for serious work.
es: Escritorio recomendado para trabajos serios.

source: Advanced Features
es: Funciones avanzadas

source: Session Persistence
es: Persistencia de sesión

source: Results persist during your browser session.
es: Los resultados persisten durante la sesión de su navegador.

source: Refresh clears all results.
es: Actualizar borra todos los resultados.

source: Online version: sessions timeout after inactivity.
es: Versión online: tiempo de espera de las sesiones tras inactividad.

source: Multiple Tabs
es: Varias pestañas

source: You can open multiple browser tabs with RegressionLab:
es: Puede abrir varias pestañas del navegador con RegressionLab:

source: Each tab is independent.
es: Cada pestaña es independiente.

source: Useful for comparing different analyses.
es: Útil para comparar diferentes análisis.

source: Be mindful of memory usage.
es: Tenga en cuenta el uso de la memoria.

source: Appearance and theme
es: Apariencia y tema

source: The Streamlit UI uses the same configuration as the Tkinter app. Colors and fonts come from `.env` (or the Tkinter Configure dialog):
es: La interfaz de usuario de Streamlit utiliza la misma configuración que la aplicación Tkinter. Los colores y fuentes provienen de `.env` (o el cuadro de diálogo Configurar de Tkinter):

source: **Background and text:** `UI_BACKGROUND`, `UI_FOREGROUND`
es: **Fondo y texto:** `UI_BACKGROUND`, `UI_FOREGROUND`

source: **Sidebar:** Slightly lighter than the main area for separation
es: **Barra lateral:** Ligeramente más clara que el área principal de separación

source: **Buttons and accents:** `UI_BUTTON_BG`, `UI_BUTTON_FG`, etc.
es: **Botones y acentos:** `UI_BUTTON_BG`, `UI_BUTTON_FG`, etc.

source: **Fonts:** `UI_FONT_FAMILY`, `UI_FONT_SIZE`
es: **Fuentes:** `UI_FONT_FAMILY`, `UI_FONT_SIZE`

source: So changing the theme in `.env` (or in Tkinter’s configuration) affects both the desktop and the web interface consistently.
es: Entonces, cambiar el tema en `.env` (o en la configuración de Tkinter) afecta tanto al escritorio como a la interfaz web de manera consistente.

source: Differences from Tkinter Version
es: Diferencias con la versión Tkinter

source: **Streamlit has**:
es: **Streamlit tiene**:

source: ✓ Modern, web-based interface.
es: ✓ Interfaz moderna basada en web.

source: ✓ Same theme and configuration source (`.env` / config): colors, fonts, and layout rules match the Tkinter app where applicable (sidebar slightly lighter than main).
es: ✓ Mismo tema y fuente de configuración (`.env` / config): los colores, fuentes y reglas de diseño coinciden con la aplicación Tkinter cuando corresponda (barra lateral ligeramente más clara que la principal).

source: ✓ Easy sharing via URL.
es: ✓ Compartir fácilmente a través de URL.

source: ✓ Mobile/tablet support.
es: ✓ Soporte para móviles/tabletas.

source: ✓ No installation needed (online).
es: ✓ No necesita instalación (en línea).

source: ✓ Loop-like workflow: in Normal Fitting you can enable "loop fitting" and then fit another file with the same equation without changing mode; in Multiple Datasets you can upload another set of files and run again.
es: ✓ Flujo de trabajo similar a un bucle: en Ajuste normal puede habilitar el "ajuste de bucle" y luego ajustar otro archivo con la misma ecuación sin cambiar el modo; en Múltiples conjuntos de datos puede cargar otro conjunto de archivos y ejecutarlo nuevamente.

source: **Streamlit differs**:
es: **Streamlit difiere**:

source: File input is by upload only (no local file browser).
es: La entrada de archivos se realiza únicamente mediante carga (sin explorador de archivos local).

source: No configuration panel in the sidebar (language and mode only); change settings in `.env` or via Tkinter’s Configure menu.
es: Sin panel de configuración en la barra lateral (solo idioma y modo); cambie la configuración en `.env` o mediante el menú Configurar de Tkinter.

source: Results layout: three columns (Equation, Parameters, Statistics), plot, then download button.
es: Diseño de resultados: tres columnas (Ecuación, Parámetros, Estadísticas), gráfico y luego botón de descarga.

source: If output format is PDF, the in-app preview is PNG and the download is PDF.
es: Si el formato de salida es PDF, la vista previa en la aplicación es PNG y la descarga es PDF.

source: **Prediction window** and **multidimensional fitting** (custom formulas with 2+ variables, 3D/residuals plots) are currently available in the Tkinter (desktop) version.
es: **Ventana de predicción** y **ajuste multidimensional** (fórmulas personalizadas con más de 2 variables, gráficos 3D/residuales) están disponibles actualmente en la versión de Tkinter (escritorio).

source: **View Data mode** in Streamlit has the same transform, clean, and download options as Tkinter.
es: **El modo Ver datos** en Streamlit tiene las mismas opciones de transformación, limpieza y descarga que Tkinter.

source: **When to use each**:
es: **Cuándo usar cada uno**:

source: **Streamlit**: Quick analysis, sharing, accessibility.
es: **Streamlit**: análisis rápido, uso compartido y accesibilidad.

source: **Tkinter**: Offline, local file browsing, in-app configuration dialog, extra features.
es: **Tkinter**: exploración de archivos local sin conexión, cuadro de diálogo de configuración en la aplicación, funciones adicionales.

source: Next Steps
es: Próximos pasos

source: **Learn Tkinter**: See [Tkinter Guide](tkinter-guide.md) for desktop version.
es: **Aprenda Tkinter**: consulte la [Guía de Tkinter](tkinter-guide.md) para la versión de escritorio.

source: **Customize**: Configure appearance in [Configuration Guide](configuration.md).
es: **Personalizar**: configure la apariencia en la [Guía de configuración] (configuration.md).

source: **Extend**: Learn to add functions in [Extending RegressionLab](extending.md).
es: **Extender**: aprenda a agregar funciones en [Extending RegressionLab] (extending.md).

source: *Happy fitting! If you encounter issues, check the [Troubleshooting Guide](troubleshooting.md).*
es: *¡Feliz ajuste! Si tiene problemas, consulte la [Guía de solución de problemas] (troubleshooting.md).*
