Repository: DOKOS-TAYOS/RegressionLab
Catalog: sphinx-docs/locale/*/LC_MESSAGES/tkinter-guide.po
Languages: es

source: Configuration Dialog (Configure)
es: Diálogo de configuración (Configurar)

source: **Purpose**: Edit `.env` options without opening the file manually.
es: **Propósito**: Editar las opciones `.env` sin abrir el archivo manualmente.

source: **Click "Configure"** from the main menu.
es: **Haga clic en "Configurar"** en el menú principal.

source: Configuration Dialog
es: Diálogo de configuración

source: **Collapsible sections** (click header to expand/collapse): Language, UI, Plot, Font, Paths, Links, Updates, Logging.
es: **Secciones plegables** (haga clic en el encabezado para expandir/contraer): idioma, interfaz de usuario, trama, fuente, rutas, enlaces, actualizaciones, registro.

source: Each option has a label and a short description; values are shown in text fields, checkboxes (for booleans), or dropdowns (for fixed options).
es: Cada opción tiene una etiqueta y una breve descripción; los valores se muestran en campos de texto, casillas de verificación (para booleanos) o menús desplegables (para opciones fijas).

source: Use the scroll area and mouse wheel to move through sections.
es: Utilice el área de desplazamiento y la rueda del mouse para moverse por las secciones.

source: **Accept or Cancel**:
es: **Aceptar o Cancelar**:

source: **Accept**: Writes current values to `.env` and closes the dialog; the application then restarts so the new settings take effect.
es: **Aceptar**: escribe los valores actuales en `.env` y cierra el cuadro de diálogo; Luego, la aplicación se reinicia para que la nueva configuración surta efecto.

source: **Cancel** (or close window): Discards changes and closes the dialog.
es: **Cancelar** (o cerrar ventana): descarta los cambios y cierra el cuadro de diálogo.

source: **Note**: A message at the bottom reminds you that the app will restart after saving. See the [Configuration Guide](configuration.md) for the full list of options and their meanings.
es: **Nota**: Un mensaje en la parte inferior le recuerda que la aplicación se reiniciará después de guardar. Consulte la [Guía de configuración](configuration.md) para obtener la lista completa de opciones y sus significados.

source: Dialog Types
es: Tipos de diálogo

source: All dialogs and secondary windows open centered on screen. Small dialogs (file type, variable selection, etc.) keep their natural size. The help and configuration dialogs use fixed dimensions (900×650 and 760×800 pixels) for consistent layout with collapsible sections.
es: Todos los diálogos y ventanas secundarias se abren centrados en pantalla. Los diálogos pequeños (tipo de archivo, selección de variables, etc.) mantienen su tamaño natural. Los diálogos de ayuda y configuración usan dimensiones fijas (900×650 y 760×800 píxeles) para un diseño consistente con secciones desplegables.

source: Selection Dialogs
es: Diálogos de selección

source: **Dropdown Menus**:
es: **Menús desplegables**:

source: Click to expand options.
es: Haga clic para expandir las opciones.

source: Click option to select.
es: Haga clic en la opción para seleccionar.

source: Press Enter or click "Accept".
es: Presione Enter o haga clic en "Aceptar".

source: **Radio Buttons**:
es: **Botones de opción**:

source: Click one option.
es: Haga clic en una opción.

source: **Spinbox**:
es: **Caja giratoria**:

source: Type number.
es: Escriba el número.

source: Or use up/down arrows.
es: O utilice flechas arriba/abajo.

source: Text Entry Dialogs
es: Diálogos de entrada de texto

source: **Single Line**:
es: **Línea única**:

source: Type text.
es: Escriba texto.

source: ESC or "Cancel" to abort.
es: ESC o "Cancelar" para cancelar.

source: **Multi-Line** (for formulas):
es: **Multilínea** (para fórmulas):

source: Type formula.
es: Escriba la fórmula.

source: Use multiple lines if needed.
es: Utilice varias líneas si es necesario.

source: Click "Accept" when done.
es: Haga clic en "Aceptar" cuando haya terminado.

source: Information Dialogs
es: Diálogos de información

source: **Message Boxes**:
es: **Cuadros de mensajes**:

source: Read message.
es: Leer mensaje.

source: Click "OK".
es: Haga clic en "Aceptar".

source: **Yes/No Dialogs**:
es: **Sí/No cuadros de diálogo**:

source: Read question.
es: Leer pregunta.

source: Click "Yes" or "No".
es: Haga clic en "Sí" o "No".

source: Result Windows
es: Ventanas de resultados

source: **Plot Window**:
es: **Ventana de trazado**:

source: Shows matplotlib plot (or interactive 3D canvas for 2-variable fits; residuals plot for 3+ variables).
es: Muestra el gráfico matplotlib (o lienzo 3D interactivo para ajustes de 2 variables; gráfico de residuos para más de 3 variables).

source: Embedded in Tkinter window.
es: Incrustado en la ventana de Tkinter.

source: Includes:
es: Incluye:

source: Plot image.
es: Imagen de la trama.

source: Equation text (formula with fitted values).
es: Texto de ecuación (fórmula con valores ajustados).

source: Parameters with uncertainties and 95% confidence intervals.
es: Parámetros con incertidumbres e intervalos de confianza del 95%.

source: Statistics: R², RMSE, χ², reduced χ², degrees of freedom.
es: Estadísticas: R², RMSE, χ², χ² reducido, grados de libertad.

source: **Prediction** button: Opens a dialog to evaluate the fitted function at user-specified inputs; shows predicted y with uncertainty when available.
es: Botón **Predicción**: abre un cuadro de diálogo para evaluar la función ajustada en las entradas especificadas por el usuario; muestra la y predicha con incertidumbre cuando está disponible.

source: Click "Close" (or "Accept") to dismiss.
es: Haga clic en "Cerrar" (o "Aceptar") para descartar.

source: File Browsing
es: Exploración de archivos

source: Default Directories
es: Directorios predeterminados

source: **Input**:
es: **Aporte**:

source: Default: `input/` in RegressionLab directory.
es: Valor predeterminado: `input/` en el directorio RegressionLab.

source: Contains sample datasets.
es: Contiene conjuntos de datos de muestra.

source: Add your data files here.
es: Agregue sus archivos de datos aquí.

source: **Output**:
es: **Producción**:

source: Default: `output/` in RegressionLab directory.
es: Valor predeterminado: `salida/` en el directorio RegressionLab.

source: All plots saved here automatically.
es: Todos los gráficos se guardan aquí automáticamente.

source: Named according to plot name + timestamp.
es: Nombrado según el nombre de la trama + marca de tiempo.

source: Changing Directories
es: Cambiar directorios

source: In file browser:
es: En el explorador de archivos:

source: Navigate using folder list.
es: Navegue usando la lista de carpetas.

source: Double-click folders to open.
es: Haga doble clic en las carpetas para abrirlas.

source: Click file to select.
es: Haga clic en el archivo para seleccionar.

source: Use "Up" button to go to parent directory.
es: Utilice el botón "Arriba" para ir al directorio principal.

source: Or configure defaults in `.env`:
es: O configure los valores predeterminados en `.env`:

source: Keyboard Shortcuts
es: Atajos de teclado

source: While dialogs are open:
es: Mientras los cuadros de diálogo están abiertos:

source: **Space**: Accept current selection.
es: **Espacio**: Aceptar la selección actual.

source: **Tab**: Move between fields.
es: **Pestaña**: Moverse entre campos.

source: In result windows:
es: En ventanas de resultados:

source: **Alt+F4** (Windows/Linux) or **Cmd+W** (Mac): Close window.
es: **Alt+F4** (Windows/Linux) o **Cmd+W** (Mac): cerrar ventana.

source: Main menu:
es: Menú principal:

source: **Alt+F4** (Windows/Linux) or **Cmd+Q** (Mac): Quit application.
es: **Alt+F4** (Windows/Linux) o **Cmd+Q** (Mac): salir de la aplicación.

source: Understanding Results
es: Comprender los resultados

source: Result Window Components
es: Componentes de la ventana de resultados

source: ![Result Window](../images/en_documentation/tkinter_docs/result.png)
es: ![Ventana de resultados](../images/es_documentation/tkinter_docs/result.png)

source: Result Window
es: Ventana de resultados

source: The result text includes **parameters** (value ± uncertainty and 95% confidence interval per parameter) and **statistics** (R², RMSE, χ², reduced χ², degrees of freedom). The **Information** dialog (main menu → Information) has a **Statistics** section that explains these in detail.
es: El texto del resultado incluye **parámetros** (valor ± incertidumbre e intervalo de confianza del 95 % por parámetro) y **estadísticas** (R², RMSE, χ², χ² reducido, grados de libertad). El cuadro de diálogo **Información** (menú principal → Información) tiene una sección **Estadísticas** que las explica en detalle.

source: Statistics Shown
es: Estadísticas mostradas

source: **R²**: Coefficient of determination (goodness of fit).
es: **R²**: Coeficiente de determinación (bondad de ajuste).

source: **RMSE**: Root mean square error.
es: **RMSE**: raíz del error cuadrático medio.

source: **χ²**: Chi-squared.
es: **χ²**: Chi-cuadrado.

source: **χ²_red**: Reduced chi-squared.
es: **χ²_red**: Chi-cuadrado reducido.

source: **DoF (ν)**: Degrees of freedom.
es: **DoF (ν)**: Grados de libertad.

source: **IC 95%**: 95% confidence interval for each fitted parameter.
es: **IC 95%**: intervalo de confianza del 95% para cada parámetro ajustado.

source: R² Value (Coefficient of Determination)
es: Valor R² (Coeficiente de Determinación)

source: **Interpretation**:
es: **Interpretación**:

source: **R² = 1.0**: Perfect fit (rare in real data).
es: **R² = 1,0**: Ajuste perfecto (poco común en datos reales).

source: **R² > 0.95**: Excellent fit ✓.
es: **R² > 0,95**: Excelente ajuste ✓.

source: **R² > 0.85**: Good fit ✓.
es: **R² > 0,85**: Buen ajuste ✓.

source: **R² > 0.70**: Acceptable fit ⚠️.
es: **R² > 0,70**: Ajuste aceptable ⚠️.

source: **R² < 0.70**: Poor fit — try a different equation ✗.
es: **R² < 0,70**: Ajuste deficiente; pruebe con una ecuación diferente ✗.

source: R² is the fraction of variance in the data explained by the model (e.g. R² = 0.95 means 95% of the variance is explained). Higher is better.
es: R² es la fracción de la varianza en los datos explicados por el modelo (por ejemplo, R² = 0,95 significa que se explica el 95% de la varianza). Cuanto más alto es mejor.

source: Plot Features
es: Características de la trama

source: **Data Points**:
es: **Puntos de datos**:

source: Red circles (default, configurable).
es: Círculos rojos (predeterminado, configurable).

source: Error bars if uncertainties present.
es: Barras de error si existen incertidumbres.

source: Size and style from `.env`.
es: Tamaño y estilo de `.env`.

source: **Fitted Curve**:
es: **Curva ajustada**:

source: Black line (default, configurable).
es: Línea negra (predeterminada, configurable).

source: Smooth continuous curve.
es: Curva continua suave.

source: Based on fitted parameters.
es: Basado en parámetros ajustados.

source: **Axes**:
es: **Ejes**:

source: Labels from variable names.
es: Etiquetas de nombres de variables.

source: Tick marks automatically scaled.
es: Las marcas de graduación se escalan automáticamente.

source: Font and size from `.env`.
es: Fuente y tamaño de `.env`.

source: Tips and Best Practices
es: Consejos y mejores prácticas

source: Performance
es: Actuación

source: **Close result windows**: Free memory by closing old results.
es: **Cerrar ventanas de resultados**: Libera memoria cerrando resultados antiguos.

source: **Use loop mode wisely**: Only when iteratively refining data.
es: **Utilice el modo de bucle con prudencia**: solo cuando refina datos de forma iterativa.

source: **Large datasets**: May take longer, be patient.
es: **Conjuntos de datos grandes**: puede llevar más tiempo, tenga paciencia.

source: Workflow
es: Flujo de trabajo

source: **Test with small data first**: Verify setup before big analysis.
es: **Pruebe primero con datos pequeños**: verifique la configuración antes de un gran análisis.

source: **Use Watch Data**: Preview, transform, clean, and save data before fitting.
es: **Usar datos de observación**: obtenga una vista previa, transforme, limpie y guarde los datos antes de realizar la adaptación.

source: **Start simple**: Try Normal Fitting before complex modes.
es: **Empiece de forma sencilla**: pruebe el ajuste normal antes que los modos complejos.

source: **Save important plots**: Copy from `output/` to safe location.
es: **Guarde gráficos importantes**: cópielos desde `salida/` a una ubicación segura.

source: Data Organization
es: Organización de datos

source: **Keep data in `input/`**: Faster access.
es: **Mantener datos en `input/`**: Acceso más rápido.

source: **Use descriptive names**: "experiment1.csv" not "data.csv".
es: **Utilice nombres descriptivos**: "experiment1.csv", no "data.csv".

source: **One dataset per file**: Don't combine unrelated data.
es: **Un conjunto de datos por archivo**: no combine datos no relacionados.

source: **Backup originals**: Especially when using loop mode.
es: **Copia de seguridad de originales**: especialmente cuando se utiliza el modo bucle.

source: Custom Formulas
es: Fórmulas personalizadas

source: **Test incrementally**: Start with simple formula, add complexity.
es: **Pruebe incrementalmente**: comience con una fórmula simple, agregue complejidad.

source: **Use meaningful parameter names**: "amplitude" not "p1".
es: **Utilice nombres de parámetros significativos**: "amplitud", no "p1".

source: **Check parentheses**: Ensure correct order of operations.
es: **Compruebe los paréntesis**: asegúrese de que el orden de las operaciones sea correcto.

source: **Know available functions**:
es: **Conoce las funciones disponibles**:

source: Hyperbolic: `sinh(x)`, `cosh(x)`.
es: Hiperbólico: `sinh(x)`, `cosh(x)`.

source: Exponential: `exp(x)`, `log(x)`, `sqrt(x)`.
es: Exponencial: `exp(x)`, `log(x)`, `sqrt(x)`.

source: Powers: `x**2`, `x**0.5`.
es: Potencias: `x**2`, `x**0.5`.

source: Troubleshooting
es: Solución de problemas

source: Application Won't Start
es: La aplicación no se inicia

source: **Issue**: Double-clicking shortcut does nothing.
es: **Problema**: Hacer doble clic en el acceso directo no hace nada.

source: **Solutions**:
es: **Soluciones**:

source: Run from command line to see error messages.
es: Ejecute desde la línea de comando para ver mensajes de error.

source: Check Python installation: `python --version`.
es: Verifique la instalación de Python: `python --version`.

source: Verify virtual environment activated.
es: Verifique el entorno virtual activado.

source: Check logs: `regressionlab.log`.
es: Verifique los registros: `regressionlab.log`.

source: Dialogs Not Appearing
es: Los cuadros de diálogo no aparecen

source: **Issue**: Clicked button but nothing happens.
es: **Problema**: Se hizo clic en el botón pero no sucede nada.

source: Check if dialog opened behind other windows.
es: Compruebe si el cuadro de diálogo se abrió detrás de otras ventanas.

source: Look at taskbar for new windows.
es: Mire la barra de tareas para ver si hay nuevas ventanas.

source: Press Alt+Tab to cycle through windows.
es: Presione Alt+Tab para recorrer las ventanas.

source: Check if application is frozen (wait indicator).
es: Compruebe si la aplicación está congelada (indicador de espera).

source: File Browser Empty
es: Explorador de archivos vacío

source: **Issue**: No files shown in file browser.
es: **Problema**: No se muestran archivos en el explorador de archivos.

source: Navigate to correct directory.
es: Navegue hasta el directorio correcto.

source: Check file extensions (CSV, XLSX, TXT).
es: Verifique las extensiones de archivos (CSV, XLSX, TXT).

source: Verify files exist in expected location.
es: Verifique que los archivos existan en la ubicación esperada.

source: Use absolute path in `.env` for input directory.
es: Utilice la ruta absoluta en `.env` para el directorio de entrada.

source: Fitting Fails
es: El ajuste falla

source: **Issue**: Error message after selecting variables.
es: **Problema**: Mensaje de error después de seleccionar variables.

source: Check data format (numeric values only).
es: Verifique el formato de los datos (solo valores numéricos).

source: Ensure sufficient data points (>5).
es: Asegúrese de que haya suficientes puntos de datos (>5).

source: Verify X and Y columns exist.
es: Verifique que existan las columnas X e Y.

source: Check for NaN or infinite values.
es: Compruebe si hay NaN o valores infinitos.

source: Try different equation type.
es: Pruebe diferentes tipos de ecuaciones.

source: Result Window Too Large/Small
es: Ventana de resultados demasiado grande/pequeña

source: **Issue**: Result window doesn't fit screen.
es: **Problema**: la ventana de resultados no se ajusta a la pantalla.

source: Adjust plot size in `.env`:
es: Ajuste el tamaño del trazado en `.env`:

source: Restart application.
es: Reinicie la aplicación.

source: Use smaller font sizes.
es: Utilice tamaños de fuente más pequeños.

source: Colors Look Wrong
es: Los colores se ven mal

source: **Issue**: Text unreadable or colors clash.
es: **Problema**: El texto es ilegible o los colores chocan.

source: Edit `.env` color settings.
es: Edite la configuración de color `.env`.

source: Use high contrast combinations:
es: Utilice combinaciones de alto contraste:

source: Dark background + light text.
es: Fondo oscuro + texto claro.

source: Light background + dark text.
es: Fondo claro + texto oscuro.

source: Advanced Features
es: Funciones avanzadas

source: Loop Mode Strategies
es: Estrategias de modo de bucle

source: **Strategy 1: Outlier Removal**
es: **Estrategia 1: Eliminación de valores atípicos**

source: **Strategy 2: Parameter Exploration**
es: **Estrategia 2: Exploración de parámetros**

source: **Strategy 3: Uncertainty Testing**
es: **Estrategia 3: Pruebas de incertidumbre**

source: Batch Processing Workflow
es: Flujo de trabajo de procesamiento por lotes

source: For processing many similar files:
es: Para procesar muchos archivos similares:

source: Customization
es: Personalización

source: See [Configuration Guide](configuration.md) for extensive customization:
es: Consulte la [Guía de configuración](configuration.md) para una personalización exhaustiva:

source: Colors and themes.
es: Colores y temas.

source: Plot styles.
es: Estilos de trama.

source: Fonts and sizes.
es: Fuentes y tamaños.

source: Directories.
es: Directorios.

source: Logging.
es: Explotación florestal.

source: Differences from Streamlit Version
es: Diferencias con la versión Streamlit

source: **Tkinter has**:
es: **Tkinter tiene**:

source: ✓ Loop mode for iterative fitting.
es: ✓ Modo bucle para ajuste iterativo.

source: ✓ Direct file system access.
es: ✓ Acceso directo al sistema de archivos.

source: ✓ Offline operation.
es: ✓ Operación sin conexión.

source: ✓ Extensive customization via `.env`.
es: ✓ Amplia personalización a través de `.env`.

source: ✓ Native desktop performance.
es: ✓ Rendimiento de escritorio nativo.

source: ✓ Prediction window (evaluate fitted function at user inputs; uncertainty propagation).
es: ✓ Ventana de predicción (evaluar la función ajustada en las entradas del usuario; propagación de la incertidumbre).

source: ✓ Multidimensional fitting (custom formulas with 2+ variables; 3D/residuals plots).
es: ✓ Ajuste multidimensional (fórmulas personalizadas con más de 2 variables; gráficos 3D/residuales).

source: ✓ Data view with transform, clean, and save (FFT, Hilbert, Laplace, DCT, log, outliers, etc.).
es: ✓ Vista de datos con transformación, limpieza y guardado (FFT, Hilbert, Laplace, DCT, log, valores atípicos, etc.).

source: **Tkinter lacks**:
es: **Tkinter carece**:

source: ✗ Modern web UI.
es: ✗ Interfaz de usuario web moderna.

source: ✗ Easy sharing (URL-based).
es: ✗ Compartir fácilmente (basado en URL).

source: ✗ Mobile/tablet support.
es: ✗ Soporte para móviles/tabletas.

source: ✗ Automatic cloud storage.
es: ✗ Almacenamiento automático en la nube.

source: **When to use each**:
es: **Cuándo usar cada uno**:

source: **Tkinter**: Serious analysis, offline work, advanced features.
es: **Tkinter**: Análisis serio, trabajo fuera de línea, funciones avanzadas.

source: **Streamlit**: Quick checks, sharing, accessibility.
es: **Streamlit**: comprobaciones rápidas, uso compartido, accesibilidad.

source: Next Steps
es: Próximos pasos

source: **Customize Interface**: Edit `.env` to personalize appearance ([Configuration Guide](configuration.md)).
es: **Personalizar interfaz**: edite `.env` para personalizar la apariencia ([Guía de configuración](configuration.md)).

source: **Add Functions**: Learn to extend RegressionLab ([Extending RegressionLab](extending.md)).
es: **Agregar funciones**: aprenda a extender RegressionLab ([Extending RegressionLab](extending.md)).

source: **Web Version**: Try the Streamlit interface ([Streamlit Guide](streamlit-guide.md)).
es: **Versión web**: Pruebe la interfaz Streamlit ([Guía Streamlit](streamlit-guide.md)).

source: *Master the desktop interface! Check [Troubleshooting](troubleshooting.md) for help with any issues.*
es: *¡Domina la interfaz de escritorio! Consulte [Solución de problemas] (troubleshooting.md) para obtener ayuda con cualquier problema.*
