Repository: DOKOS-TAYOS/RegressionLab
Catalog: sphinx-docs/locale/*/LC_MESSAGES/tkinter-guide.po
Languages: es

source: Tkinter Guide
es: Guía de Tkinter

source: This guide covers the desktop application interface of RegressionLab built with Tkinter. The Tkinter version provides a full-featured native application experience with advanced options and offline capabilities.
es: Esta guía cubre la interfaz de la aplicación de escritorio de RegressionLab creada con Tkinter. La versión de Tkinter proporciona una experiencia de aplicación nativa con todas las funciones, opciones avanzadas y capacidades fuera de línea.

source: Overview
es: Descripción general

source: The Tkinter interface offers:
es: La interfaz de Tkinter ofrece:

source: **Native Performance**: Fast, responsive desktop application.
es: **Rendimiento nativo**: aplicación de escritorio rápida y responsiva.

source: **Offline Operation**: No internet connection required.
es: **Operación sin conexión**: No se requiere conexión a Internet.

source: **Advanced Features**: Loop mode, direct file browsing, extensive customization.
es: **Funciones avanzadas**: modo de bucle, exploración directa de archivos, amplia personalización.

source: **Traditional UI**: Familiar desktop application layout.
es: **IU tradicional**: diseño familiar de la aplicación de escritorio.

source: **Full Control**: Access to all configuration options.
es: **Control total**: Acceso a todas las opciones de configuración.

source: Launching the Application
es: Lanzando la aplicación

source: Method 1: Desktop Shortcut
es: Método 1: acceso directo al escritorio

source: Double-click the "RegressionLab" shortcut created during installation.
es: Haga doble clic en el acceso directo "RegressionLab" creado durante la instalación.

source: ![Desktop Shortcut](../images/en_documentation/tkinter_docs/shortcut.png)
es: ![Atajo de escritorio](../images/es_documentation/tkinter_docs/shortcut.png)

source: Desktop Shortcut
es: Acceso directo al escritorio

source: Method 2: Shell Scripts
es: Método 2: scripts de Shell

source: Method 3: Direct Python Execution
es: Método 3: ejecución directa de Python

source: Interface Layout
es: Diseño de interfaz

source: The Tkinter application uses a menu-based navigation system:
es: La aplicación Tkinter utiliza un sistema de navegación basado en menús:

source: Main Menu Window
es: Ventana del menú principal

source: When you launch the application, you see the main menu with buttons for each operation mode:
es: Cuando inicia la aplicación, ve el menú principal con botones para cada modo de operación:

source: ![Main Menu](../images/en_documentation/tkinter_docs/main.png)
es: ![Menú principal](../images/es_documentation/tkinter_docs/main.png)

source: Main Menu
es: Menú principal

source: **Button colors and layout**: Configurable via `.env` or the **Configure** dialog.
es: **Colores y diseño de los botones**: Configurable a través de `.env` o el cuadro de diálogo **Configurar**.

source: **Window size**: Adapts to content. All dialogs appear centered on screen.
es: **Tamaño de ventana**: Se adapta al contenido. Todos los diálogos aparecen centrados en pantalla.

source: **Information**: Opens the help dialog (objective, advantages, modes, data format, locations, statistics; optional Donations button).
es: **Información**: Abre el cuadro de diálogo de ayuda (objetivo, ventajas, modos, formato de datos, ubicaciones, estadísticas; botón opcional Donaciones).

source: **Configure**: Opens the configuration dialog; saving writes `.env` and restarts the application.
es: **Configurar**: Abre el cuadro de diálogo de configuración; guardar escribe `.env` y reinicia la aplicación.

source: Language
es: Idioma

source: The language is set in the `.env` file or in the **Configure** dialog (Language section):
es: El idioma se establece en el archivo `.env` o en el cuadro de diálogo **Configurar** (sección Idioma):

source: You can also use aliases (e.g. `spanish`, `english`, `deutsch`). Change requires restarting the application.
es: También puedes utilizar alias (por ejemplo, `español`, `inglés`, `deutsch`). El cambio requiere reiniciar la aplicación.

source: Operation Modes
es: Modos de operación

source: Mode 1: Normal Fitting
es: Modo 1: Ajuste normal

source: **Purpose**: Fit one equation to one dataset with optional loop mode.
es: **Propósito**: Ajustar una ecuación a un conjunto de datos con el modo de bucle opcional.

source: **Steps**:
es: **Pasos**:

source: **Click "Normal Fitting"** from the main menu.
es: **Haga clic en "Ajuste normal"** en el menú principal.

source: **Select Equation Type**:
es: **Seleccione tipo de ecuación**:

source: Equation Selector
es: Selector de ecuaciones

source: Choose from predefined equations:
es: Elija entre ecuaciones predefinidas:

source: Linear (y=mx)
es: Lineal (y=mx)

source: Linear with intercept (y=mx+n)
es: Lineal con intersección (y=mx+n)

source: Quadratic (y=ax²)
es: Cuadrática (y=ax²)

source: Quadratic complete (y=cx²+bx+a)
es: Cuadrática completa (y=cx²+bx+a)

source: Fourth power (y=ax⁴)
es: Cuarta potencia (y=ax⁴)

source: Sin, Cos (with and without phase)
es: Sin, Cos (con y sin fase)

source: Logarithmic (y=a·ln(x))
es: Logarítmico (y=a·ln(x))

source: Inverse (y=a/x)
es: Inversa (y=a/x)

source: Inverse square (y=a/x²)
es: Cuadrado inverso (y=a/x²)

source: Or select "Custom Formula" (see below).
es: O seleccione "Fórmula personalizada" (ver más abajo).

source: Click "Accept" or press Enter.
es: Haga clic en "Aceptar" o presione Entrar.

source: **Enable/Disable Loop Mode**:
es: **Activar/desactivar el modo de bucle**:

source: Dialog asks: "Do you want to enable loop mode?"
es: El cuadro de diálogo pregunta: "¿Quieres habilitar el modo de bucle?"

source: **Yes**: After fitting, you can modify data and refit.
es: **Sí**: Después del montaje, puedes modificar los datos y volver a montar.

source: **No**: Single fit, then return to main menu.
es: **No**: Ajuste único, luego regrese al menú principal.

source: Loop mode recommended for iterative data refinement.
es: Se recomienda el modo de bucle para el refinamiento de datos iterativos.

source: **Select Data File**:
es: **Seleccione archivo de datos**:

source: Default filter: all data files (CSV, TXT, XLSX). You can also filter by type.
es: Filtro predeterminado: todos los archivos de datos (CSV, TXT, XLSX). También puedes filtrar por tipo.

source: Default location: `input/` directory.
es: Ubicación predeterminada: directorio `input/`.

source: Navigate to your data file and click "Open".
es: Navegue hasta su archivo de datos y haga clic en "Abrir".

source: **Select Variables**:
es: **Seleccionar variables**:

source: Dialog shows available columns. ![Variable Selection](../images/en_documentation/tkinter_docs/names.png)
es: El cuadro de diálogo muestra las columnas disponibles. ![Selección de variables](../images/es_documentation/tkinter_docs/names.png)

source: Variable Selection
es: Selección de variables

source: **Select X (independent variable)**:
es: **Seleccione X (variable independiente)**:

source: Dropdown with all non-uncertainty columns.
es: Desplegable con todas las columnas sin incertidumbre.

source: Example: "time", "voltage", "concentration".
es: Ejemplo: "tiempo", "voltaje", "concentración".

source: **Multidimensional (custom formulas only)**: If the equation has 2+ independent variables, a dialog asks you to select multiple X columns (e.g. first X, second X, etc.).
es: **Multidimensional (solo fórmulas personalizadas)**: si la ecuación tiene más de 2 variables independientes, un cuadro de diálogo le pide que seleccione varias columnas X (por ejemplo, primera X, segunda X, etc.).

source: **Select Y (dependent variable)**:
es: **Seleccione Y (variable dependiente)**:

source: Dropdown with remaining columns.
es: Desplegable con las columnas restantes.

source: Example: "temperature", "current", "absorbance".
es: Ejemplo: "temperatura", "corriente", "absorbancia".

source: **Enter Plot Name**:
es: **Ingrese el nombre de la trama**:

source: Text field for output filename.
es: Campo de texto para el nombre del archivo de salida.

source: Default: based on variable names.
es: Predeterminado: basado en nombres de variables.

source: Example: "experiment_2026".
es: Ejemplo: "experimento_2026".

source: Click "Accept".
es: Haga clic en "Aceptar".

source: **View Results**:
es: **Ver resultados**:

source: New window opens showing: ![Results Window](../images/en_documentation/tkinter_docs/result.png)
es: Se abre una nueva ventana que muestra: ![Ventana de resultados](../images/es_documentation/tkinter_docs/result.png)

source: Results Window
es: Ventana de resultados

source: **Equation**: Mathematical formula with parameters.
es: **Ecuación**: Fórmula matemática con parámetros.

source: **Parameters**: Values with uncertainties.
es: **Parámetros**: Valores con incertidumbres.

source: **R² Value**: Goodness of fit.
es: **Valor R²**: Bondad de ajuste.

source: **Prediction** button: Opens a dialog to evaluate the fitted function at user-specified x values; shows predicted y with uncertainty propagation when available.
es: Botón **Predicción**: abre un cuadro de diálogo para evaluar la función ajustada en valores x especificados por el usuario; muestra la y predicha con propagación de la incertidumbre cuando esté disponible.

source: Plot automatically saved to `output/` directory.
es: El trazado se guarda automáticamente en el directorio `output/`.

source: **Loop Mode** (if enabled):
es: **Modo de bucle** (si está habilitado):

source: After viewing results, dialog asks: "Continue with this dataset?"
es: Después de ver los resultados, el cuadro de diálogo pregunta: "¿Continuar con este conjunto de datos?"

source: **Yes**:
es: **Sí**:

source: Modify your data file (in Excel, text editor, etc.).
es: Modifique su archivo de datos (en Excel, editor de texto, etc.).

source: Click Yes to reload and refit.
es: Haga clic en Sí para recargar y volver a montar.

source: Repeat as needed.
es: Repita según sea necesario.

source: **No**: Return to main menu.
es: **No**: Volver al menú principal.

source: **Custom Formula**:
es: **Fórmula personalizada**:

source: If you select "Custom Formula":
es: Si selecciona "Fórmula personalizada":

source: **Number of Parameters**:
es: **Número de parámetros**:

source: Dialog with spinbox.
es: Diálogo con spinbox.

source: Enter number of parameters (1-10).
es: Introduzca el número de parámetros (1-10).

source: **Parameter Names**:
es: **Nombres de parámetros**:

source: Enter meaningful names (e.g., "amplitude", "frequency", "phase").
es: Introduzca nombres significativos (por ejemplo, "amplitud", "frecuencia", "fase").

source: Or use defaults (p1, p2, etc.).
es: O utilice los valores predeterminados (p1, p2, etc.).

source: **Number of Independent Variables** (optional):
es: **Número de variables independientes** (opcional):

source: Spinbox: 1 for standard y=f(x), 2+ for multidimensional regression.
es: Spinbox: 1 para y=f(x) estándar, 2+ para regresión multidimensional.

source: Use `x_0`, `x_1`, etc. in the formula for 2+ variables.
es: Utilice `x_0`, `x_1`, etc. en la fórmula para 2+ variables.

source: **Enter Formula**:
es: **Ingrese la fórmula**:

source: Custom Formula Entry
es: Entrada de fórmula personalizada

source: Enter formula using parameter names and `x` (or `x_0`, `x_1` for multidimensional).
es: Ingrese la fórmula usando nombres de parámetros y `x` (o `x_0`, `x_1` para multidimensional).

source: Example: `amplitude * sin(frequency * x + phase)`.
es: Ejemplo: `amplitud * sin(frecuencia * x + fase)`.

source: Example (2 variables): `a*x_0 + b*x_1 + c`.
es: Ejemplo (2 variables): `a*x_0 + b*x_1 + c`.

source: Continue with steps 3-8 above.
es: Continúe con los pasos 3 a 8 anteriores.

source: **Example Workflow**:
es: **Flujo de trabajo de ejemplo**:

source: Mode 2: Single Fit Multiple Datasets
es: Modo 2: Ajuste único de múltiples conjuntos de datos

source: **Purpose**: Apply the same equation to multiple different datasets.
es: **Propósito**: Aplicar la misma ecuación a varios conjuntos de datos diferentes.

source: **Click "Single Fit Multiple Datasets"** from the main menu.
es: **Haga clic en "Ajuste único de múltiples conjuntos de datos"** en el menú principal.

source: **Select Equation Type**: (same as Normal Fitting).
es: **Seleccione el tipo de ecuación**: (igual que el ajuste normal).

source: **Enter Number of Datasets**:
es: **Ingrese el número de conjuntos de datos**:

source: Enter how many datasets you want to fit (2-99).
es: Ingrese cuántos conjuntos de datos desea ajustar (2-99).

source: Asked once for all datasets.
es: Preguntado una vez para todos los conjuntos de datos.

source: **For Each Dataset**:
es: **Para cada conjunto de datos**:

source: Select file (native file picker).
es: Seleccionar archivo (selector de archivos nativo).

source: Select X and Y variables.
es: Seleccione las variables X e Y.

source: Enter plot name.
es: Introduzca el nombre de la trama.

source: Repeat for all datasets.
es: Repita para todos los conjuntos de datos.

source: **View All Results**:
es: **Ver todos los resultados**:

source: Results appear sequentially.
es: Los resultados aparecen secuencialmente.

source: Each in its own window.
es: Cada uno en su propia ventana.

source: All plots saved automatically.
es: Todos los gráficos se guardan automáticamente.

source: After all fits, ask to continue with all datasets.
es: Después de que todos coincidan, solicite continuar con todos los conjuntos de datos.

source: Modify any/all data files.
es: Modifique cualquiera o todos los archivos de datos.

source: Reload and refit all.
es: Vuelva a cargar y montar todo.

source: **Tips**:
es: **Consejos**:

source: Prepare all data files beforehand.
es: Prepare todos los archivos de datos de antemano.

source: Use consistent column names across files.
es: Utilice nombres de columnas coherentes en todos los archivos.

source: Keep file browser in same directory for faster selection.
es: Mantenga el explorador de archivos en el mismo directorio para una selección más rápida.

source: Mode 3: Checker Fitting (Multiple Fits Single Dataset)
es: Modo 3: Ajuste corrector (conjunto de datos único de ajustes múltiples)

source: **Purpose**: Test multiple equations on the same dataset.
es: **Propósito**: Probar múltiples ecuaciones en el mismo conjunto de datos.

source: **Click "Checker Fitting"** from the main menu.
es: **Haga clic en "Comprobador de ajuste"** en el menú principal.

source: **Load Dataset**:
es: **Cargar conjunto de datos**:

source: Enter plot name (used for all results).
es: Ingrese el nombre de la parcela (usado para todos los resultados).

source: **Test Equations**:
es: **Ecuaciones de prueba**:

source: For each equation you want to test:
es: Para cada ecuación que quieras probar:

source: Dialog asks: "Select equation type".
es: El cuadro de diálogo pregunta: "Seleccione el tipo de ecuación".

source: Choose an equation.
es: Elige una ecuación.

source: View results.
es: Ver resultados.

source: Dialog asks: "Do you want to continue testing?"
es: El cuadro de diálogo pregunta: "¿Quieres continuar con las pruebas?"

source: **Yes**: Try another equation.
es: **Sí**: prueba con otra ecuación.

source: **Compare Results**:
es: **Comparar resultados**:

source: Multiple result windows open.
es: Se abren varias ventanas de resultados.

source: Compare R² values.
es: Compara los valores de R².

source: Compare visual fit quality.
es: Compare la calidad del ajuste visual.

source: Choose the best equation.
es: Elige la mejor ecuación.

source: **Workflow Strategy**:
es: **Estrategia de flujo de trabajo**:

source: Mode 4: Total Fitting
es: Modo 4: Ajuste total

source: **Purpose**: Automatically fit ALL available equations.
es: **Propósito**: Ajustar automáticamente TODAS las ecuaciones disponibles.

source: **Click "Total Fitting"** from the main menu.
es: **Haga clic en "Ajuste total"** en el menú principal.

source: **Automatic Fitting**:
es: **Montaje automático**:

source: All predefined equations fitted automatically.
es: Todas las ecuaciones predefinidas se ajustan automáticamente.

source: Result windows appear sequentially.
es: Las ventanas de resultados aparecen secuencialmente.

source: Takes 5-30 seconds depending on data size.
es: Tarda entre 5 y 30 segundos, según el tamaño de los datos.

source: **Review All Results**:
es: **Revisar todos los resultados**:

source: Multiple windows with all fits.
es: Múltiples ventanas con todos los ajustes.

source: Scan through to find highest R².
es: Escanee para encontrar el R² más alto.

source: Choose the best-fitting equation.
es: Elija la ecuación que mejor se ajuste.

source: **Use Cases**:
es: **Casos de uso**:

source: Comprehensive analysis.
es: Análisis integral.

source: Educational demonstrations.
es: Demostraciones educativas.

source: When you have no idea what equation to expect.
es: Cuando no tienes idea de qué ecuación esperar.

source: Creating a fitting report with all options.
es: Creando un informe adecuado con todas las opciones.

source: Mode 5: Watch Data
es: Modo 5: Ver datos

source: **Purpose**: View data file contents without fitting. Includes transform, clean, and save options.
es: **Propósito**: Ver el contenido del archivo de datos sin ajustarlo. Incluye opciones de transformar, limpiar y guardar.

source: **Click "Watch Data"** from the main menu.
es: **Haga clic en "Ver datos"** en el menú principal.

source: **Select File**:
es: **Seleccione Archivo**:

source: Native file picker opens (default filter: all data files). Browse and select a CSV, TXT, or XLSX file.
es: Se abre el selector de archivos nativo (filtro predeterminado: todos los archivos de datos). Busque y seleccione un archivo CSV, TXT o XLSX.

source: **View Data**:
es: **Ver datos**:

source: Data View
es: Vista de datos

source: Dialog shows:
es: El diálogo muestra:

source: All columns and rows in table format.
es: Todas las columnas y filas en formato de tabla.

source: **Row 1**: Pair plots button | Save updated data | **Help** (opens a dialog with detailed info about every option and mode, in the current language).
es: **Fila 1**: botón Emparejar gráficos | Guardar datos actualizados | **Ayuda** (abre un cuadro de diálogo con información detallada sobre cada opción y modo, en el idioma actual).

source: If there are more than 10 variables, clicking the pair plots button opens a variable selection dialog first (max 10 for readability).
es: Si hay más de 10 variables, al pulsar el botón de pares de variables se abre primero un diálogo de selección de variables (máx. 10 para mejor legibilidad).

source: **Row 2**: Transform dropdown | Transform button (same accent color as equation buttons).
es: **Fila 2**: menú desplegable Transformar | Botón Transformar (mismo color de acento que los botones de ecuación).

source: **Row 3**: Clean dropdown | Clean button (same accent color as equation buttons).
es: **Fila 3**: Menú desplegable limpio | Botón Limpiar (mismo color de acento que los botones de ecuación).

source: Use scrollbar to navigate the table.
es: Utilice la barra de desplazamiento para navegar por la tabla.

source: Click **Help** for a reference with collapsible sections (pair plots, transform options, clean options, save). Each transform and clean option has a detailed description. Available in Spanish, English, and German.
es: Haga clic en **Ayuda** para obtener una referencia con secciones plegables (emparejar gráficos, opciones de transformación, opciones de limpieza, guardar). Cada opción de transformación y limpieza tiene una descripción detallada. Disponible en español, inglés y alemán.

source: Click **Accept** when done.
es: Haga clic en **Aceptar** cuando haya terminado.

source: **Transform Data** (optional):
es: **Transformar datos** (opcional):

source: Select a transform from the dropdown: FFT, FFT magnitude, inverse FFT, DCT, inverse DCT, log, log10, exp, sqrt, square, standardize (z-score), normalize [0,1], Hilbert, inverse Hilbert, envelope (Hilbert), Laplace (discrete), inverse Laplace, cepstrum (real), Hadamard (Walsh), inverse Hadamard.
es: Seleccione una transformación del menú desplegable: FFT, magnitud FFT, FFT inversa, DCT, DCT inversa, log, log10, exp, sqrt, cuadrado, estandarizar (puntuación z), normalizar [0,1], Hilbert, Hilbert inversa, envolvente (Hilbert), Laplace (discreta), Laplace inversa, cepstrum (real), Hadamard (Walsh), Hadamard inversa.

source: Click **Transform** to apply. The table updates immediately.
es: Haga clic en **Transformar** para aplicar. La tabla se actualiza inmediatamente.

source: If the pair plots window is open, it updates automatically.
es: Si la ventana de gráficos de pares está abierta, se actualiza automáticamente.

source: **Clean Data** (optional):
es: **Limpiar datos** (opcional):

source: Select a cleaning option: drop NaN rows, drop duplicates, fill NaN (mean/median/zero), or remove outliers (IQR or z-score).
es: Seleccione una opción de limpieza: elimine filas de NaN, elimine duplicados, complete NaN (media/mediana/cero) o elimine valores atípicos (IQR o puntuación z).

source: Click **Clean** to apply. The table updates immediately.
es: Haga clic en **Limpiar** para aplicar. La tabla se actualiza inmediatamente.

source: **Save Updated Data** (optional):
es: **Guardar datos actualizados** (opcional):

source: Click **Save updated data** to save the current (possibly transformed/cleaned) data to CSV, TXT, or XLSX.
es: Haga clic en **Guardar datos actualizados** para guardar los datos actuales (posiblemente transformados/limpiados) en CSV, TXT o XLSX.

source: Verify data loaded correctly.
es: Verifique los datos cargados correctamente.

source: Check column names.
es: Verifique los nombres de las columnas.

source: Inspect data values.
es: Inspeccionar los valores de los datos.

source: Preview before fitting.
es: Vista previa antes del montaje.

source: Transform data (e.g. FFT, Hilbert, Laplace, log) for analysis.
es: Transforme datos (por ejemplo, FFT, Hilbert, Laplace, log) para su análisis.

source: Clean data (remove outliers, fill NaN) before fitting.
es: Limpie los datos (elimine los valores atípicos, complete NaN) antes de realizar el ajuste.

source: Mode 6: Information (Help)
es: Modo 6: Información (Ayuda)

source: **Purpose**: View help and application information.
es: **Propósito**: Ver ayuda e información de la aplicación.

source: **Click "Information"** from the main menu.
es: **Haga clic en "Información"** en el menú principal.

source: Information Dialog
es: Diálogo de información

source: Window with scrollable content and **collapsible sections** (click the section header to expand/collapse).
es: Ventana con contenido desplazable y **secciones plegables** (haga clic en el encabezado de la sección para expandir/contraer).

source: Sections: **Objective**, **Advantages**, **Fitting Modes** (including loop mode), **Custom Functions**, **Data Format** (columns, uncertainty prefix), **Data Location** (input dir, formats), **Output Location** (plots, logs), **Statistics** (R², RMSE, χ², reduced χ², DoF, 95% parameter intervals).
es: Secciones: **Objetivo**, **Ventajas**, **Modos de ajuste** (incluido el modo de bucle), **Funciones personalizadas**, **Formato de datos** (columnas, prefijo de incertidumbre), **Ubicación de datos** (directorio de entrada, formatos), **Ubicación de salida** (gráficos, registros), **Estadísticas** (R², RMSE, χ², χ² reducido, DoF, intervalos de parámetros del 95%).

source: If a donations URL is set in configuration, a **Donations** button appears at the bottom.
es: Si se establece una URL de donaciones en la configuración, aparece un botón **Donaciones** en la parte inferior.

source: Click **Accept** (or close the window) when done.
es: Haga clic en **Aceptar** (o cierre la ventana) cuando haya terminado.
