Repository: DOKOS-TAYOS/RegressionLab
Catalog: sphinx-docs/locale/*/LC_MESSAGES/troubleshooting.po
Languages: es

source: Troubleshooting
es: Solución de problemas

source: This guide covers known issues, common problems, and their solutions. It also includes information about future updates and the development roadmap.
es: Esta guía cubre problemas conocidos, problemas comunes y sus soluciones. También incluye información sobre futuras actualizaciones y la hoja de ruta de desarrollo.

source: Common Problems and Solutions
es: Problemas comunes y soluciones

source: Installation Issues
es: Problemas de instalación

source: Problem: Python Not Found
es: Problema: Python no encontrado

source: **Solution**:
es: **Solución**:

source: Verify Python installation: Open Command Prompt/Terminal.
es: Verifique la instalación de Python: abra el símbolo del sistema/terminal.

source: Try `python --version` or `python3 --version`.
es: Pruebe `python --version` o `python3 --version`.

source: If not found, install Python from [python.org](https://python.org).
es: Si no lo encuentra, instale Python desde [python.org](https://python.org).

source: **Important**: During installation, check "Add Python to PATH".
es: **Importante**: Durante la instalación, marque "Agregar Python a la RUTA".

source: Restart terminal after installation.
es: Reinicie el terminal después de la instalación.

source: Problem: Virtual Environment Not Found (bin launchers)
es: Problema: entorno virtual no encontrado (lanzadores de contenedores)

source: (or `setup.sh` on macOS/Linux)
es: (o `setup.sh` en macOS/Linux)

source: **Solution**: The `bin/` launchers (`run.bat`, `run.sh`, `run_streamlit.bat`, `run_streamlit.sh`, `run_tests.bat`, `run_tests.sh`) require a project virtual environment. From the project root, run:
es: **Solución**: Los lanzadores `bin/` (`run.bat`, `run.sh`, `run_streamlit.bat`, `run_streamlit.sh`, `run_tests.bat`, `run_tests.sh`) requieren un entorno virtual de proyecto. Desde la raíz del proyecto, ejecute:

source: **macOS/Linux**: `chmod +x setup.sh` then `./setup.sh`
es: **macOS/Linux**: `chmod +x setup.sh` y luego `./setup.sh`

source: Then run the desired launcher again.
es: Luego ejecute nuevamente el iniciador deseado.

source: Problem: Permission Denied on Linux/macOS
es: Problema: Permiso denegado en Linux/macOS

source: Problem: Virtual Environment Won't Activate (Windows PowerShell)
es: Problema: el entorno virtual no se activa (Windows PowerShell)

source: Open PowerShell as Administrator.
es: Abra PowerShell como administrador.

source: Run: `Set-ExecutionPolicy RemoteSigned`.
es: Ejecute: `Set-ExecutionPolicy RemoteSigned`.

source: Confirm with 'Y'.
es: Confirme con 'Y'.

source: Retry activation: `.venv\Scripts\Activate.ps1`.
es: Reintente la activación: `.venv\Scripts\Activate.ps1`.

source: Problem: Module Not Found After Installation
es: Problema: Módulo no encontrado después de la instalación

source: Ensure virtual environment is activated.
es: Asegúrese de que el entorno virtual esté activado.

source: You should see `(.venv)` in your terminal prompt.
es: Deberías ver `(.venv)` en el indicador de tu terminal.

source: macOS/Linux: `source .venv/bin/activate`.
es: macOS/Linux: `fuente .venv/bin/activate`.

source: Reinstall dependencies:
es: Reinstale las dependencias:

source: Verify installation:
es: Verificar la instalación:

source: Data Loading Issues
es: Problemas de carga de datos

source: Problem: "File not found" Error
es: Problema: Error "Archivo no encontrado"

source: Check file exists in specified location.
es: Compruebe que el archivo existe en la ubicación especificada.

source: Use absolute path if relative path fails.
es: Utilice la ruta absoluta si falla la ruta relativa.

source: Check file permissions (read access required).
es: Verifique los permisos de archivos (se requiere acceso de lectura).

source: Verify file extension (.csv, .xlsx, .txt).
es: Verifique la extensión del archivo (.csv, .xlsx, .txt).

source: Problem: CSV File Appears Empty
es: Problema: el archivo CSV parece vacío

source: Open file in text editor to verify content.
es: Abra el archivo en el editor de texto para verificar el contenido.

source: Check delimiter (comma, semicolon, tab).
es: Verifique el delimitador (coma, punto y coma, tabulación).

source: Ensure first row contains column headers.
es: Asegúrese de que la primera fila contenga encabezados de columna.

source: Remove any blank lines at beginning of file.
es: Elimine las líneas en blanco al comienzo del archivo.

source: Problem: Excel File Won't Load
es: Problema: el archivo de Excel no se carga

source: Ensure `openpyxl` is installed: `pip install openpyxl`.
es: Asegúrese de que `openpyxl` esté instalado: `pip install openpyxl`.

source: Check file isn't password-protected.
es: El archivo de comprobación no está protegido con contraseña.

source: Verify file isn't corrupted (try opening in Excel).
es: Verifique que el archivo no esté dañado (intente abrirlo en Excel).

source: Save as .xlsx format (newer format more reliable).
es: Guárdelo como formato .xlsx (el formato más nuevo es más confiable).

source: Problem: Uncertainty Columns Not Detected
es: Problema: columnas de incertidumbre no detectadas

source: Verify naming: uncertainty for column `x` must be named `ux`.
es: Verificar el nombre: la incertidumbre de la columna "x" debe denominarse "ux".

source: Use lowercase `u` prefix.
es: Utilice el prefijo "u" minúscula.

source: Check for extra spaces in column names.
es: Compruebe si hay espacios adicionales en los nombres de las columnas.

source: Ensure uncertainty columns contain numeric values.
es: Asegúrese de que las columnas de incertidumbre contengan valores numéricos.

source: Fitting Issues
es: Problemas de ajuste

source: Problem: "Optimal parameters not found"
es: Problema: "No se encontraron parámetros óptimos"

source: **Causes**:
es: **Causas**:

source: Not enough data points (need at least 5-10).
es: No hay suficientes puntos de datos (se necesitan al menos entre 5 y 10).

source: Data doesn't match equation type.
es: Los datos no coinciden con el tipo de ecuación.

source: Bad initial parameter guess.
es: Mala estimación del parámetro inicial.

source: Equation too complex for data.
es: Ecuación demasiado compleja para los datos.

source: **Solutions**:
es: **Soluciones**:

source: **Check data quality**:
es: **Comprueba la calidad de los datos**:

source: Plot data first (use "Watch Data").
es: Trazar los datos primero (use "Ver datos").

source: Look for obvious outliers.
es: Busque valores atípicos obvios.

source: Ensure sufficient data points.
es: Asegúrese de que haya suficientes puntos de datos.

source: **Try different equation**:
es: **Pruebe una ecuación diferente**:

source: Start with simpler equations (linear, quadratic).
es: Comience con ecuaciones más simples (lineales, cuadráticas).

source: Use Checker mode to test multiple equations.
es: Utilice el modo Checker para probar múltiples ecuaciones.

source: **Provide better initial guess**:
es: **Proporciona una mejor suposición inicial**:

source: For custom formulas, estimate parameters manually.
es: Para fórmulas personalizadas, estime los parámetros manualmente.

source: Look at data range to guess amplitudes.
es: Mire el rango de datos para adivinar amplitudes.

source: **Simplify the model**:
es: **Simplifica el modelo**:

source: Reduce number of parameters.
es: Reducir el número de parámetros.

source: Remove unnecessary complexity.
es: Elimine la complejidad innecesaria.

source: Problem: Low R² Value (Poor Fit)
es: Problema: valor R² bajo (mal ajuste)

source: Wrong equation type for data.
es: Tipo de ecuación incorrecto para los datos.

source: Noisy data.
es: Datos ruidosos.

source: Outliers present.
es: Valores atípicos presentes.

source: Insufficient data points.
es: Puntos de datos insuficientes.

source: **Try different equations**:
es: **Pruebe diferentes ecuaciones**:

source: Use Checker or Total Fitting mode.
es: Utilice el modo Comprobador o Ajuste total.

source: Compare R² values across equations.
es: Compare los valores de R² entre ecuaciones.

source: **Clean data**:
es: **Datos limpios**:

source: Use Loop mode to iteratively remove outliers.
es: Utilice el modo Bucle para eliminar de forma iterativa los valores atípicos.

source: Filter data before fitting.
es: Filtrar datos antes de realizar el ajuste.

source: **Check for systematic issues**:
es: **Compruebe si hay problemas sistemáticos**:

source: Is there a trend the equation doesn't capture?
es: ¿Existe alguna tendencia que la ecuación no captura?

source: Are there periodic components?
es: ¿Hay componentes periódicos?

source: Is data actually stochastic?
es: ¿Son los datos realmente estocásticos?

source: Problem: Parameters Have Huge Uncertainties
es: Problema: los parámetros tienen enormes incertidumbres

source: Poorly conditioned problem.
es: Problema mal condicionado.

source: Parameters are correlated.
es: Los parámetros están correlacionados.

source: Not enough data to constrain parameters.
es: No hay suficientes datos para restringir los parámetros.

source: Wrong equation type.
es: Tipo de ecuación incorrecto.

source: **Collect more data**: More points reduce uncertainties.
es: **Recopile más datos**: más puntos reducen las incertidumbres.

source: **Extend data range**: Cover wider range of X values.
es: **Ampliar rango de datos**: cubre un rango más amplio de valores X.

source: **Reduce parameters**: Simpler model may be better.
es: **Reducir parámetros**: un modelo más simple puede ser mejor.

source: **Fix some parameters**: If you know certain values, fix them.
es: **Corregir algunos parámetros**: Si conoce ciertos valores, corríjalos.

source: Plotting Issues
es: Problemas de trazado

source: Problem: Plot Window is Blank
es: Problema: la ventana de trazado está en blanco

source: Check output directory exists and is writable.
es: Compruebe que el directorio de salida exista y se pueda escribir.

source: Verify matplotlib is installed: `pip install matplotlib`.
es: Verifique que matplotlib esté instalado: `pip install matplotlib`.

source: Check logs for error messages: `regressionlab.log`.
es: Verifique los registros en busca de mensajes de error: `regressionlab.log`.

source: Try recreating virtual environment.
es: Intente recrear el entorno virtual.

source: Problem: Plot Quality is Poor
es: Problema: la calidad de la trama es mala

source: Increase DPI in `.env`:
es: Aumentar DPI en `.env`:

source: Adjust figure size:
es: Ajustar el tamaño de la figura:

source: Modify font sizes in `.env`.
es: Modifique los tamaños de fuente en `.env`.

source: Problem: Error Bars Don't Appear
es: Problema: las barras de error no aparecen

source: Verify uncertainty columns exist and are named correctly.
es: Verifique que las columnas de incertidumbre existan y tengan el nombre correcto.

source: Check uncertainties are non-zero.
es: Las incertidumbres de comprobación son distintas de cero.

source: Ensure uncertainties are numeric (not strings).
es: Asegúrese de que las incertidumbres sean numéricas (no cadenas).

source: Try with test data to isolate issue.
es: Pruebe con datos de prueba para aislar el problema.

source: UI Issues (Tkinter)
es: Problemas de interfaz de usuario (Tkinter)

source: Problem: Dialogs Don't Appear
es: Problema: los cuadros de diálogo no aparecen

source: Check if dialog is behind main window (Alt+Tab).
es: Compruebe si el diálogo está detrás de la ventana principal (Alt+Tab).

source: Look in taskbar for new windows.
es: Busque en la barra de tareas nuevas ventanas.

source: Disable "Always on top" if using other applications.
es: Desactive "Siempre visible" si utiliza otras aplicaciones.

source: Restart application.
es: Reinicie la aplicación.

source: Problem: Buttons/Text Too Small or Large
es: Problema: botones/texto demasiado pequeños o grandes

source: **Solution**: Edit `.env` file:
es: **Solución**: Editar el archivo `.env`:

source: Problem: Colors Are Unreadable
es: Problema: los colores son ilegibles

source: **Solution**: Reset to default theme:
es: **Solución**: Restablecer el tema predeterminado:

source: Copy `.env.example` to `.env`
es: Copie `.env.example` a `.env`

source: Or manually set high-contrast colors:
es: O configure manualmente colores de alto contraste:

source: Streamlit Issues
es: Problemas de Streamlit

source: Problem: Upload Fails Silently
es: Problema: la carga falla silenciosamente

source: Check file size (< 200 MB for online version).
es: Verifique el tamaño del archivo (< 200 MB para la versión en línea).

source: Verify file format (CSV, XLSX, TXT).
es: Verifique el formato del archivo (CSV, XLSX, TXT).

source: Clear browser cache and retry.
es: Borre la memoria caché del navegador y vuelva a intentarlo.

source: Try different browser.
es: Pruebe con un navegador diferente.

source: Check browser console for JavaScript errors (F12).
es: Verifique la consola del navegador para ver si hay errores de JavaScript (F12).

source: Problem: Results Disappear After Refresh
es: Problema: los resultados desaparecen después de la actualización

source: This is expected behavior - Streamlit doesn't persist results.
es: Este es el comportamiento esperado: Streamlit no conserva los resultados.

source: Download plots before refreshing.
es: Descargue los gráficos antes de actualizar.

source: Use Tkinter version if persistence needed.
es: Utilice la versión Tkinter si necesita persistencia.

source: Problem: App is Slow/Unresponsive
es: Problema: la aplicación es lenta o no responde

source: Close other tabs to free memory.
es: Cierra otras pestañas para liberar memoria.

source: Use local version for better performance.
es: Utilice la versión local para un mejor rendimiento.

source: Reduce dataset size.
es: Reducir el tamaño del conjunto de datos.

source: Avoid Total Fitting mode for large datasets.
es: Evite el modo de ajuste total para conjuntos de datos grandes.

source: Android / Mobile Platforms
es: Android/plataformas móviles

source: Status: Not Supported (Attempted)
es: Estado: No admitido (intento)

source: An Android installer has been attempted using **Termux** (terminal emulator) and **Termux:X11** for the graphical interface. This approach has not been successful.
es: Se ha intentado instalar un Android usando **Termux** (emulador de terminal) y **Termux:X11** para la interfaz gráfica. Este enfoque no ha tenido éxito.

source: **Main obstacle**: Installing dependencies reliably, especially **scipy**. The standard `pip install -r requirements.txt` fails in Termux due to compilation and compatibility issues with the ARM architecture and Termux's environment.
es: **Obstáculo principal**: instalar dependencias de manera confiable, especialmente **scipy**. El estándar `pip install -r requisitos.txt` falla en Termux debido a problemas de compilación y compatibilidad con la arquitectura ARM y el entorno de Termux.

source: **Alternative that works (manual only)**: **Pydroid 3** allows running the application by installing each library manually with the appropriate options. However, Pydroid 3 does not support automated installation scripts, so a one-click or scripted installer is not feasible.
es: **Alternativa que funciona (solo manual)**: **Pydroid 3** permite ejecutar la aplicación instalando cada biblioteca manualmente con las opciones apropiadas. Sin embargo, Pydroid 3 no admite scripts de instalación automatizados, por lo que no es factible un instalador con un solo clic o con script.

source: **Summary**:
es: **Resumen**:

source: **Termux + Termux:X11**: Library installation (scipy in particular) fails; no working solution found.
es: **Termux + Termux:X11**: La instalación de la biblioteca (scipy en particular) falla; no se encontró ninguna solución funcional.

source: **Pydroid 3**: Works with manual per-library installation, but cannot be automated. Android support remains a long-term goal; contributions or solutions to the dependency installation problem are welcome. If you want to see the best point I reached, check the `scripts/install_termux.sh` and `scripts/setup_termux.sh` files.
es: **Pydroid 3**: funciona con instalación manual por biblioteca, pero no se puede automatizar. La compatibilidad con Android sigue siendo un objetivo a largo plazo; Se aceptan aportes o soluciones al problema de instalación de dependencias. Si desea ver el mejor punto al que llegué, consulte los archivos `scripts/install_termux.sh` y `scripts/setup_termux.sh`.

source: Debugging Tips
es: Consejos de depuración

source: Enable Debug Logging
es: Habilitar el registro de depuración

source: Edit `.env`:
es: Editar `.env`:

source: View logs:
es: Ver registros:

source: Check Python Environment
es: Comprobar el entorno Python

source: Isolate the Problem
es: Aislar el problema

source: **Test with sample data**: Use files in `input/` folder.
es: **Prueba con datos de muestra**: use archivos en la carpeta `input/`.

source: **Test different modes**: Does issue occur in all modes?
es: **Pruebe diferentes modos**: ¿Se produce el problema en todos los modos?

source: **Test both interfaces**: Try Tkinter AND Streamlit.
es: **Pruebe ambas interfaces**: Pruebe Tkinter Y Streamlit.

source: **Minimal example**: Create simplest case that reproduces issue.
es: **Ejemplo mínimo**: cree el caso más simple que reproduzca el problema.

source: Report a Bug
es: Informar un error

source: If you can't solve the issue, please report it on GitHub with:
es: Si no puede resolver el problema, infórmelo en GitHub con:

source: **Version**: Check version in main menu or `config` (e.g. `config/constants.py`).
es: **Versión**: Verifique la versión en el menú principal o `config` (por ejemplo, `config/constants.py`).

source: **Operating System**: Windows, macOS, or Linux (with version).
es: **Sistema Operativo**: Windows, macOS o Linux (con versión).

source: **Python Version**: Output of `python --version`.
es: **Versión de Python**: Salida de `python --version`.

source: **Steps to Reproduce**: Exact steps to trigger the issue.
es: **Pasos para reproducir**: pasos exactos para desencadenar el problema.

source: **Expected Behavior**: What should happen.
es: **Comportamiento esperado**: Qué debería suceder.

source: **Actual Behavior**: What actually happens.
es: **Comportamiento real**: Lo que realmente sucede.

source: **Error Messages**: Full error message and traceback.
es: **Mensajes de error**: mensaje de error completo y rastreo.

source: **Logs**: Relevant portions of `regressionlab.log`.
es: **Registros**: partes relevantes de `regressionlab.log`.

source: **Screenshots**: If UI-related.
es: **Capturas de pantalla**: si están relacionadas con la interfaz de usuario.

source: **Sample Data**: If possible, include data file that triggers issue.
es: **Datos de muestra**: si es posible, incluya el archivo de datos que desencadena el problema.

source: Future Updates and Roadmap
es: Actualizaciones futuras y hoja de ruta

source: Long-Term Goals (2027+)
es: Metas a largo plazo (2027+)

source: **Under Consideration**:
es: **Está siendo considerado**:

source: Time-series analysis tools.
es: Herramientas de análisis de series temporales.

source: Machine learning models (SVM, Random Forest, Neural Networks).
es: Modelos de aprendizaje automático (SVM, Random Forest, Neural Networks).

source: Bayesian regression and uncertainty quantification.
es: Regresión bayesiana y cuantificación de la incertidumbre.

source: Automated model selection and comparison tools.
es: Herramientas automatizadas de selección y comparación de modelos.

source: How to Request Features
es: Cómo solicitar funciones

source: **Check existing issues**: Avoid duplicates.
es: **Verifique los problemas existentes**: evite duplicados.

source: **Open GitHub issue**: Use "Feature Request" template.
es: **Abrir problema de GitHub**: utilice la plantilla "Solicitud de función".

source: **Describe use case**: Why is this feature needed?
es: **Describa el caso de uso**: ¿Por qué se necesita esta función?

source: **Provide examples**: Show what you want to achieve.
es: **Proporcione ejemplos**: muestre lo que desea lograr.

source: **Be patient**: We're a one person team!
es: **Ten paciencia**: ¡Somos un equipo de una sola persona!

source: Optimization Tips
es: Consejos de optimización

source: For Faster Fitting
es: Para un ajuste más rápido

source: **Use compiled Python**: Try PyPy for pure Python code.
es: **Utilice Python compilado**: pruebe PyPy para obtener código Python puro.

source: **Reduce plot resolution**: Lower DPI for faster rendering.
es: **Reducir la resolución de la trama**: Baje los DPI para una representación más rápida.

source: **Disable logging**: Set `LOG_LEVEL=WARNING` in production.
es: **Deshabilitar el registro**: establezca `LOG_LEVEL=WARNING` en producción.

source: **Use local version**: Avoid network latency.
es: **Utilice la versión local**: evite la latencia de la red.

source: **Close result windows**: Free memory between fits.
es: **Cerrar ventanas de resultados**: Libera memoria entre ajustes.

source: For Better Accuracy
es: Para una mejor precisión

source: **Provide uncertainties**: Weighted fitting is more accurate.
es: **Proporcione incertidumbres**: el ajuste ponderado es más preciso.

source: **Use appropriate equation**: Don't over-complicate.
es: **Utilice la ecuación adecuada**: No complique demasiado.

source: **Collect more data**: More points = better parameter estimates.
es: **Recopile más datos**: Más puntos = mejores estimaciones de parámetros.

source: **Extend data range**: Cover full range of interest.
es: **Ampliar el rango de datos**: cubre el rango completo de intereses.

source: Getting Help
es: Obtener ayuda

source: Resources
es: Recursos

source: **Documentation**: Start here!
es: **Documentación**: ¡Empieza aquí!

source: [User Guide](usage.md).
es: [Guía del usuario](usage.md).

source: [Configuration Guide](configuration.md).
es: [Guía de configuración](configuration.md).

source: [API Documentation](api/index).
es: [Documentación API](api/índice).

source: **Examples**: Check `input/` folder for sample datasets.
es: **Ejemplos**: consulte la carpeta `input/` para ver conjuntos de datos de muestra.

source: [Issues](https://github.com/DOKOS-TAYOS/RegressionLab/issues): Report bugs.
es: [Problemas](https://github.com/DOKOS-TAYOS/RegressionLab/issues): Informar errores.

source: [Discussions](https://github.com/DOKOS-TAYOS/RegressionLab/discussions): Ask questions.
es: [Discusiones](https://github.com/DOKOS-TAYOS/RegressionLab/discussions): Haga preguntas.

source: **Community**:
es: **Comunidad**:

source: Share your analyses.
es: Comparte tus análisis.

source: Contribute code.
es: Código de contribución.

source: Improve documentation.
es: Mejorar la documentación.

source: Contact
es: Contacto

source: **Email**: alejandro.mata.ali@gmail.com.
es: **Correo electrónico**: alejandro.mata.ali@gmail.com.

source: **GitHub**: Open an issue for bugs/features.
es: **GitHub**: abre un problema para errores/características.

source: *Document last updated: February 2026.* *If you solved a problem not listed here, please contribute by opening a pull request!*
es: *Última actualización del documento: febrero de 2026.* *Si resolvió un problema que no figura aquí, ¡contribuya abriendo una solicitud de extracción!*
