Repository: DOKOS-TAYOS/RegressionLab
Catalog: sphinx-docs/locale/*/LC_MESSAGES/usage.po
Languages: es

source: User Guide
es: Guía del usuario

source: This guide explains how to use RegressionLab to fit curves to your data. Whether you're using the web version or the desktop version, this guide will help you get started.
es: Esta guía explica cómo utilizar RegressionLab para ajustar curvas a sus datos. Ya sea que esté utilizando la versión web o la versión de escritorio, esta guía lo ayudará a comenzar.

source: Overview
es: Descripción general

source: RegressionLab provides two interfaces for curve fitting:
es: RegressionLab proporciona dos interfaces para el ajuste de curvas:

source: **Web Version (Streamlit)**: Browser-based, easy to use, accessible from anywhere. The sidebar lets you choose language and operation mode; the main area handles file upload, variable and equation selection, and results. Configuration is done by editing the `.env` file (no in-app config dialog).
es: **Versión web (Streamlit)**: basada en navegador, fácil de usar, accesible desde cualquier lugar. La barra lateral te permite elegir el idioma y el modo de operación; el área principal maneja la carga de archivos, la selección de variables y ecuaciones, y los resultados. La configuración se realiza editando el archivo `.env` (sin cuadro de diálogo de configuración en la aplicación).

source: **Desktop Version (Tkinter)**: Native application with full features and advanced options. The main menu offers mode buttons (Normal Fitting, Multiple Datasets, Checker Fitting, Total Fitting, Watch Data), **Information** (help with collapsible sections and optional Donations link), **Configure** (edit .env options in a dialog; saving restarts the app), and Exit.
es: **Versión de escritorio (Tkinter)**: Aplicación nativa con funciones completas y opciones avanzadas. El menú principal ofrece botones de modo (Ajuste normal, Conjuntos de datos múltiples, Ajuste del verificador, Ajuste total, Datos de observación), **Información** (ayuda con secciones plegables y enlace de donaciones opcional), **Configurar** (editar las opciones de .env en un cuadro de diálogo; al guardar se reinicia la aplicación) y Salir.

source: Both versions share the same core functionality but have different user interfaces optimized for their platform.
es: Ambas versiones comparten la misma funcionalidad principal pero tienen diferentes interfaces de usuario optimizadas para su plataforma.

source: Choosing Your Version
es: Elegir tu versión

source: Use the Web Version (Streamlit) if:
es: Utilice la versión web (Streamlit) si:

source: You want quick access without installation.
es: Quieres un acceso rápido sin instalación.

source: You're working from different computers.
es: Estás trabajando desde diferentes computadoras.

source: You prefer a modern, streamlined interface.
es: Prefiere una interfaz moderna y optimizada.

source: You're new to curve fitting.
es: Eres nuevo en el ajuste de curvas.

source: You need to share the tool with others easily.
es: Necesita compartir la herramienta con otras personas fácilmente.

source: Use the Desktop Version (Tkinter) if:
es: Utilice la versión de escritorio (Tkinter) si:

source: You need offline access.
es: Necesitas acceso sin conexión.

source: You want faster performance with large datasets.
es: Quiere un rendimiento más rápido con grandes conjuntos de datos.

source: You prefer a traditional desktop application.
es: Prefieres una aplicación de escritorio tradicional.

source: You need advanced customization options.
es: Necesita opciones de personalización avanzadas.

source: You're working with sensitive data that can't be uploaded.
es: Estás trabajando con datos confidenciales que no se pueden cargar.

source: Getting Started
es: Empezando

source: Web Version (Streamlit)
es: Versión web (transmitida)

source: Option 1: Online (Recommended for Quick Start)
es: Opción 1: en línea (recomendado para inicio rápido)

source: **Access the Application**
es: **Accede a la Aplicación**

source: Open your web browser.
es: Abra su navegador web.

source: Navigate to: [https://regressionlab.streamlit.app/](https://regressionlab.streamlit.app/).
es: Navegue a: [https://regressionlab.streamlit.app/](https://regressionlab.streamlit.app/).

source: If the app is sleeping, click "Start" and wait a moment for it to wake up.
es: Si la aplicación está inactiva, haga clic en "Iniciar" y espere un momento hasta que se active.

source: **Upload Your Data** (or choose "View Data" in the sidebar to inspect, transform, clean, and download data without fitting)
es: **Cargue sus datos** (o elija "Ver datos" en la barra lateral para inspeccionar, transformar, limpiar y descargar datos sin ajustarlos)

source: Click "Browse files" or drag and drop your file.
es: Haga clic en "Buscar archivos" o arrastre y suelte su archivo.

source: Supported formats: CSV, XLSX, TXT.
es: Formatos soportados: CSV, XLSX, TXT.

source: **Select Variables and Equation**
es: **Seleccione variables y ecuación**

source: Choose your X (independent) variable.
es: Elija su variable X (independiente).

source: Choose your Y (dependent) variable.
es: Elija su variable Y (dependiente).

source: Select the equation type to fit.
es: Seleccione el tipo de ecuación que desee ajustar.

source: In Normal Fitting you can enable "loop fitting" to fit another file with the same equation later.
es: En Ajuste normal puede habilitar el "ajuste de bucle" para ajustar otro archivo con la misma ecuación más adelante.

source: **Run the Fitting**
es: **Ejecutar la adaptación**

source: Click the fitting button.
es: Haga clic en el botón de adaptación.

source: Results show in three columns (Equation, Parameters, Statistics), then the plot, then the download button.
es: Los resultados se muestran en tres columnas (Ecuación, Parámetros, Estadísticas), luego el gráfico y luego el botón de descarga.

source: Download the plot (PNG/JPG or PDF if configured; when PDF is used, the in-app preview is PNG).
es: Descargue el trazado (PNG/JPG o PDF si está configurado; cuando se usa PDF, la vista previa en la aplicación es PNG).

source: Option 2: Local Streamlit
es: Opción 2: Streamlit local

source: If you've installed RegressionLab locally, you can run Streamlit on your machine:
es: Si ha instalado RegressionLab localmente, puede ejecutar Streamlit en su máquina:

source: **Direct Command:**
es: **Comando directo:**

source: The application will open in your default browser, usually at `http://localhost:8501`.
es: La aplicación se abrirá en su navegador predeterminado, generalmente en `http://localhost:8501`.

source: Desktop Version (Tkinter)
es: Versión de escritorio (Tkinter)

source: Launching the Application
es: Lanzando la aplicación

source: **Method 1: Desktop Shortcut**
es: **Método 1: acceso directo al escritorio**

source: Double-click the "RegressionLab" shortcut created during installation
es: Haga doble clic en el acceso directo "RegressionLab" creado durante la instalación

source: ![Desktop Shortcut](../images/en_documentation/tkinter_docs/shortcut.png)
es: ![Atajo de escritorio](../images/es_documentation/tkinter_docs/shortcut.png)

source: Desktop Shortcut
es: Acceso directo al escritorio

source: **Method 2: Shell Scripts**
es: **Método 2: scripts de Shell**

source: Windows:
es: Ventanas:

source: **Method 3: Direct Execution**
es: **Método 3: Ejecución directa**

source: Operation Modes
es: Modos de operación

source: RegressionLab offers four different operation modes to match your workflow. Each mode is designed for specific use cases.
es: RegressionLab ofrece cuatro modos de operación diferentes para adaptarse a su flujo de trabajo. Cada modo está diseñado para casos de uso específicos.

source: 1. Normal Fitting
es: 1. Ajuste normal

source: **Use when**: You want to fit one equation to one dataset.
es: **Úselo cuando**: desee ajustar una ecuación a un conjunto de datos.

source: **How it works**:
es: **Cómo funciona**:

source: Select an equation type (or define a custom formula). ![Equation Selection](../images/en_documentation/tkinter_docs/equation.png)
es: Seleccione un tipo de ecuación (o defina una fórmula personalizada). ![Selección de ecuación](../images/es_documentation/tkinter_docs/equation.png)

source: Choose whether to enable loop mode.
es: Elija si desea habilitar el modo de bucle.

source: Load your data file.
es: Cargue su archivo de datos.

source: Results Window
es: Ventana de resultados

source: **Loop Mode**:
es: **Modo de bucle**:

source: Allows you to modify the data file and refit without restarting.
es: Le permite modificar el archivo de datos y volver a colocarlo sin reiniciar.

source: Useful for iterative data cleaning or exploring different data subsets.
es: Útil para la limpieza de datos iterativos o la exploración de diferentes subconjuntos de datos.

source: After each fit, you can edit the file and reload it.
es: Después de cada ajuste, puedes editar el archivo y recargarlo.

source: **Example workflow**:
es: **Ejemplo de flujo de trabajo**:

source: 2. Multiple Datasets (Single Fit Multiple Datasets)
es: 2. Múltiples conjuntos de datos (conjuntos de datos múltiples de ajuste único)

source: **Use when**: You want to apply the same equation to multiple different datasets.
es: **Úselo cuando**: desee aplicar la misma ecuación a varios conjuntos de datos diferentes.

source: Select an equation type once.
es: Seleccione un tipo de ecuación una vez.

source: Specify how many datasets you want to fit.
es: Especifique cuántos conjuntos de datos desea ajustar.

source: Load each dataset one by one.
es: Cargue cada conjunto de datos uno por uno.

source: Choose variables for each dataset.
es: Elija variables para cada conjunto de datos.

source: All fits are performed and results displayed.
es: Se realizan todos los ajustes y se muestran los resultados.

source: **Example use case**:
es: **Caso de uso de ejemplo**:

source: Fitting the same calibration curve to data from different instruments.
es: Ajustar la misma curva de calibración a datos de diferentes instrumentos.

source: Analyzing similar experiments performed on different days.
es: Analizar experimentos similares realizados en días diferentes.

source: Comparing the same relationship across different samples.
es: Comparar la misma relación en diferentes muestras.

source: 3. Checker Fitting (Multiple Fits Single Dataset)
es: 3. Ajuste corrector (conjunto de datos único de ajustes múltiples)

source: **Use when**: You want to try multiple equations on the same dataset to find the best fit.
es: **Úselo cuando**: desea probar varias ecuaciones en el mismo conjunto de datos para encontrar el mejor ajuste.

source: Load your dataset once.
es: Cargue su conjunto de datos una vez.

source: Select variables once.
es: Seleccione las variables una vez.

source: Choose multiple equation types to test.
es: Elija varios tipos de ecuaciones para probar.

source: All selected equations are fitted sequentially.
es: Todas las ecuaciones seleccionadas se ajustan secuencialmente.

source: Compare results to find the best model.
es: Compare los resultados para encontrar el mejor modelo.

source: Exploratory data analysis when you're not sure which model fits best.
es: Análisis de datos exploratorios cuando no está seguro de qué modelo se ajusta mejor.

source: Model selection based on R² values.
es: Selección de modelo basada en valores R².

source: Understanding which mathematical relationships might describe your data.
es: Comprender qué relaciones matemáticas podrían describir sus datos.

source: 4. Total Fitting (All Fits Single Dataset)
es: 4. Ajuste total (todo se ajusta a un solo conjunto de datos)

source: **Use when**: You want to automatically try ALL available equations on your dataset.
es: **Úselo cuando**: desea probar automáticamente TODAS las ecuaciones disponibles en su conjunto de datos.

source: Load your dataset.
es: Cargue su conjunto de datos.

source: Select variables.
es: Seleccionar variables.

source: Click "Total Fitting".
es: Haga clic en "Ajuste total".

source: All predefined equations are fitted automatically.
es: Todas las ecuaciones predefinidas se ajustan automáticamente.

source: Review all results to find the best fit.
es: Revise todos los resultados para encontrar la mejor opción.

source: Comprehensive analysis when you have no prior model expectations.
es: Análisis completo cuando no tienes expectativas previas sobre el modelo.

source: Creating a complete fitting report.
es: Elaboración de un informe de adaptación completo.

source: Teaching/learning about different function types.
es: Enseñar/aprender sobre diferentes tipos de funciones.

source: Understanding Your Data Format
es: Comprender su formato de datos

source: RegressionLab expects data in a specific format for optimal results.
es: RegressionLab espera datos en un formato específico para obtener resultados óptimos.

source: Multidimensional Data
es: Datos multidimensionales

source: For regression with 2 or more independent variables (custom formulas with `num_independent_vars > 1`), your data must have columns for each variable. During variable selection you will pick multiple X columns (e.g. `temperature`, `pressure`) and one Y column. The fitting uses all selected X columns together.
es: Para la regresión con 2 o más variables independientes (fórmulas personalizadas con `num_independent_vars > 1`), sus datos deben tener columnas para cada variable. Durante la selección de variables, seleccionará varias columnas X (por ejemplo, "temperatura", "presión") y una columna Y. El ajuste utiliza todas las columnas X seleccionadas juntas.

source: Required Format
es: Formato requerido

source: Your data file should contain:
es: Su archivo de datos debe contener:

source: **Column headers**: Each column must have a name (e.g., "time", "voltage", "temperature"). You can use LaTeX with `$` for variable names (e.g. `$\alpha$`, `$\sigma$`) if you need Greek letters or other symbols.
es: **Encabezados de columna**: cada columna debe tener un nombre (por ejemplo, "tiempo", "voltaje", "temperatura"). Puede usar LaTeX con `$` para nombres de variables (por ejemplo, `$\alpha$`, `$\sigma$`) si necesita letras griegas u otros símbolos.

source: **Numeric data**: All data values should be numbers.
es: **Datos numéricos**: todos los valores de datos deben ser números.

source: **Consistent units**: Use the same units throughout each column.
es: **Unidades consistentes**: use las mismas unidades en cada columna.

source: Basic Example (CSV)
es: Ejemplo básico (CSV)

source: With Uncertainties
es: Con incertidumbres

source: RegressionLab automatically detects uncertainty columns if they follow the naming convention: `u<variablename>`
es: RegressionLab detecta automáticamente las columnas de incertidumbre si siguen la convención de nomenclatura: `u<nombredevariable>`

source: `utime`: Uncertainty in time measurements
es: `utime`: Incertidumbre en las mediciones del tiempo

source: `utemperature`: Uncertainty in temperature measurements
es: `utemperatura`: Incertidumbre en las mediciones de temperatura

source: **Rules for uncertainty columns**:
es: **Reglas para columnas de incertidumbre**:

source: Uncertainties must be non-negative.
es: Las incertidumbres no deben ser negativas.

source: If present, they will be used for weighted fitting.
es: Si están presentes, se utilizarán para ajuste ponderado.

source: They will be displayed as error bars in plots.
es: Se mostrarán como barras de error en los gráficos.

source: Supported File Formats
es: Formatos de archivo admitidos

source: **CSV** (`.csv`): Comma-separated values.
es: **CSV** (`.csv`): valores separados por comas.

source: Can use comma, semicolon, or tab as delimiters.
es: Puede utilizar coma, punto y coma o tabulador como delimitadores.

source: UTF-8 encoding recommended.
es: Se recomienda codificación UTF-8.

source: **Excel** (`.xlsx`): Microsoft Excel files.
es: **Excel** (`.xlsx`): archivos de Microsoft Excel.

source: Data should be in the first sheet.
es: Los datos deben estar en la primera hoja.

source: Column headers in the first row.
es: Encabezados de columna en la primera fila.

source: **TXT** (`.txt`): Tab-separated or space-separated text files.
es: **TXT** (`.txt`): archivos de texto separados por tabulaciones o espacios.

source: Plain text format.
es: Formato de texto plano.

source: Interpreting Results
es: Interpretación de resultados

source: When you perform a fit, RegressionLab displays a results window showing:
es: Cuando realiza un ajuste, RegressionLab muestra una ventana de resultados que muestra:

source: ![Results Window](../images/en_documentation/tkinter_docs/result.png)
es: ![Ventana de resultados](../images/es_documentation/tkinter_docs/result.png)

source: The results window contains:
es: La ventana de resultados contiene:

source: **Fitted equation**: The mathematical expression with your fitted parameters.
es: **Ecuación ajustada**: La expresión matemática con sus parámetros ajustados.

source: **Parameter values**: Each parameter with its uncertainty.
es: **Valores de los parámetros**: Cada parámetro con su incertidumbre.

source: **Statistical measures**: R², RMSE, χ², and reduced χ².
es: **Medidas estadísticas**: R², RMSE, χ² y χ² reducido.

source: **Plot preview**: Visual representation of your data and the fitted curve. For 2 independent variables: interactive 3D plot; for 3+ variables: residuals plot.
es: **Vista previa del trazado**: representación visual de sus datos y la curva ajustada. Para 2 variables independientes: gráfico 3D interactivo; para más de 3 variables: gráfico de residuos.

source: **Prediction button** (desktop): Opens a dialog to evaluate the fitted function at user-specified inputs, with uncertainty propagation when available.
es: **Botón de predicción** (escritorio): abre un cuadro de diálogo para evaluar la función ajustada en las entradas especificadas por el usuario, con propagación de la incertidumbre cuando esté disponible.

source: 1. Fitted Parameters
es: 1. Parámetros ajustados

source: The values of the parameters in your equation, with uncertainties:
es: Los valores de los parámetros en su ecuación, con incertidumbres:

source: 2. Equation
es: 2. Ecuación

source: The mathematical equation with your fitted parameters. Always x is the independent variable and y the dependent one.
es: La ecuación matemática con sus parámetros ajustados. Siempre x es la variable independiente e y la dependiente.

source: 3. Statistical Measures
es: 3. Medidas estadísticas

source: RegressionLab provides comprehensive statistical information about your fit:
es: RegressionLab proporciona información estadística completa sobre su ajuste:

source: R² (Coefficient of Determination)
es: R² (Coeficiente de Determinación)

source: A statistical measure of how well the fit matches the data:
es: Una medida estadística de qué tan bien el ajuste coincide con los datos:

source: Where $y_i$ = observed values, $\hat{y}_i$ = fitted values, $\bar{y}$ = mean of $y$.
es: Donde $y_i$ = valores observados, $\hat{y}_i$ = valores ajustados, $\bar{y}$ = media de $y$.

source: **R² = 1.0**: Perfect fit
es: **R² = 1,0**: Ajuste perfecto

source: **R² > 0.95**: Excellent fit
es: **R² > 0,95**: Ajuste excelente

source: **R² > 0.85**: Good fit
es: **R² > 0,85**: Buen ajuste

source: **R² > 0.70**: Acceptable fit
es: **R² > 0,70**: Ajuste aceptable

source: **R² < 0.70**: Poor fit - consider trying a different equation
es: **R² < 0,70**: Ajuste deficiente: considere probar con una ecuación diferente

source: RMSE (Root Mean Square Error)
es: RMSE (error cuadrático medio)

source: The average magnitude of residuals. Lower values indicate better fit; expressed in the same units as the dependent variable.
es: La magnitud promedio de los residuos. Los valores más bajos indican un mejor ajuste; expresado en las mismas unidades que la variable dependiente.

source: χ² (Chi-squared)
es: χ² (Chi-cuadrado)

source: Sum of squared residuals weighted by uncertainties. Lower values indicate better fit when uncertainties are well estimated. Only calculated when uncertainty data is available.
es: Suma de residuos al cuadrado ponderados por incertidumbres. Los valores más bajos indican un mejor ajuste cuando las incertidumbres están bien estimadas. Sólo se calcula cuando se dispone de datos de incertidumbre.

source: Where $\sigma_i$ = uncertainty (standard deviation) of the $i$-th measurement.
es: Donde $\sigma_i$ = incertidumbre (desviación estándar) de la $i$-ésima medición.

source: χ²_red (Reduced Chi-squared)
es: χ²_red (Chi-cuadrado reducido)

source: Chi-squared divided by degrees of freedom. A value close to 1 suggests uncertainties are consistent with the fit.
es: Chi cuadrado dividido por grados de libertad. Un valor cercano a 1 sugiere que las incertidumbres son consistentes con el ajuste.

source: \chi^2_{\mathrm{red}} = \frac{\chi^2}{\nu}
es: \chi^2_{\mathrm{rojo}} = \frac{\chi^2}{\nu}

source: ν (Degrees of Freedom)
es: ν (Grados de libertad)

source: Number of data points minus the number of fitted parameters. Used in statistical calculations and confidence intervals.
es: Número de puntos de datos menos el número de parámetros ajustados. Utilizado en cálculos estadísticos e intervalos de confianza.

source: Where $n$ = number of data points, $p$ = number of fitted parameters.
es: Donde $n$ = número de puntos de datos, $p$ = número de parámetros ajustados.

source: 95% Confidence Intervals (IC 95%)
es: Intervalos de confianza del 95% (IC 95%)

source: For each fitted parameter, the range within which the true value is expected with 95% confidence, calculated using the t-distribution. These intervals help assess the reliability of your parameter estimates.
es: Para cada parámetro ajustado, el rango dentro del cual se espera el valor real con un 95% de confianza, calculado utilizando la distribución t. Estos intervalos ayudan a evaluar la confiabilidad de las estimaciones de sus parámetros.

source: Where $\theta_k$ = estimated parameter, $\sigma_{\theta_k}$ = its standard error (from the fit covariance matrix), $t_{0.975,\,\nu}$ = critical value of the t-distribution for 97.5% (two-tailed 95%) with $\nu$ degrees of freedom.
es: Donde $\theta_k$ = parámetro estimado, $\sigma_{\theta_k}$ = su error estándar (de la matriz de covarianza de ajuste), $t_{0.975,\,\nu}$ = valor crítico de la distribución t para 97,5% (95% de dos colas) con $\nu$ grados de libertad.

source: 4. Plot
es: 4. Trama

source: A visualization showing:
es: Una visualización que muestra:

source: **Red points with error bars**: Your original data (error bars appear if uncertainties are provided).
es: **Puntos rojos con barras de error**: sus datos originales (las barras de error aparecen si se proporcionan incertidumbres).

source: **Black line**: The fitted curve.
es: **Línea negra**: La curva ajustada.

source: **Axis labels**: Your variable names.
es: **Etiquetas de eje**: los nombres de sus variables.

source: **Legend**: Equation and R² value.
es: **Leyenda**: Ecuación y valor R².

source: 5. Output File
es: 5. Archivo de salida

source: The plot is automatically saved as a PNG image (or JPG/PDF if configured) in the output directory (default: `output/`).
es: El trazado se guarda automáticamente como una imagen PNG (o JPG/PDF si está configurado) en el directorio de salida (predeterminado: `salida/`).

source: Tips for Better Results
es: Consejos para obtener mejores resultados

source: Data Quality
es: Calidad de datos

source: **Remove outliers**: Outliers can significantly affect the fit. Use loop mode to iteratively remove them.
es: **Eliminar valores atípicos**: los valores atípicos pueden afectar significativamente el ajuste. Utilice el modo de bucle para eliminarlos de forma iterativa.
