Repository: DOKOS-TAYOS/RegressionLab
Catalog: sphinx-docs/locale/*/LC_MESSAGES/usage.po
Languages: es

source: **Check data range**: Ensure your data covers the range of interest. Extrapolation beyond your data range can be unreliable.
es: **Verifique el rango de datos**: asegúrese de que sus datos cubran el rango de interés. La extrapolación más allá de su rango de datos puede no ser confiable.

source: **Use uncertainties**: If you have measurement uncertainties, include them. This provides more accurate parameter estimates.
es: **Utilice incertidumbres**: si tiene incertidumbres de medición, inclúyalas. Esto proporciona estimaciones de parámetros más precisas.

source: **Sufficient data points**: More data points generally give better fits. Aim for at least 10-20 points for simple equations.
es: **Puntos de datos suficientes**: más puntos de datos generalmente dan mejores ajustes. Apunte a obtener al menos entre 10 y 20 puntos para ecuaciones simples.

source: Choosing Equations
es: Elegir ecuaciones

source: **Physical basis**: If you know the underlying physics/chemistry, choose an equation that matches the theory.
es: **Base física**: si conoces la física/química subyacente, elige una ecuación que coincida con la teoría.

source: **Visual inspection**: Plot your data first to get an idea of the shape (linear, curved, oscillating, etc.).
es: **Inspección visual**: Primero, trace sus datos para tener una idea de la forma (lineal, curva, oscilante, etc.).

source: **Start simple**: Try simpler equations (linear, quadratic) before complex ones.
es: **Empiece de forma sencilla**: pruebe con ecuaciones más simples (lineales, cuadráticas) antes que con las complejas.

source: **Compare R² values**: When testing multiple equations, the one with the highest R² generally fits best.
es: **Comparar valores de R²**: cuando se prueban varias ecuaciones, la que tiene el R² más alto generalmente se ajusta mejor.

source: **Be cautious of overfitting**: A complex equation with many parameters might fit better but may not generalize well.
es: **Tenga cuidado con el sobreajuste**: una ecuación compleja con muchos parámetros podría ajustarse mejor, pero no generalizarse bien.

source: Custom Formulas
es: Fórmulas personalizadas

source: If none of the predefined equations work, you can define your own:
es: Si ninguna de las ecuaciones predefinidas funciona, puedes definir la tuya propia:

source: Select "Custom Formula" as the equation type.
es: Seleccione "Fórmula personalizada" como tipo de ecuación.

source: Specify the number of parameters.
es: Especifique el número de parámetros.

source: Specify the number of independent variables (1 for standard y=f(x), 2+ for multidimensional regression).
es: Especifique el número de variables independientes (1 para estándar y=f(x), 2+ para regresión multidimensional).

source: Name your parameters (e.g., `a`, `b`, `c`). You can also use special characters.
es: Asigne un nombre a sus parámetros (por ejemplo, `a`, `b`, `c`). También puedes utilizar caracteres especiales.

source: Enter your formula using Python syntax.
es: Ingrese su fórmula usando la sintaxis de Python.

source: `a*x**2 + b*x + c` (quadratic, 1 variable).
es: `a*x**2 + b*x + c` (cuadrático, 1 variable).

source: `a*np.exp(-b*x)` (exponential decay).
es: `a*np.exp(-b*x)` (decaimiento exponencial).

source: `a/(1 + b*x)` (hyperbola).
es: `a/(1 + b*x)` (hipérbola).

source: Prediction Window (Desktop)
es: Ventana de predicción (escritorio)

source: After fitting, the result window shows a **Prediction** button. Click it to open a dialog where you can:
es: Después del ajuste, la ventana de resultados muestra un botón **Predicción**. Haga clic en él para abrir un cuadro de diálogo donde podrá:

source: Enter values for each independent variable (x, x_0, x_1, etc.).
es: Ingrese valores para cada variable independiente (x, x_0, x_1, etc.).

source: See the predicted y value updated in real time.
es: Vea el valor y previsto actualizado en tiempo real.

source: When parameter covariance is available, the predicted uncertainty is shown as well.
es: Cuando la covarianza del parámetro está disponible, también se muestra la incertidumbre prevista.

source: This works for single fits, multiple datasets, checker mode, and total fitting. It supports both 1D and multidimensional fits.
es: Esto funciona para ajustes únicos, múltiples conjuntos de datos, modo verificador y ajuste total. Admite ajustes tanto 1D como multidimensionales.

source: Common Workflows
es: Flujos de trabajo comunes

source: Workflow 1: Quick Analysis
es: Flujo de trabajo 1: análisis rápido

source: Workflow 2: Finding the Best Model
es: Flujo de trabajo 2: encontrar el mejor modelo

source: Workflow 3: Batch Processing
es: Flujo de trabajo 3: procesamiento por lotes

source: Workflow 4: Iterative Refinement
es: Flujo de trabajo 4: refinamiento iterativo

source: Next Steps
es: Próximos pasos

source: Now that you understand the basics:
es: Ahora que comprende los conceptos básicos:

source: **Streamlit Guide**: For detailed information on the web interface, see [Streamlit Guide](streamlit-guide.md).
es: **Guía Streamlit**: Para obtener información detallada sobre la interfaz web, consulte [Guía Streamlit](streamlit-guide.md).

source: **Tkinter Guide**: For detailed information on the desktop interface, see [Tkinter Guide](tkinter-guide.md).
es: **Guía de Tkinter**: Para obtener información detallada sobre la interfaz de escritorio, consulte la [Guía de Tkinter](tkinter-guide.md).

source: **Configuration**: Customize appearance and behavior in the [Configuration Guide](configuration.md).
es: **Configuración**: personalice la apariencia y el comportamiento en la [Guía de configuración] (configuration.md).

source: **Advanced Usage**: Learn how to add custom functions in [Extending RegressionLab](extending.md).
es: **Uso avanzado**: aprenda cómo agregar funciones personalizadas en [Extending RegressionLab] (extending.md).

source: *Need help? Check the [Troubleshooting Guide](troubleshooting.md) for common issues and solutions.*
es: *¿Necesitar ayuda? Consulte la [Guía de solución de problemas] (troubleshooting.md) para conocer problemas y soluciones comunes.*
