Repository: DOKOS-TAYOS/RegressionLab
Catalog: sphinx-docs/locale/*/LC_MESSAGES/api/index.po
Languages: es

source: API Documentation
es: Documentación de la API

source: This section provides technical documentation for RegressionLab's Python API. It's intended for developers who want to understand the codebase, contribute to the project, or integrate RegressionLab into their own applications.
es: Esta sección proporciona documentación técnica para la API Python de RegressionLab. Está destinado a desarrolladores que desean comprender el código base, contribuir al proyecto o integrar RegressionLab en sus propias aplicaciones.

source: Architecture Overview
es: Resumen de la arquitectura

source: RegressionLab follows a modular architecture with clear separation of concerns:
es: RegressionLab sigue una arquitectura modular con una clara separación de preocupaciones:

source: Module Reference
es: Referencia de módulos

source: Core Modules
es: Módulos principales

source: **[config](config.md)** - Configuration management and application constants
es: **[config](config.md)** - Gestión de configuración y constantes de aplicación

source: **[i18n](i18n.md)** - Internationalization and translation system
es: **[i18n](i18n.md)** - Sistema de internacionalización y traducción

source: Fitting Modules
es: Módulos de ajuste

source: **[fitting.fitting_functions](fitting_functions.md)** - Mathematical functions and curve fitting implementations
es: **[fitting.fitting_functions](fitting_functions.md)** - Funciones matemáticas e implementaciones de ajuste de curvas

source: **[fitting.fitting_utils](fitting_utils.md)** - Generic fitting utilities and helpers
es: **[fitting.fitting_utils](fitting_utils.md)** - Utilidades y ayudas de adaptación genéricas

source: **[fitting.workflow_controller](workflow_controller.md)** - Orchestrates fitting workflows and modes
es: **[fitting.workflow_controller](workflow_controller.md)** - Orquesta modos y flujos de trabajo adecuados

source: **[fitting.custom_function_evaluator](custom_function_evaluator.md)** - Evaluates user-defined custom formulas
es: **[fitting.custom_function_evaluator](custom_function_evaluator.md)** - Evalúa fórmulas personalizadas definidas por el usuario

source: **[fitting.estimators](estimators.md)** - Parameter estimation functions for initial guesses
es: **[fitting.estimators](estimators.md)** - Funciones de estimación de parámetros para conjeturas iniciales

source: Data Loading and Saving
es: Carga y guardado de datos

source: **[loaders.data_loader](data_loader.md)** - High-level data loading interface
es: **[loaders.data_loader](data_loader.md)** - Interfaz de carga de datos de alto nivel

source: **[loaders.loading_utils](loading_utils.md)** - CSV and Excel file readers
es: **[loaders.loading_utils](loading_utils.md)** - Lectores de archivos CSV y Excel

source: **[loaders.saving_utils](saving_utils.md)** - Save DataFrame to CSV, TXT, XLSX
es: **[loaders.saving_utils](saving_utils.md)** - Guardar DataFrame en CSV, TXT, XLSX

source: Data Analysis
es: Análisis de datos

source: **[data_analysis](data_analysis.md)** - Transforms (FFT, DCT, Hilbert, Laplace, cepstrum, Hadamard, log, exp, etc.) and cleaning (drop NaN, outliers, etc.). Used by the View Data window in Tkinter and Streamlit.
es: **[data_analysis](data_analysis.md)** - Transformaciones (FFT, DCT, Hilbert, Laplace, cepstrum, Hadamard, log, exp, etc.) y limpieza (eliminar NaN, valores atípicos, etc.). Usado por la ventana Ver datos en Tkinter y Streamlit.

source: Visualization
es: Visualización

source: **[plotting.plot_utils](plot_utils.md)** - Plot generation and styling (2D fit, pair, residual, 3D)
es: **[plotting.plot_utils](plot_utils.md)** - Generación y estilo de trazado (ajuste 2D, par, residual, 3D)

source: User Interface
es: Interfaz de usuario

source: **[frontend.ui_main_menu](ui_main_menu.md)** - Main menu and navigation (Tkinter)
es: **[frontend.ui_main_menu](ui_main_menu.md)** - Menú principal y navegación (Tkinter)

source: **[frontend.ui_dialogs](ui_dialogs.md)** - Dialog windows and user input (Tkinter)
es: **[frontend.ui_dialogs](ui_dialogs.md)** - Ventanas de diálogo y entrada del usuario (Tkinter)

source: **[frontend.image_utils](image_utils.md)** - Image loading and scaling utilities
es: **[frontend.image_utils](image_utils.md)** - Utilidades de carga y escalado de imágenes

source: **[frontend.keyboard_nav](keyboard_nav.md)** - Keyboard navigation utilities
es: **[frontend.keyboard_nav](keyboard_nav.md)** - Utilidades de navegación por teclado

source: **[streamlit_app.app](streamlit_app.md)** - Web interface (Streamlit)
es: **[streamlit_app.app](streamlit_app.md)** - Interfaz web (Streamlit)

source: Utilities
es: Utilidades

source: **[utils.exceptions](exceptions.md)** - Custom exception classes
es: **[utils.exceptions](exceptions.md)** - Clases de excepción personalizadas

source: **[utils.logger](logger.md)** - Logging configuration and utilities
es: **[utils.logger](logger.md)** - Configuración de registro y utilidades

source: **[utils.validators](validators.md)** - Data validation functions
es: **[utils.validators](validators.md)** - Funciones de validación de datos

source: Quick Start for Developers
es: Inicio rápido para desarrolladores

source: Setting Up Development Environment
es: Configuración del entorno de desarrollo

source: Running the Application
es: Ejecutar la aplicación

source: Code Style
es: Estilo de código

source: RegressionLab follows PEP 8 with these conventions:
es: RegressionLab sigue PEP 8 con estas convenciones:

source: **Line length**: 100 characters max
es: **Longitud de línea**: 100 caracteres máximo

source: **Docstrings**: Google style (use "Examples:" for example blocks)
es: **Docstrings**: estilo de Google (use "Ejemplos:" para bloques de ejemplo)

source: **Type hints**: Required for function signatures
es: **Sugerencias de tipo**: Requerido para firmas de funciones

source: **Imports**: Sorted alphabetically, grouped by standard/third-party/local. Cross-package imports use the package root (e.g. `from config import X`, `from loaders import Y`). Imports within the same package use full module paths (e.g. `from config.constants import Z`, `from loaders.loading_utils import csv_reader`) to avoid circular references
es: **Importaciones**: ordenados alfabéticamente, agrupados por estándar/de terceros/local. Las importaciones entre paquetes utilizan la raíz del paquete (por ejemplo, `desde la importación de configuración X`, `desde la importación de cargadores Y`). Las importaciones dentro del mismo paquete utilizan rutas de módulo completas (por ejemplo, `from config.constants import Z`, `from loaders.loading_utils import csv_reader`) para evitar referencias circulares

source: Example:
es: Ejemplo:

source: Common Development Tasks
es: Tareas comunes de desarrollo

source: Adding a New Fitting Function
es: Agregar una nueva función de adaptación

source: See [Extending RegressionLab](../extending.md) for detailed instructions.
es: Consulte [Extending RegressionLab](../extending.md) para obtener instrucciones detalladas.

source: Quick summary:
es: Resumen rápido:

source: Add mathematical function in `fitting/functions/` (e.g. `polynomials.py`, `special.py`)
es: Agregue una función matemática en `fitting/functions/` (por ejemplo, `polynomials.py`, `special.py`)

source: Create fitting wrapper function
es: Crear función contenedora adecuada

source: Export the fit function from `src/fitting/functions/__init__.py`, then register in `config/equations.yaml` (add entry with `function`, `formula`, `format`, `param_names`) and add translations in `src/locales/`
es: Exporte la función de ajuste desde `src/fitting/functions/__init__.py`, luego regístrela en `config/equations.yaml` (agregue una entrada con `function`, `formula`, `format`, `param_names`) y agregue traducciones en `src/locales/`

source: Test thoroughly
es: Pruebe a fondo

source: Modifying the UI
es: Modificar la interfaz de usuario

source: Main menu: Edit `frontend/ui_main_menu.py`
es: Menú principal: Editar `frontend/ui_main_menu.py`

source: Keyboard navigation: Edit `frontend/keyboard_nav.py` (see [keyboard_nav](keyboard_nav.md))
es: Navegación con teclado: edite `frontend/keyboard_nav.py` (consulte [keyboard_nav](keyboard_nav.md))

source: Image utilities: Edit `frontend/image_utils.py` (see [image_utils](image_utils.md))
es: Utilidades de imagen: edite `frontend/image_utils.py` (consulte [image_utils](image_utils.md))

source: Dialogs: Edit modules in `frontend/ui_dialogs/` (e.g. `data_selection.py`, `equation.py`)
es: Diálogos: editar módulos en `frontend/ui_dialogs/` (por ejemplo, `data_selection.py`, `equation.py`)

source: Styling: Configure in `.env` file
es: Estilo: configurar en el archivo `.env`

source: **Streamlit**:
es: **Iluminado**:

source: Entry point: `streamlit_app/app.py`; UI logic in `streamlit_app/sections/`
es: Punto de entrada: `streamlit_app/app.py`; Lógica de la interfaz de usuario en `streamlit_app/sections/`

source: Theme: `streamlit_app/theme.py`
es: Tema: `streamlit_app/theme.py`

source: CSS in `SIDEBAR_CSS` in `sections/sidebar.py`
es: CSS en `SIDEBAR_CSS` en `secciones/sidebar.py`

source: Add new modes in `sections/modes.py`
es: Agregar nuevos modos en `sections/modes.py`

source: Adding a New Data Format
es: Agregar un nuevo formato de datos

source: Create reader function in `loaders/loading_utils.py`
es: Crear función de lector en `loaders/loading_utils.py`

source: Register it in the `FILE_TYPE_READERS` dict in `loaders/data_loader.py` (key = file type, value = reader function)
es: Regístrelo en el diccionario `FILE_TYPE_READERS` en `loaders/data_loader.py` (clave = tipo de archivo, valor = función de lectura)

source: Add file type filter to `open_load_dialog()` in `frontend/ui_dialogs/load_data_dialog.py`
es: Agregue filtro de tipo de archivo a `open_load_dialog()` en `frontend/ui_dialogs/load_data_dialog.py`

source: Test with sample data
es: Prueba con datos de muestra

source: Changing Plot Style
es: Cambiar el estilo de la trama

source: **Per-plot**: Pass parameters to `create_plot()` in `plotting/plot_utils.py`
es: **Por trazado**: pase parámetros a `create_plot()` en `plotting/plot_utils.py`

source: **Globally**: Configure in `.env` file
es: **Globalmente**: Configurar en el archivo `.env`

source: **Programmatically**: Modify `PLOT_CONFIG` and related settings in `config/theme.py`
es: **Programáticamente**: modifique `PLOT_CONFIG` y las configuraciones relacionadas en `config/theme.py`

source: Testing
es: Pruebas

source: Test Structure
es: Estructura de prueba

source: Run tests via `pytest tests/` or `python tests/run_tests.py`, or use `bin/run_tests.bat` (Windows) / `bin/run_tests.sh` (Linux/macOS). The bin test launchers require `.venv` (run setup first).
es: Ejecute pruebas a través de `pytest tests/` o `python tests/run_tests.py`, o use `bin/run_tests.bat` (Windows) / `bin/run_tests.sh` (Linux/macOS). Los lanzadores de pruebas bin requieren `.venv` (ejecute primero la configuración).

source: Running Tests
es: Ejecución de pruebas

source: Writing Tests
es: Pruebas de escritura

source: Example test:
es: Prueba de ejemplo:

source: API Conventions
es: Convenciones API

source: Return Values
es: Valores de retorno

source: **Fitting functions** return a 4-tuple from `generic_fit` (and from `get_fitting_function` / custom evaluator):
es: **Funciones de ajuste** devuelven una tupla de 4 desde `generic_fit` (y desde `get_fitting_function`/evaluador personalizado):

source: Callers that only need the main result use the first three; `fit_info` holds fit metadata. `text` contains formatted parameters, uncertainties, R², and statistics.
es: Las personas que llaman y que sólo necesitan el resultado principal utilizan los tres primeros; `fit_info` contiene metadatos de ajuste. El "texto" contiene parámetros formateados, incertidumbres, R² y estadísticas.

source: **Data loaders** return pandas DataFrame
es: **Cargadores de datos** devuelven pandas DataFrame

source: **Plot functions** return path to saved plot (str or Path)
es: **Funciones de trazado** ruta de retorno al trazado guardado (cadena o ruta)

source: Error Handling
es: Manejo de errores

source: Use `FittingError` for curve fitting failures
es: Utilice `FittingError` para fallas en el ajuste de curvas

source: Use `DataLoadError` for data loading problems
es: Utilice `DataLoadError` para problemas de carga de datos

source: Use standard Python exceptions for other errors
es: Utilice excepciones estándar de Python para otros errores

source: Always log errors before raising
es: Registra siempre los errores antes de generarlos.

source: Logging
es: Explotación florestal

source: Use the logger from `utils.logger`:
es: Utilice el registrador de `utils.logger`:

source: Type Hints
es: Consejos de tipo

source: Always include type hints:
es: Incluya siempre sugerencias de tipo:

source: Performance Considerations
es: Consideraciones de rendimiento

source: NumPy Best Practices
es: Mejores prácticas de NumPy

source: Use vectorized operations instead of loops
es: Utilice operaciones vectorizadas en lugar de bucles

source: Pre-allocate arrays when possible
es: Preasignar matrices cuando sea posible

source: Use in-place operations to reduce memory
es: Utilice operaciones in situ para reducir la memoria

source: Caching
es: Almacenamiento en caché

source: Use `functools.lru_cache` for expensive computations:
es: Utilice `functools.lru_cache` para cálculos costosos:

source: Lazy Imports
es: Importaciones perezosas

source: Import heavy libraries only when needed:
es: Importe bibliotecas pesadas solo cuando sea necesario:

source: Documentation
es: Documentación

source: Docstring Format
es: Formato de cadena de documentos

source: Use Google-style docstrings:
es: Utilice cadenas de documentación al estilo de Google:

source: Module Details
es: Detalles del módulo

source: For detailed documentation of each module, see the individual module pages:
es: Para obtener documentación detallada de cada módulo, consulte las páginas de los módulos individuales:

source: **Core**: [config](config.md), [i18n](i18n.md)
es: **Núcleo**: [config](config.md), [i18n](i18n.md)

source: **Fitting**: [fitting_functions](fitting_functions.md), [fitting_utils](fitting_utils.md), [workflow_controller](workflow_controller.md), [custom_function_evaluator](custom_function_evaluator.md), [estimators](estimators.md)
es: **Ajuste**: [fitting_functions](fitting_functions.md), [fitting_utils](fitting_utils.md), [workflow_controller](workflow_controller.md), [custom_function_evaluator](custom_function_evaluator.md), [estimadores](estimators.md)

source: **Plotting**: [plot_utils](plot_utils.md)
es: **Trazado**: [plot_utils](plot_utils.md)

source: **Utils**: [exceptions](exceptions.md), [logger](logger.md), [validators](validators.md)
es: **Utilidades**: [excepciones](exceptions.md), [logger](logger.md), [validadores](validators.md)

source: Contributing
es: Contribuir

source: See [Contributing Guide](../contributing.md) for:
es: Consulte la [Guía de contribución](../contributing.md) para:

source: Code style guidelines
es: Pautas de estilo de código

source: Pull request process
es: Proceso de solicitud de extracción

source: Development workflow
es: Flujo de trabajo de desarrollo

source: Testing requirements
es: Requisitos de prueba

source: *Last updated: February 2026.*
es: *Última actualización: febrero de 2026.*
