Repository: DOKOS-TAYOS/RegressionLab
Catalog: sphinx-docs/locale/*/LC_MESSAGES/modules/core.po
Languages: es

source: Core Modules
es: Módulos principales

source: Main system modules.
es: Módulos principales del sistema.

source: Main Program
es: Programa principal

source: Main Program - Data Fitting Application Entry point for the curve fitting application with GUI interface.
es: Programa principal - Aplicación de ajuste de datos. Punto de entrada de la aplicación de ajuste de curvas con interfaz gráfica.

source: Perform a normal fitting operation with optional loop mode.
es: Realizar una operación de ajuste normal con modo bucle opcional.

source: This is the main fitting workflow that most users will use. It fits a single equation type to a single dataset.
es: Es el flujo de trabajo principal de ajuste que usarán la mayoría de usuarios. Ajusta un único tipo de ecuación a un único conjunto de datos.

source: Workflow: 1. User selects equation type (predefined or custom) 2. User decides whether to enable loop mode 3. User selects data file and variables 4. Fit is performed and results displayed 5. If loop mode: user can modify data and refit without restarting
es: Flujo: 1. El usuario elige el tipo de ecuación (predefinida o personalizada) 2. El usuario decide si activar el modo bucle 3. El usuario selecciona archivo de datos y variables 4. Se realiza el ajuste y se muestran los resultados 5. En modo bucle: el usuario puede modificar datos y reajustar sin reiniciar

source: Loop mode is useful for:
es: El modo bucle es útil para:

source: Exploring different data subsets
es: Explorar distintos subconjuntos de datos

source: Iteratively cleaning outliers
es: Limpiar valores atípicos de forma iterativa

source: Testing sensitivity to data modifications
es: Probar la sensibilidad a modificaciones de los datos

source: Perform multiple fitting operations with the same equation on different datasets.
es: Realizar varias operaciones de ajuste con la misma ecuación sobre distintos conjuntos de datos.

source: Workflow: 1. Select equation type 2. Specify how many datasets to fit 3. Load each dataset 4. Perform fits on all datasets 5. Optionally reload and refit in loop
es: Flujo: 1. Seleccionar tipo de ecuación 2. Indicar cuántos conjuntos ajustar 3. Cargar cada conjunto 4. Realizar ajustes en todos 5. Opcionalmente recargar y reajustar en bucle

source: Test different equation types on the same dataset.
es: Probar distintos tipos de ecuación sobre el mismo conjunto de datos.

source: Workflow: 1. Load a dataset once 2. Try different equation types on it 3. Compare results without reloading the data
es: Flujo: 1. Cargar un conjunto una vez 2. Probar distintos tipos de ecuación 3. Comparar resultados sin recargar los datos

source: Perform all available fitting types on the selected dataset.
es: Ejecutar todos los tipos de ajuste disponibles sobre el conjunto seleccionado.

source: This function loads data and sequentially applies all predefined equation types to fit the data, generating results for each fitting method.
es: Esta función carga los datos y aplica secuencialmente todos los tipos de ecuación predefinidos para ajustar los datos, generando resultados para cada método.

source: View data from a file without performing any fitting.
es: Ver datos de un archivo sin realizar ningún ajuste.

source: This function allows users to inspect loaded data.
es: Esta función permite inspeccionar los datos cargados.

source: Display help and information about the application.
es: Mostrar ayuda e información sobre la aplicación.

source: Shows information about fitting modes, navigation, data locations, and output locations.
es: Muestra información sobre modos de ajuste, navegación, ubicación de datos y de salida.

source: Main entry point for the application.
es: Punto de entrada principal de la aplicación.

source: Configuration
es: Configuración

source: The ``config`` package contains all configuration management for the application.
es: El paquete ``config`` contiene toda la gestión de configuración de la aplicación.

source: Main Configuration Package
es: Paquete principal de configuración

source: Central configuration for the RegressionLab project.
es: Configuración central del proyecto RegressionLab.

source: Re-exports all configuration from submodules so that "from config import UI_STYLE" etc. continue to work.
es: Reexporta toda la configuración de los submódulos para que "from config import UI_STYLE" etc. siga funcionando.

source: Color Utilities
es: Utilidades de color

source: Pure hex color manipulation utilities (no config/env dependencies).
es: Utilidades puras de manipulación de colores hex (sin dependencias de config/env).

source: Parse a hex color string to RGB tuple (0-255 range).
es: Convertir una cadena de color hex a tupla RGB (rango 0-255).

source: Parameters
es: Parámetros

source: Hex string (e.g., '#rrggbb' or '#rgb').
es: Cadena hex (p. ej. '#rrggbb' o '#rgb').

source: Returns
es: Devuelve

source: Tuple of (r, g, b) in 0-255 range, or None if invalid.
es: Tupla (r, g, b) en rango 0-255, o None si es inválido.

source: Return a slightly lighter shade of hex color.
es: Devolver una tonalidad ligeramente más clara del color hex.

source: Input hex color (e.g., '#181818').
es: Color hex de entrada (p. ej. '#181818').

source: Amount to lighten (0-1, default 0.08).
es: Cantidad de aclarado (0-1, por defecto 0.08).

source: Fallback when input is invalid.
es: Valor alternativo cuando la entrada es inválida.

source: Lighter hex color as #rrggbb.
es: Color hex más claro como #rrggbb.

source: Approximate muted (grayish) color from a hex color.
es: Aproximar un color apagado (grisáceo) a partir de un color hex.

source: Input hex color.
es: Color hex de entrada.

source: Muted gray hex color as #rrggbb.
es: Color gris apagado en hex como #rrggbb.

source: Environment Configuration
es: Configuración del entorno

source: Environment variable loading and .env schema.
es: Carga de variables de entorno y esquema .env.

source: Get environment variable using ENV_SCHEMA: default and cast_type come from the schema. Use this when the key is defined in ENV_SCHEMA to avoid duplicating defaults.
es: Obtener variable de entorno usando ENV_SCHEMA: default y cast_type vienen del esquema. Úsalo cuando la clave esté definida en ENV_SCHEMA para no duplicar valores por defecto.

source: Environment variable name (must exist in ENV_SCHEMA).
es: Nombre de la variable de entorno (debe existir en ENV_SCHEMA).

source: The validated value from get_env(key, default, cast_type).
es: El valor validado de get_env(key, default, cast_type).

source: Raises
es: Lanza

source: If key is not in ENV_SCHEMA.
es: Si la clave no está en ENV_SCHEMA.

source: Get environment variable with type casting, validation, and default value.
es: Obtener variable de entorno con conversión de tipo, validación y valor por defecto.

source: This function validates the value according to ENV_SCHEMA rules. If validation fails, the default value is returned.
es: Esta función valida el valor según las reglas de ENV_SCHEMA. Si falla la validación, se devuelve el valor por defecto.

source: Environment variable name.
es: Nombre de la variable de entorno.

source: Default value if variable not found or invalid.
es: Valor por defecto si la variable no existe o es inválida.

source: Type to cast the value to (str, int, float, bool).
es: Tipo al que convertir el valor (str, int, float, bool).

source: The environment variable value cast to the specified type, validated, or default if invalid or missing.
es: El valor de la variable de entorno convertido al tipo indicado, validado, o el valor por defecto si es inválido o falta.

source: Validate all environment values according to ENV_SCHEMA and return validation results.
es: Validar todos los valores de entorno según ENV_SCHEMA y devolver los resultados de validación.

source: This function checks all environment variables defined in ENV_SCHEMA, validates them, and returns information about which values were corrected.
es: Esta función comprueba todas las variables de entorno definidas en ENV_SCHEMA, las valida y devuelve información sobre qué valores fueron corregidos.

source: Dictionary mapping environment keys to tuples of (corrected_value, was_corrected). was_corrected is True if the value was invalid and had to be corrected.
es: Diccionario que mapea claves de entorno a tuplas (corrected_value, was_corrected). was_corrected es True si el valor era inválido y hubo que corregirlo.

source: Examples
es: Ejemplos

source: Collect current environment values for all keys defined in ``ENV_SCHEMA``.
es: Recoger los valores actuales de entorno para todas las claves definidas en ``ENV_SCHEMA``.

source: Values are read using :func:`get_env` so casting, defaults and boolean handling are applied consistently. Booleans are converted to the strings ``"true"`` or ``"false"`` so they can be written back to ``.env`` files without ambiguity.
es: Los valores se leen con :func:`get_env` para que la conversión, los valores por defecto y el manejo de booleanos se apliquen de forma consistente. Los booleanos se convierten a las cadenas ``"true"`` o ``"false"`` para poder escribirlos en archivos ``.env`` sin ambigüedad.

source: Dictionary mapping environment keys to their string representation.
es: Diccionario que mapea claves de entorno a su representación en cadena.

source: Write a ``.env`` file with the given key=value pairs.
es: Escribir un archivo ``.env`` con los pares clave=valor dados.

source: Only keys present in :data:`ENV_SCHEMA` are written, and values are quoted when they contain spaces, ``#`` or line breaks so they remain parseable by ``dotenv`` and similar tools.
es: Solo se escriben las claves presentes en :data:`ENV_SCHEMA`, y los valores se entrecomillan cuando contienen espacios, ``#`` o saltos de línea para que sigan siendo parseables por ``dotenv`` y herramientas similares.

source: Destination path for the ``.env`` file.
es: Ruta de destino del archivo ``.env``.

source: Mapping from environment keys to their desired string values.
es: Mapeo de claves de entorno a sus valores en cadena deseados.

source: Initialize configuration and validate all environment values.
es: Inicializar la configuración y validar todos los valores de entorno.

source: This function should be called at application startup to ensure all configuration values are valid. Invalid values are automatically corrected to their defaults, and warnings are logged if any corrections were made.
es: Esta función debe llamarse al arrancar la aplicación para asegurar que todos los valores de configuración son válidos. Los valores inválidos se corrigen automáticamente a sus valores por defecto y se registran advertencias si se realizaron correcciones.

source: Theme Configuration
es: Configuración del tema

source: UI theme, plot style, and font configuration.
es: Configuración de tema de la interfaz, estilo de gráficos y fuentes.

source: All UI appearance is controlled by a single set of env vars. Fonts, sizes, colors, relief and spacing are unified for consistency. Values are read from ENV_SCHEMA in config.env (single source of truth for defaults and types).
es: Toda la apariencia de la interfaz se controla con un único conjunto de variables de entorno. Fuentes, tamaños, colores, relieve y espaciado están unificados. Los valores se leen de ENV_SCHEMA en config.env (fuente única de verdad para valores por defecto y tipos).

source: Get font tuple for ttk Entry and Combobox widgets.
es: Obtener la tupla de fuente para widgets ttk Entry y Combobox.

source: Returns a font tuple unified with the UI base font configuration.
es: Devuelve una tupla de fuente unificada con la configuración base de fuentes de la interfaz.

source: Tuple of ``(font_family, font_size)`` from ``UI_STYLE`` configuration.
es: Tupla ``(font_family, font_size)`` de la configuración ``UI_STYLE``.

source: Configure ttk styles from the unified UI_STYLE. Call once after creating the Tk root. Uses 'clam' theme for consistent field colors.
es: Configurar estilos ttk desde el UI_STYLE unificado. Llamar una vez tras crear la raíz Tk. Usa el tema 'clam' para colores de campo consistentes.

source: Bind hover highlight effects to ttk widgets under parent.
es: Vincular efectos de resaltado al pasar el ratón a los widgets ttk bajo el padre.

source: Recursively applies hover effects (style changes on mouse enter/leave) to ttk Entry and Combobox widgets within the parent widget hierarchy.
es: Aplica recursivamente efectos de hover (cambios de estilo al entrar/salir el ratón) a los widgets ttk Entry y Combobox dentro de la jerarquía del widget padre.

source: TCheckbutton and TRadiobutton are excluded to avoid text size/layout shifts when hovering over options.
es: TCheckbutton y TRadiobutton se excluyen para evitar cambios de tamaño o diseño del texto al pasar el ratón sobre las opciones.

source: Parent Tkinter widget to recursively search for children widgets.
es: Widget padre de Tkinter en el que buscar recursivamente widgets hijos.

source: Configure and cache font properties for plot titles and axes.
es: Configurar y cachear propiedades de fuente para títulos y ejes de gráficos.

source: Creates and caches font objects for matplotlib plot titles and axes from FONT_CONFIG. Subsequent calls return cached fonts.
es: Crea y cachea objetos de fuente para títulos y ejes de matplotlib desde FONT_CONFIG. Las llamadas posteriores devuelven las fuentes cacheadas.

source: Tuple of ``(title_font, axis_font)`` font objects from ``FONT_CONFIG``.
es: Tupla de objetos de fuente ``(title_font, axis_font)`` desde ``FONT_CONFIG``.

source: Paths Configuration
es: Configuración de rutas

source: File paths and output directory configuration.
es: Configuración de rutas de archivos y directorio de salida.

source: Get the project root directory (parent of ``src/``).
es: Obtener el directorio raíz del proyecto (padre de ``src/``).

source: The function resolves the path based on the current file location, so it works even when the package is installed or executed from another folder.
es: La función resuelve la ruta según la ubicación del archivo actual, por lo que funciona aunque el paquete esté instalado o se ejecute desde otra carpeta.

source: Absolute :class:`pathlib.Path` to the project root.
es: :class:`pathlib.Path` absoluto a la raíz del proyecto.

source: Ensure that the output directory exists and return its absolute path.
es: Asegurar que el directorio de salida exista y devolver su ruta absoluta.

source: If ``output_dir`` is ``None``, the value from :data:`FILE_CONFIG` is used. The directory is created recursively when missing.
es: Si ``output_dir`` es ``None``, se usa el valor de :data:`FILE_CONFIG`. El directorio se crea recursivamente si no existe.

source: Relative output directory name, usually from configuration.
es: Nombre relativo del directorio de salida, normalmente desde la configuración.

source: Absolute path to the output directory as a string.
es: Ruta absoluta al directorio de salida como cadena.

source: If the directory cannot be created.
es: Si no se puede crear el directorio.

source: Build the full output file path for a plot image.
es: Construir la ruta completa del archivo de salida para una imagen del gráfico.

source: The final filename is created from ``FILE_CONFIG['filename_template']`` and the normalized plot format, ensuring a consistent extension.
es: El nombre de archivo final se crea a partir de ``FILE_CONFIG['filename_template']`` y el formato de gráfico normalizado, asegurando una extensión consistente.

source: Base name for the plot (usually the fit or dataset name).
es: Nombre base del gráfico (normalmente el nombre del ajuste o del conjunto de datos).

source: Optional relative output directory; if ``None``, the default from :data:`FILE_CONFIG` is used.
es: Directorio de salida relativo opcional; si es ``None``, se usa el valor por defecto de :data:`FILE_CONFIG`.

source: Absolute path to the image file as a string.
es: Ruta absoluta al archivo de imagen como cadena.

source: Constants
es: Constantes

source: Application constants, equation mappings, and version.
es: Constantes de la aplicación, mapeos de ecuaciones y versión.

source: Internationalization
es: Internacionalización

source: Internationalization (i18n) module for the RegressionLab application.
es: Módulo de internacionalización (i18n) para la aplicación RegressionLab.

source: This module provides language support for the application, allowing all UI messages, logs, and errors to be displayed in different languages based on the LANGUAGE environment variable.
es: Este módulo proporciona soporte de idiomas para la aplicación, permitiendo que todos los mensajes de la interfaz, logs y errores se muestren en distintos idiomas según la variable de entorno LANGUAGE.

source: Supported languages:
es: Idiomas soportados:

source: 'es' or 'español': Spanish (default)
es: 'es' o 'español': Español (por defecto)

source: 'en' or 'english': English
es: 'en' o 'english': Inglés

source: 'de' or 'german': German
es: 'de' o 'german': Alemán

source: Usage::
es: Uso::

source: Initialize the internationalization system.
es: Inicializar el sistema de internacionalización.

source: This function should be called once at application startup. If no language is specified, it reads from the LANGUAGE environment variable.
es: Esta función debe llamarse una vez al arrancar la aplicación. Si no se especifica idioma, se lee de la variable de entorno LANGUAGE.

source: Optional language code ('es', 'en', or 'de'). If None, reads from env var.
es: Código de idioma opcional ('es', 'en' o 'de'). Si es None, se lee de la variable de entorno.

source: Translate a key to the current language.
es: Traducir una clave al idioma actual.

source: Retrieves the translation for a given key in the current language. The key uses dot notation to navigate nested dictionaries.
es: Obtiene la traducción de una clave dada en el idioma actual. La clave usa notación de punto para navegar por diccionarios anidados.

source: Translation key in dot notation (e.g. ``'menu.welcome'``).
es: Clave de traducción en notación de punto (p. ej. ``'menu.welcome'``).

source: Optional format parameters for string interpolation.
es: Parámetros de formato opcionales para interpolación de cadenas.

source: Translated string, or the key itself if translation not found.
es: Cadena traducida, o la clave misma si no se encuentra la traducción.
