Repository: DOKOS-TAYOS/RegressionLab
Catalog: sphinx-docs/locale/*/LC_MESSAGES/modules/data_analysis.po
Languages: es

source: Data Analysis Module
es: Módulo de análisis de datos

source: The ``data_analysis`` module provides transforms (FFT, DCT, Hilbert, Laplace, cepstrum, Hadamard, log, exp, etc.) and cleaning utilities (drop NaN, outliers, etc.). Used by the View Data window in Tkinter and Streamlit.
es: El módulo ``data_analysis`` proporciona transformaciones (FFT, DCT, Hilbert, Laplace, cepstrum, Hadamard, log, exp, etc.) y utilidades de limpieza (eliminar NaN, valores atípicos, etc.). Usado por la ventana Ver datos en Tkinter y Streamlit.

source: Main Package
es: Paquete principal

source: Data analysis: transforms and cleaning utilities.
es: Análisis de datos: transformaciones y utilidades de limpieza.

source: Transforms
es: Transformaciones

source: Apply a transform to selected numeric columns.
es: Aplicar una transformación a las columnas numéricas seleccionadas.

source: Parameters
es: Parámetros

source: Input DataFrame.
es: DataFrame de entrada.

source: One of TRANSFORM_* constants.
es: Una de las constantes TRANSFORM_*.

source: Columns to transform. If None, all numeric columns.
es: Columnas a transformar. Si es None, todas las columnas numéricas.

source: If True, replace columns. If False, add new columns with suffix.
es: Si es True, reemplaza columnas. Si es False, añade columnas nuevas con sufijo.

source: Returns
es: Devuelve

source: New DataFrame with transformed columns.
es: Nuevo DataFrame con las columnas transformadas.

source: Cleaning
es: Limpieza

source: Data cleaning operations.
es: Operaciones de limpieza de datos.

source: Apply a cleaning operation to the DataFrame.
es: Aplicar una operación de limpieza al DataFrame.

source: One of CLEAN_* constants.
es: Una de las constantes CLEAN_*.

source: For column-specific ops (fill, outliers). If None, all numeric.
es: Para operaciones por columna (relleno, valores atípicos). Si es None, todas las numéricas.

source: New cleaned DataFrame.
es: Nuevo DataFrame limpio.
