Repository: DOKOS-TAYOS/RegressionLab
Catalog: sphinx-docs/locale/*/LC_MESSAGES/modules/fitting.po
Languages: es

source: Fitting Module
es: Módulo de ajuste

source: The ``fitting`` module contains all functions and utilities for performing curve fitting.
es: El módulo ``fitting`` contiene todas las funciones y utilidades para realizar el ajuste de curvas.

source: Fitting Functions
es: Funciones de ajuste

source: Main fitting functions package (re-exports from fitting.functions).
es: Paquete principal de funciones de ajuste (reexporta desde fitting.functions).

source: Fitting functions and operations for curve fitting.
es: Funciones y operaciones de ajuste para ajuste de curvas.

source: This package re-exports all model functions and fitting wrappers from fitting.functions so that existing code using getattr(fitting_functions, name) continues to work.
es: Este paquete reexporta todas las funciones de modelo y wrappers de ajuste desde fitting.functions para que el código que usa getattr(fitting_functions, name) siga funcionando.

source: Provides:
es: Proporciona:

source: Mathematical functions for curve fitting (linear_function, sin_function, etc.)
es: Funciones matemáticas para ajuste de curvas (linear_function, sin_function, etc.)

source: High-level fitting wrappers (fit_linear_function, fit_sin_function, etc.)
es: Wrappers de ajuste de alto nivel (fit_linear_function, fit_sin_function, etc.)

source: Factory functions to generate custom fitting functions dynamically
es: Funciones factoría para generar funciones de ajuste personalizadas dinámicamente

source: Mathematical Functions
es: Funciones matemáticas

source: The ``fitting.functions`` subpackage contains mathematical model functions organized by family.
es: El subpaquete ``fitting.functions`` contiene funciones de modelo matemático organizadas por familia.

source: Base Types
es: Tipos base

source: Shared types and imports for fitting functions.
es: Tipos e importaciones compartidos para las funciones de ajuste.

source: Polynomial Functions
es: Funciones polinomiales

source: Polynomial and linear fitting functions.
es: Funciones de ajuste polinomial y lineal.

source: Generate a polynomial function dynamically based on which parameters are enabled.
es: Generar una función polinomial dinámicamente según qué parámetros estén activos.

source: Parameters
es: Parámetros

source: List of booleans indicating which polynomial terms to include. Index i corresponds to the coefficient of t^i.
es: Lista de booleanos que indican qué términos polinomiales incluir. El índice i corresponde al coeficiente de t^i.

source: Returns
es: Devuelve

source: A function that takes t and the enabled coefficients as arguments.
es: Una función que recibe t y los coeficientes activos como argumentos.

source: Fit a linear model with intercept, :math:`y = m x + n`.
es: Ajustar un modelo lineal con ordenada en el origen, :math:`y = m x + n`.

source: Data source (dictionary or DataFrame) containing ``x``, ``y`` and their uncertainties (``ux``, ``uy``).
es: Fuente de datos (diccionario o DataFrame) con ``x``, ``y`` y sus incertidumbres (``ux``, ``uy``).

source: Name of the independent variable column.
es: Nombre de la columna de variable independiente.

source: Name of the dependent variable column.
es: Nombre de la columna de variable dependiente.

source: Optional list overriding the automatically estimated ``[n, m]``; ``None`` entries keep the estimate.
es: Lista opcional que sobrescribe la estimación automática ``[n, m]``; las entradas ``None`` mantienen la estimación.

source: Optional pair ``(lower, upper)`` with bounds for ``[n, m]``; ``None`` entries keep the estimator bounds.
es: Par opcional ``(lower, upper)`` con límites para ``[n, m]``; las entradas ``None`` mantienen los límites del estimador.

source: Tuple ``(text, y_fitted, equation)`` as produced by :func:`fitting.fitting_utils.generic_fit`.
es: Tupla ``(text, y_fitted, equation)`` como la producida por :func:`fitting.fitting_utils.generic_fit`.

source: Fit a linear model through the origin, :math:`y = m x`.
es: Ajustar un modelo lineal que pasa por el origen, :math:`y = m x`.

source: Data source with columns for ``x``, ``y`` and their uncertainties.
es: Fuente de datos con columnas para ``x``, ``y`` y sus incertidumbres.

source: Optional list overriding the estimated slope ``[m]``; ``None`` keeps the estimate.
es: Lista opcional que sobrescribe la pendiente estimada ``[m]``; ``None`` mantiene la estimación.

source: Optional pair ``(lower, upper)`` with bounds for ``[m]``.
es: Par opcional ``(lower, upper)`` con límites para ``[m]``.

source: Tuple ``(text, y_fitted, equation)`` from :func:`generic_fit`.
es: Tupla ``(text, y_fitted, equation)`` de :func:`generic_fit`.

source: Fit a full quadratic model :math:`y = c x^2 + b x + a`.
es: Ajustar un modelo cuadrático completo :math:`y = c x^2 + b x + a`.

source: Data source with ``x``, ``y`` and their uncertainties.
es: Fuente de datos con ``x``, ``y`` y sus incertidumbres.

source: Optional overrides for ``[a, b, c]``.
es: Sobrescrituras opcionales para ``[a, b, c]``.

source: Optional bounds for ``[a, b, c]``.
es: Límites opcionales para ``[a, b, c]``.

source: Fit a pure quadratic model through the origin, :math:`y = a x^2`.
es: Ajustar un modelo cuadrático puro por el origen, :math:`y = a x^2`.

source: Optional override for ``[a]``.
es: Sobrescritura opcional para ``[a]``.

source: Optional bounds for ``[a]``.
es: Límites opcionales para ``[a]``.

source: Fit a fourth‑power model through the origin, :math:`y = a x^4`.
es: Ajustar un modelo de cuarta potencia por el origen, :math:`y = a x^4`.

source: Trigonometric Functions
es: Funciones trigonométricas

source: Trigonometric and hyperbolic fitting functions.
es: Funciones de ajuste trigonométricas e hiperbólicas.

source: Generate a trigonometric function dynamically based on the function type.
es: Generar una función trigonométrica dinámicamente según el tipo de función.

source: Type of function ('sin', 'cos', 'sinh', 'cosh').
es: Tipo de función ('sin', 'cos', 'sinh', 'cosh').

source: Whether to include a phase shift parameter c.
es: Si se incluye el parámetro de desfase c.

source: A function that takes t and parameters (a, b, [c]) as arguments.
es: Una función que recibe t y los parámetros (a, b, [c]) como argumentos.

source: Tangent function: y = a * tan(b*t)
es: Función tangente: y = a * tan(b*t)

source: Tangent function with phase: y = a * tan(b*t + c)
es: Función tangente con fase: y = a * tan(b*t + c)

source: Fit a sine model without phase, :math:`y = a \sin(b x)`.
es: Ajustar un modelo seno sin fase, :math:`y = a \sin(b x)`.

source: Data source with ``x``, ``y`` and uncertainties.
es: Fuente de datos con ``x``, ``y`` e incertidumbres.

source: Optional overrides for ``[a, b]``.
es: Sobrescrituras opcionales para ``[a, b]``.

source: Optional bounds for ``[a, b]``.
es: Límites opcionales para ``[a, b]``.

source: Fit a sine model with phase, :math:`y = a \sin(b x + c)`.
es: Ajustar un modelo seno con fase, :math:`y = a \sin(b x + c)`.

source: Fit a cosine model without phase, :math:`y = a \cos(b x)`.
es: Ajustar un modelo coseno sin fase, :math:`y = a \cos(b x)`.

source: Fit a cosine model with phase, :math:`y = a \cos(b x + c)`.
es: Ajustar un modelo coseno con fase, :math:`y = a \cos(b x + c)`.

source: Fit a hyperbolic sine model, :math:`y = a \sinh(b x)`.
es: Ajustar un modelo seno hiperbólico, :math:`y = a \sinh(b x)`.

source: Fit a hyperbolic cosine model, :math:`y = a \cosh(b x)`.
es: Ajustar un modelo coseno hiperbólico, :math:`y = a \cosh(b x)`.

source: Fit a tangent model without phase, :math:`y = a \tan(b x)`.
es: Ajustar un modelo tangente sin fase, :math:`y = a \tan(b x)`.

source: Fit a tangent model with phase, :math:`y = a \tan(b x + c)`.
es: Ajustar un modelo tangente con fase, :math:`y = a \tan(b x + c)`.

source: Inverse Functions
es: Funciones inversas

source: Inverse and logarithmic fitting functions.
es: Funciones de ajuste inversas y logarítmicas.

source: Natural logarithm function: y = a*ln(t)
es: Función logaritmo natural: y = a*ln(t)

source: Generate an inverse power function dynamically based on the power.
es: Generar una función de potencia inversa dinámicamente según el exponente.

source: The power of t in the denominator (e.g., 1 for 1/t, 2 for 1/t^2).
es: El exponente de t en el denominador (p. ej. 1 para 1/t, 2 para 1/t^2).

source: A function that takes t and coefficient a as arguments.
es: Una función que recibe t y el coeficiente a como argumentos.

source: Fit a logarithmic model :math:`y = a \ln(x)`.
es: Ajustar un modelo logarítmico :math:`y = a \ln(x)`.

source: Data source with positive ``x`` values, ``y`` and uncertainties.
es: Fuente de datos con valores ``x`` positivos, ``y`` e incertidumbres.

source: Optional override for the coefficient ``[a]``.
es: Sobrescritura opcional para el coeficiente ``[a]``.

source: Fit an inverse model :math:`y = a / x`.
es: Ajustar un modelo inverso :math:`y = a / x`.

source: Data source with non‑zero ``x`` values, ``y`` and uncertainties.
es: Fuente de datos con valores ``x`` no nulos, ``y`` e incertidumbres.

source: Fit an inverse‑square model :math:`y = a / x^2`.
es: Ajustar un modelo inverso del cuadrado :math:`y = a / x^2`.

source: Special Functions
es: Funciones especiales

source: Gaussian, exponential, binomial, square pulse, and Hermite fitting functions.
es: Funciones de ajuste gaussiana, exponencial, binomial, pulso cuadrado y Hermite.

source: Fit a Gaussian (normal) model :math:`y = A \exp(-(x-\mu)^2 / (2\sigma^2))`.
es: Ajustar un modelo gaussiano (normal) :math:`y = A \exp(-(x-\mu)^2 / (2\sigma^2))`.

source: Optional overrides for ``[A, μ, σ]``.
es: Sobrescrituras opcionales para ``[A, μ, σ]``.

source: Optional bounds for ``[A, μ, σ]``.
es: Límites opcionales para ``[A, μ, σ]``.

source: Fit an exponential model :math:`y = a \exp(b x)`.
es: Ajustar un modelo exponencial :math:`y = a \exp(b x)`.

source: Fit a logistic (binomial‑type) model :math:`y = a / (1 + \exp(-b (x - c)))`.
es: Ajustar un modelo logístico (tipo binomial) :math:`y = a / (1 + \exp(-b (x - c)))`.

source: Fit a smooth square‑pulse model in time.
es: Ajustar un modelo de pulso cuadrado suave en el tiempo.

source: The underlying function approximates a finite‑width pulse centered at ``t0`` with width ``w`` and amplitude ``A`` using hyperbolic tangents.
es: La función subyacente aproxima un pulso de anchura finita centrado en ``t0`` con anchura ``w`` y amplitud ``A`` usando tangentes hiperbólicas.

source: Optional overrides for ``[A, t0, w]``.
es: Sobrescrituras opcionales para ``[A, t0, w]``.

source: Optional bounds for ``[A, t0, w]``.
es: Límites opcionales para ``[A, t0, w]``.

source: Fit a Hermite polynomial expansion up to degree 3.
es: Ajustar una expansión en polinomios de Hermite hasta grado 3.

source: The model is :math:`y = c_0 H_0(x) + c_1 H_1(x) + c_2 H_2(x) + c_3 H_3(x)`, where :math:`H_k` are physicists’ Hermite polynomials.
es: El modelo es :math:`y = c_0 H_0(x) + c_1 H_1(x) + c_2 H_2(x) + c_3 H_3(x)`, donde :math:`H_k` son los polinomios de Hermite (físicos).

source: Optional overrides for ``[c0, c1, c2, c3]``.
es: Sobrescrituras opcionales para ``[c0, c1, c2, c3]``.

source: Optional bounds for ``[c0, c1, c2, c3]``.
es: Límites opcionales para ``[c0, c1, c2, c3]``.

source: Fit a Hermite polynomial expansion up to degree 4.
es: Ajustar una expansión en polinomios de Hermite hasta grado 4.

source: The model extends :func:`fit_hermite_polynomial_3` with an additional :math:`c_4 H_4(x)` term.
es: El modelo extiende :func:`fit_hermite_polynomial_3` con un término adicional :math:`c_4 H_4(x)`.

source: Optional overrides for ``[c0, c1, c2, c3, c4]``.
es: Sobrescrituras opcionales para ``[c0, c1, c2, c3, c4]``.

source: Optional bounds for ``[c0, c1, c2, c3, c4]``.
es: Límites opcionales para ``[c0, c1, c2, c3, c4]``.

source: Fitting Utilities
es: Utilidades de ajuste

source: Fitting utilities for RegressionLab.
es: Utilidades de ajuste para RegressionLab.

source: This module provides parameter formatting, equation resolution, and integration with the fitting_functions package (initial guesses, bounds, fit execution).
es: Este módulo proporciona formato de parámetros, resolución de ecuaciones e integración con el paquete fitting_functions (valores iniciales, límites, ejecución del ajuste).

source: Format a number, using 10^exp with literal superscript instead of E or e.
es: Formatear un número usando 10^exp con superíndice literal en lugar de E o e.

source: Number to format.
es: Número a formatear.

source: Format specifier (default '.4g' for general format).
es: Especificador de formato (por defecto '.4g' para formato general).

source: Formatted string, e.g. '1.234×10⁻⁵' instead of '1.234e-05'.
es: Cadena formateada, p. ej. '1.234×10⁻⁵' en lugar de '1.234e-05'.

source: Format a parameter value and its uncertainty using scientific notation.
es: Formatear un valor de parámetro y su incertidumbre en notación científica.

source: The function chooses a sensible number of decimals for ``value`` based on the exponent of ``sigma`` and returns both the rounded value and the formatted uncertainty.
es: La función elige un número razonable de decimales para ``value`` según el exponente de ``sigma`` y devuelve tanto el valor redondeado como la incertidumbre formateada.

source: Parameter value.
es: Valor del parámetro.

source: Uncertainty in the parameter.
es: Incertidumbre del parámetro.

source: Tuple ``(rounded_value, sigma_str)`` where ``sigma_str`` is in scientific notation (for example ``'1.2E-03'``).
es: Tupla ``(rounded_value, sigma_str)`` donde ``sigma_str`` está en notación científica (por ejemplo ``'1.2E-03'``).

source: Examples
es: Ejemplos

source: Generic fitting function that performs curve fitting with any function.
es: Función de ajuste genérica que realiza ajuste de curvas con cualquier función.

source: This function handles the complete fitting workflow including parameter extraction, uncertainty calculation, and result formatting.
es: Esta función maneja el flujo completo de ajuste: extracción de parámetros, cálculo de incertidumbres y formato de resultados.

source: Data dictionary containing x, y and their uncertainties
es: Diccionario de datos con x, y y sus incertidumbres

source: Name(s) of the x variable(s) - For single variable: string (e.g., "x") - For multiple variables: list of strings (e.g., ["x_0", "x_1"])
es: Nombre(s) de la(s) variable(s) x - Una variable: cadena (p. ej. "x") - Varias variables: lista de cadenas (p. ej. ["x_0", "x_1"])

source: Name of the y variable
es: Nombre de la variable y

source: Function to fit (e.g., linear_function_with_n, sin_function, etc.)
es: Función a ajustar (p. ej. linear_function_with_n, sin_function, etc.)

source: List of parameter names (e.g., ['m', 'n'] or ['a', 'b', 'c'])
es: Lista de nombres de parámetros (p. ej. ['m', 'n'] o ['a', 'b', 'c'])

source: Template for equation display (e.g., "y={m}x+{n}")
es: Plantilla para mostrar la ecuación (p. ej. "y={m}x+{n}")

source: Optional initial parameter values for fitting (improves convergence)
es: Valores iniciales opcionales de parámetros para el ajuste (mejora la convergencia)

source: Optional (lower_bounds, upper_bounds) for parameters; avoids overflow in exponentials
es: Opcional (lower_bounds, upper_bounds) para parámetros; evita desbordamiento en exponenciales

source: Optional original formula string (e.g. "y = mx + n"); used for custom fits; predefined fits use EQUATIONS config lookup.
es: Cadena de fórmula original opcional (p. ej. "y = mx + n"); se usa en ajustes personalizados; los predefinidos usan la config EQUATIONS.

source: - text: Formatted text with parameters, uncertainties, R² and statistics - y_fitted: Array with fitted y values - equation: Original formula (if known), newline, and formatted equation with parameter values - fit_info: Dict with 'fit_func', 'params', 'cov', 'x_names' for prediction; None if unavailable
es: - text: Texto formateado con parámetros, incertidumbres, R² y estadísticas - y_fitted: Array con valores y ajustados - equation: Fórmula original (si se conoce), salto de línea y ecuación formateada con valores - fit_info: Dict con 'fit_func', 'params', 'cov', 'x_names' para predicción; None si no hay

source: text: Formatted text with parameters, uncertainties, R² and statistics
es: text: Texto formateado con parámetros, incertidumbres, R² y estadísticas

source: y_fitted: Array with fitted y values
es: y_fitted: Array con valores y ajustados

source: equation: Original formula (if known), newline, and formatted equation with parameter values
es: equation: Fórmula original (si se conoce), salto de línea y ecuación formateada con valores de parámetros

source: fit_info: Dict with 'fit_func', 'params', 'cov', 'x_names' for prediction; None if unavailable
es: fit_info: Dict con 'fit_func', 'params', 'cov', 'x_names' para predicción; None si no está disponible

source: Return type
es: Tipo de retorno

source: Raises
es: Lanza

source: If fitting fails or data is invalid
es: Si el ajuste falla o los datos no son válidos

source: Get parameter names and display formula for a given equation type.
es: Obtener nombres de parámetros y fórmula de visualización para un tipo de ecuación.

source: Identifier of the equation (for example ``'linear_function_with_n'`` or ``'gaussian_function'``).
es: Identificador de la ecuación (por ejemplo ``'linear_function_with_n'`` o ``'gaussian_function'``).

source: Tuple ``(param_names, formula_str)`` where ``param_names`` is a list of parameter names in order and ``formula_str`` is a human‑readable equation, or ``None`` if the equation is unknown.
es: Tupla ``(param_names, formula_str)`` donde ``param_names`` es la lista de nombres de parámetros en orden y ``formula_str`` es la ecuación legible, o ``None`` si la ecuación es desconocida.

source: Return the format template (with placeholders) for the given fit function name.
es: Devolver la plantilla de formato (con marcadores) para el nombre de la función de ajuste dada.

source: Name of the fitting function (e.g. ``'fit_linear_function_with_n'``).
es: Nombre de la función de ajuste (p. ej. ``'fit_linear_function_with_n'``).

source: Format string (e.g. ``'y={m}x+{n}'``) or ``None`` if not found or no format key.
es: Cadena de formato (p. ej. ``'y={m}x+{n}'``) o ``None`` si no se encuentra o no hay clave format.

source: Return the parameter names for the given fit function from equations config.
es: Devolver los nombres de parámetros de la función de ajuste dada desde la config equations.

source: List of parameter names in the order expected by the fit function.
es: Lista de nombres de parámetros en el orden esperado por la función de ajuste.

source: If no equation config is found or param_names is missing.
es: Si no se encuentra config de ecuación o falta param_names.

source: Merge automatically computed initial guesses with user overrides.
es: Combinar estimaciones iniciales calculadas automáticamente con las del usuario.

source: For each index, if the override list has a non-``None`` value it replaces the computed one; otherwise the original computed value is kept.
es: Para cada índice, si la lista de sobrescritura tiene un valor no ``None`` reemplaza el calculado; si no, se mantiene el valor calculado original.

source: List of automatically estimated parameter values.
es: Lista de valores de parámetros estimados automáticamente.

source: Optional list of user‑provided overrides (same length as ``computed``); ``None`` entries mean “keep computed”.
es: Lista opcional de sobrescrituras del usuario (misma longitud que ``computed``); las entradas ``None`` significan "mantener el calculado".

source: New list with the effective initial guess for each parameter.
es: Nueva lista con la estimación inicial efectiva de cada parámetro.

source: Merge automatically computed parameter bounds with user overrides.
es: Combinar límites de parámetros calculados automáticamente con los del usuario.

source: Bounds are given as a pair ``(lower, upper)``. For each parameter index, non‑``None`` values in ``override_lower`` or ``override_upper`` replace the corresponding computed bound. Missing computed bounds default to ``(-inf, +inf)``.
es: Los límites son un par ``(lower, upper)``. Para cada índice, los valores no ``None`` en ``override_lower`` u ``override_upper`` reemplazan el límite calculado. Los límites calculados faltantes pasan a ``(-inf, +inf)``.

source: Optional pair of sequences with base lower and upper bounds as produced by estimators, or ``None``.
es: Par opcional de secuencias con límites inferior y superior base de los estimadores, o ``None``.

source: Optional list of lower bound overrides.
es: Lista opcional de sobrescrituras del límite inferior.

source: Optional list of upper bound overrides.
es: Lista opcional de sobrescrituras del límite superior.

source: Total number of parameters in the model.
es: Número total de parámetros del modelo.

source: Tuple ``(lower_bounds, upper_bounds)`` as tuples of floats, or ``computed_bounds`` unchanged if no overrides are provided.
es: Tupla ``(lower_bounds, upper_bounds)`` como tuplas de float, o ``computed_bounds`` sin cambios si no se dan sobrescrituras.

source: Get the fitting function corresponding to the equation name.
es: Obtener la función de ajuste correspondiente al nombre de la ecuación.

source: Returns a function (data, x_name, y_name, plot_name) that performs the fit. If initial_guess_override or bounds_override are provided, they are passed to the underlying fit (None in a slot means use estimator value).
es: Devuelve una función (data, x_name, y_name, plot_name) que realiza el ajuste. Si se pasan initial_guess_override o bounds_override, se envían al ajuste subyacente (None en un hueco significa usar el valor del estimador).

source: String identifier for the equation type.
es: Identificador de cadena para el tipo de ecuación.

source: Optional list of initial values (None = use estimator).
es: Lista opcional de valores iniciales (None = usar estimador).

source: Optional (lower_list, upper_list) (None in slot = use estimator).
es: Opcional (lower_list, upper_list) (None en hueco = usar estimador).

source: The corresponding fitting function, or None if not found or error occurs.
es: La función de ajuste correspondiente, o None si no se encuentra o hay error.

source: Custom Function Evaluator
es: Evaluador de funciones personalizadas

source: Custom Function Evaluator Module
es: Módulo evaluador de funciones personalizadas

source: This module provides safe runtime evaluation of custom mathematical functions for curve fitting.
es: Este módulo proporciona evaluación segura en tiempo de ejecución de funciones matemáticas personalizadas para ajuste de curvas.

source: Key features:
es: Características principales:

source: Safe evaluation with restricted namespace
es: Evaluación segura con espacio de nombres restringido

source: Automatic conversion of mathematical notation to NumPy functions
es: Conversión automática de notación matemática a funciones NumPy

source: Integration with the generic_fit function
es: Integración con la función generic_fit

source: No dynamic file generation required
es: No se requiere generación dinámica de archivos

source: Evaluates custom mathematical functions safely at runtime.
es: Evalúa funciones matemáticas personalizadas de forma segura en tiempo de ejecución.

source: This class takes a user-defined mathematical formula and parameter names, converts it to a NumPy-compatible function, and provides methods for curve fitting operations.
es: Esta clase recibe una fórmula matemática y nombres de parámetros definidos por el usuario, la convierte en una función compatible con NumPy y ofrece métodos para operaciones de ajuste de curvas.
