Repository: DOKOS-TAYOS/RegressionLab
Catalog: sphinx-docs/locale/*/LC_MESSAGES/modules/fitting.po
Languages: es

source: Initialize the custom function evaluator.
es: Inicializar el evaluador de funciones personalizadas.

source: Mathematical formula as string (e.g., "a*sin(x) + b" or "a*x_0**2 + b*x_1 + c")
es: Fórmula matemática como cadena (p. ej. "a*sin(x) + b" o "a*x_0**2 + b*x_1 + c")

source: List of parameter names used in the formula
es: Lista de nombres de parámetros usados en la fórmula

source: Number of independent variables (1 for x, >1 for x_0, x_1, etc.)
es: Número de variables independientes (1 para x, >1 para x_0, x_1, etc.)

source: If parameter names are invalid
es: Si los nombres de parámetros no son válidos

source: If equation cannot be parsed
es: Si la ecuación no se puede parsear

source: Perform curve fitting using the custom function.
es: Realizar ajuste de curvas usando la función personalizada.

source: This method uses the generic_fit function from fitting_utils to perform the actual curve fitting with error propagation.
es: Este método usa la función generic_fit de fitting_utils para realizar el ajuste de curvas con propagación de errores.

source: Data dictionary or DataFrame containing x, y and their uncertainties.
es: Diccionario de datos o DataFrame con x, y y sus incertidumbres.

source: Name(s) of the independent variable(s). - For single variable: string (e.g., "x") - For multiple variables: list of strings (e.g., ["x_0", "x_1"])
es: Nombre(s) de la(s) variable(s) independiente(s). Una variable: cadena (p. ej. "x"). Varias: lista de cadenas (p. ej. ["x_0", "x_1"]).

source: Name of the dependent variable.
es: Nombre de la variable dependiente.

source: - text: Formatted text with parameters and uncertainties (includes R²). - y_fitted: Array with fitted y values. - equation: Formatted equation with parameter values.
es: - text: Texto formateado con parámetros e incertidumbres (incluye R²). - y_fitted: Array con valores y ajustados. - equation: Ecuación formateada con valores de parámetros.

source: text: Formatted text with parameters and uncertainties (includes R²).
es: text: Texto formateado con parámetros e incertidumbres (incluye R²).

source: y_fitted: Array with fitted y values.
es: y_fitted: Array con valores y ajustados.

source: equation: Formatted equation with parameter values.
es: equation: Ecuación formateada con valores de parámetros.

source: If fitting fails.
es: Si el ajuste falla.

source: If equation evaluation fails.
es: Si falla la evaluación de la ecuación.

source: Get the generated function for direct use.
es: Obtener la función generada para uso directo.

source: The callable function that evaluates the formula
es: La función invocable que evalúa la fórmula

source: String representation of the evaluator.
es: Representación en cadena del evaluador.

source: Workflow Controller
es: Controlador de flujo de trabajo

source: Workflow controller for fitting operations. Contains coordination functions and workflow patterns for the fitting application.
es: Controlador de flujo para operaciones de ajuste. Contiene funciones de coordinación y patrones de flujo para la aplicación.

source: Reload data from a file based on its type.
es: Recargar datos de un archivo según su tipo.

source: This function is used in loop mode to reload updated data from the same file. Useful when the user is modifying data in real-time and wants to see the updated fit after each modification.
es: Se usa en modo bucle para recargar datos actualizados del mismo archivo. Útil cuando el usuario modifica datos en tiempo real y quiere ver el ajuste actualizado tras cada cambio.

source: Path to the data file
es: Ruta al archivo de datos

source: Type of file ('csv', 'xlsx', 'txt')
es: Tipo de archivo ('csv', 'xlsx', 'txt')

source: Loaded data as DataFrame
es: Datos cargados como DataFrame

source: If file_type is not supported or loading fails
es: Si el tipo de archivo no está soportado o falla la carga

source: Execute a single fitting operation with optional loop mode.
es: Ejecutar una operación de ajuste única con modo bucle opcional.

source: This function performs an initial fit and then optionally loops, reloading data and refitting each iteration. This is useful for iterative data analysis where the user modifies the data file between fits to explore different scenarios.
es: Realiza un ajuste inicial y opcionalmente entra en bucle recargando datos y reajustando en cada iteración. Útil para análisis iterativo cuando el usuario modifica el archivo entre ajustes para explorar distintos escenarios.

source: Workflow: 1. Perform initial fit with current data 2. Show results and ask if user wants to continue 3. If yes: reload data from file and repeat 4. If no: exit
es: Flujo: 1. Ajuste inicial con datos actuales 2. Mostrar resultados y preguntar si continuar 3. Si sí: recargar datos del archivo y repetir 4. Si no: salir

source: Fitting function to call (must accept data, x_name, y_name, plot_name)
es: Función de ajuste a llamar (debe aceptar data, x_name, y_name, plot_name)

source: Initial dataset (pandas DataFrame)
es: Conjunto de datos inicial (pandas DataFrame)

source: X variable column name(s) - string for single variable, list for multiple
es: Nombre(s) de columna de variable X: cadena para una, lista para varias

source: Y variable column name
es: Nombre de la columna de variable Y

source: Plot name for window titles and filename
es: Nombre del gráfico para títulos de ventana y nombre de archivo

source: Path to data file for reloading
es: Ruta al archivo de datos para recargar

source: File type ('csv', 'xlsx', 'txt')
es: Tipo de archivo ('csv', 'xlsx', 'txt')

source: Execute multiple fitting operations with optional loop mode.
es: Ejecutar varias operaciones de ajuste con modo bucle opcional.

source: Performs fitting on multiple datasets sequentially, with the option to reload and refit each dataset in a loop. Each dataset can be independently continued or stopped.
es: Realiza ajustes sobre varios conjuntos de forma secuencial, con opción de recargar y reajustar cada uno en bucle. Cada conjunto puede continuar o detenerse de forma independiente.

source: Workflow: 1. Fit all datasets once 2. Ask user for each dataset if they want to continue 3. For datasets marked to continue: reload and refit 4. Repeat until no datasets are marked to continue
es: Flujo: 1. Ajustar todos los conjuntos una vez 2. Preguntar por cada uno si continuar 3. Para los marcados para continuar: recargar y reajustar 4. Repetir hasta que ninguno quede marcado para continuar

source: Fitting function to call (must accept data, x_name, y_name, plot_name).
es: Función de ajuste a llamar (debe aceptar data, x_name, y_name, plot_name).

source: List of dictionaries, each containing: - 'data': dataset (pandas DataFrame) - 'x_name': X variable column name - 'y_name': Y variable column name - 'plot_name': plot name for display and filename - 'data_file_path': path to data file for reloading - 'data_file_type': file type ('csv', 'xlsx', 'txt')
es: Lista de diccionarios, cada uno con: - 'data': conjunto (pandas DataFrame) - 'x_name': nombre de columna X - 'y_name': nombre de columna Y - 'plot_name': nombre del gráfico - 'data_file_path': ruta para recargar - 'data_file_type': tipo ('csv', 'xlsx', 'txt')

source: Apply all available equation types to a dataset.
es: Aplicar todos los tipos de ecuación disponibles a un conjunto de datos.

source: This function automatically tests all predefined equation types on a single dataset, displaying results for each. Useful for exploratory data analysis to determine which mathematical model best fits the data.
es: Prueba automáticamente todos los tipos de ecuación predefinidos sobre un único conjunto y muestra los resultados de cada uno. Útil para análisis exploratorio y ver qué modelo se ajusta mejor.

source: The function iterates through all equations and displays the fit results one by one, allowing the user to compare goodness of fit visually.
es: Itera por todas las ecuaciones y muestra los resultados de ajuste uno a uno, permitiendo comparar visualmente la bondad del ajuste.

source: Function to set the current equation type (e.g., 'linear_function')
es: Función para fijar el tipo de ecuación actual (p. ej. 'linear_function')

source: Function to retrieve the fitter for the currently set equation type
es: Función para obtener el ajustador del tipo de ecuación actual

source: List of equation type identifiers to test (e.g., from config.AVAILABLE_EQUATION_TYPES)
es: Lista de identificadores de tipo de ecuación a probar (p. ej. de config.AVAILABLE_EQUATION_TYPES)

source: Dataset to fit (pandas DataFrame)
es: Conjunto de datos a ajustar (pandas DataFrame)

source: Independent variable column name
es: Nombre de la columna de variable independiente

source: Dependent variable column name
es: Nombre de la columna de variable dependiente

source: Plot name for display and filename (optional).
es: Nombre del gráfico para mostrar y nombre de archivo (opcional).

source: Coordinate the complete data loading workflow.
es: Coordinar el flujo completo de carga de datos.

source: This function orchestrates the entire data loading process: 1. Open native file dialog to select a data file 2. Load the data 3. Ask user for variables to use
es: Orquesta todo el proceso de carga: 1. Abrir diálogo nativo para elegir archivo 2. Cargar datos 3. Pedir al usuario las variables a usar

source: Parent Tkinter window.
es: Ventana Tkinter padre.

source: Function that opens native file dialog, returns (path, file_type) or (None, None) on cancel. E.g. open_load_dialog from frontend.ui_dialogs.
es: Función que abre el diálogo nativo de archivos y devuelve (path, file_type) o (None, None) al cancelar. P. ej. open_load_dialog de frontend.ui_dialogs.

source: Function to ask for variables.
es: Función para pedir las variables.

source: Tuple (data, x_name, y_name, plot_name, file_path, file_type). On user cancel, data is empty string and other fields are empty strings.
es: Tupla (data, x_name, y_name, plot_name, file_path, file_type). Si el usuario cancela, data es cadena vacía y el resto también.

source: Coordinate the data viewing workflow.
es: Coordinar el flujo de visualización de datos.

source: This function orchestrates the process of selecting and displaying data from files without performing any fitting operations.
es: Orquesta la selección y visualización de datos desde archivos sin realizar ningún ajuste.

source: Function that opens native file dialog, returns (path, file_type) or (None, None) on cancel.
es: Función que abre el diálogo nativo de archivos y devuelve (path, file_type) o (None, None) al cancelar.

source: Function to display data.
es: Función para mostrar los datos.

source: Coordinate the equation selection workflow.
es: Coordinar el flujo de selección de ecuación.

source: Handles the complete process of equation selection, including both predefined equations and custom user-defined equations.
es: Maneja todo el proceso de selección de ecuación: predefinidas y ecuaciones personalizadas del usuario.

source: Parent Tkinter window
es: Ventana Tkinter padre

source: Function to ask for equation type
es: Función para pedir el tipo de ecuación

source: Function to ask for number of parameters
es: Función para pedir el número de parámetros

source: Function to ask for parameter names
es: Función para pedir los nombres de parámetros

source: Function to ask for custom formula
es: Función para pedir la fórmula personalizada

source: Function to retrieve fitting function by name
es: Función para obtener la función de ajuste por nombre

source: Tuple of (equation_name, fitter_function)
es: Tupla (equation_name, fitter_function)

source: Coordinate the custom equation creation workflow.
es: Coordinar el flujo de creación de ecuación personalizada.

source: Handles the process of creating a user-defined custom fitting equation by collecting parameter information and the formula. Returns only the backend fitting function (without visualization), maintaining separation of concerns.
es: Gestiona la creación de una ecuación de ajuste personalizada: recoge parámetros y fórmula. Devuelve solo la función de ajuste del backend (sin visualización), manteniendo la separación de responsabilidades.

source: Function to ask for number of parameters and independent variables
es: Función para pedir número de parámetros y variables independientes

source: <formula>', backend_fit_function) or (EXIT_SIGNAL, None) if cancelled
es: (formula, backend_fit_function) o (EXIT_SIGNAL, None) si se cancela

source: Estimators
es: Estimadores

source: Initial parameter estimators for curve fitting.
es: Estimadores de parámetros iniciales para ajuste de curvas.

source: Inputs (x, y) are assumed to be finite and already validated/cleaned by the caller. This module provides functions to estimate initial parameter values and ranges for various model types (linear, polynomial, trigonometric, gaussian, logistic, exponential, etc.) to improve fitting convergence.
es: Se asume que las entradas (x, y) son finitas y validadas/limpiadas por el llamador. Este módulo proporciona funciones para estimar valores y rangos iniciales de parámetros para distintos modelos (lineal, polinomial, trigonométrico, gaussiano, logístico, exponencial, etc.) y mejorar la convergencia del ajuste.

source: Estimate initial parameters for trigonometric functions (sin/cos).
es: Estimar parámetros iniciales para funciones trigonométricas (sen/cos).

source: Estimates amplitude (a) and angular frequency (b) for y = a * sin(b*x) or y = a * cos(b*x). Uses peak detection first, with autocorrelation fallback when peaks are insufficient.
es: Estima amplitud (a) y frecuencia angular (b) para y = a*sin(b*x) o y = a*cos(b*x). Primero detección de picos; si faltan picos usa autocorrelación.

source: Independent variable array
es: Array de variable independiente

source: Dependent variable array
es: Array de variable dependiente

source: Tuple (amplitude, frequency).
es: Tupla (amplitud, frecuencia).

source: Estimate initial phase shift for y = a * sin(b*x + c) or y = a * cos(b*x + c).
es: Estimar desfase inicial para y = a*sin(b*x + c) o y = a*cos(b*x + c).

source: Estimated amplitude (a)
es: Amplitud estimada (a)

source: Estimated angular frequency (b)
es: Frecuencia angular estimada (b)

source: Estimated phase shift (c).
es: Desfase estimado (c).

source: Estimate initial parameters for linear fit y = m*x + n (intercept n, slope m).
es: Estimar parámetros iniciales para ajuste lineal y = m*x + n (ordenada n, pendiente m).

source: intercept and slope.
es: ordenada y pendiente.

source: Estimate initial parameters for polynomial y = c0 + c1*x + ... + c_degree*x^degree.
es: Estimar parámetros iniciales para polinomio y = c0 + c1*x + ... + c_degree*x^degree.

source: Independent variable array.
es: Array de variable independiente.

source: Dependent variable array.
es: Array de variable dependiente.

source: Polynomial degree.
es: Grado del polinomio.

source: List of coefficients [c0, c1, ..., c_degree] (constant term first).
es: Lista de coeficientes [c0, c1, ..., c_degree] (término constante primero).

source: Estimate coefficient a for y = a * x^power (no constant term). Least-squares: a = sum(y * x^power) / sum(x^(2*power)).
es: Estimar coeficiente a para y = a*x^power (sin término constante). Mínimos cuadrados: a = sum(y*x^power)/sum(x^(2*power)).

source: Exponent (e.g. 2 for quadratic through origin)
es: Exponente (p. ej. 2 para cuadrática por el origen)

source: Estimated coefficient a.
es: Coeficiente a estimado.

source: Estimate initial parameter a for y = a * ln(x). Least squares with no intercept; positive x only.
es: Estimar parámetro inicial a para y = a*ln(x). Mínimos cuadrados sin ordenada; solo x positivos.

source: Independent variable array (positive)
es: Array de variable independiente (positivos)

source: Estimate coefficient a for y = a / x^power. Uses median of (y * x^power) for robustness to outliers.
es: Estimar coeficiente a para y = a/x^power. Usa la mediana de (y*x^power) para robustez frente a valores atípicos.

source: Independent variable array (avoid zeros)
es: Array de variable independiente (evitar ceros)

source: Power in denominator (1 or 2)
es: Exponente en el denominador (1 o 2)

source: Estimate initial (A, mu, sigma) for y = A * exp(-(x-mu)^2 / (2*sigma^2)). A from max(y), mu from x at max, sigma from FWHM (half-max crossings).
es: Estimar (A, mu, sigma) iniciales para y = A*exp(-(x-mu)^2/(2*sigma^2)). A del max(y), mu del x en el máximo, sigma del FWHM (cruces a mitad de máximo).

source: Tuple (A, mu, sigma).
es: Tupla (A, mu, sigma).

source: Estimate (a, b, c) for logistic y = a / (1 + exp(-b*(x-c))). a = range, c = midpoint of transition, b from inverse of transition width.
es: Estimar (a, b, c) para logística y = a/(1+exp(-b*(x-c))). a = rango, c = punto medio de transición, b del inverso del ancho de transición.

source: Tuple (a, b, c).
es: Tupla (a, b, c).

source: Estimate (a, b) for y = a * exp(b*x). Uses log(y) = log(a) + b*x when y > 0; otherwise fallback from endpoints.
es: Estimar (a, b) para y = a*exp(b*x). Usa log(y)=log(a)+b*x cuando y>0; si no, fallback desde los extremos.

source: Tuple (a, b).
es: Tupla (a, b).

source: Estimate (A, t0, w) for a smooth square pulse: amplitude, center time, width. A from peak-to-peak, t0 from center of mass of ``y`` (absolute value), w from support of elevated region.
es: Estimar (A, t0, w) para pulso cuadrado suave: amplitud, tiempo central, anchura. A de pico a pico, t0 del centro de masas de ``y`` (valor absoluto), w del soporte de la región elevada.

source: Independent variable array (e.g. time)
es: Array de variable independiente (p. ej. tiempo)

source: Tuple (A, t0, w).
es: Tupla (A, t0, w).

source: Estimate initial parameters for hyperbolic functions (sinh/cosh).
es: Estimar parámetros iniciales para funciones hiperbólicas (sinh/cosh).

source: For y = a * sinh(b*x) or y = a * cosh(b*x): amplitude (a) from half the y range, frequency (b) from inverse of x range.
es: Para y = a*sinh(b*x) o y = a*cosh(b*x): amplitud (a) de la mitad del rango de y, frecuencia (b) del inverso del rango de x.

source: Return parameter bounds for hyperbolic fits (sinh/cosh) to avoid overflow.
es: Devolver cotas de parámetros para ajustes hiperbólicos (sinh/cosh) y evitar desbordamiento.

source: For y = a * sinh(b*x) or y = a * cosh(b*x): a can be any real, b must be bounded so that b*max(abs(x)) does not cause overflow in exp.
es: Para y = a*sinh(b*x) o y = a*cosh(b*x): a puede ser cualquier real; b debe estar acotado para que b*max(abs(x)) no cause desbordamiento en exp.

source: Pair (lower_bounds, upper_bounds), each of length 2 for (a, b).
es: Par (lower_bounds, upper_bounds), cada uno de longitud 2 para (a, b).
