Repository: DOKOS-TAYOS/RegressionLab
Catalog: sphinx-docs/locale/*/LC_MESSAGES/modules/frontend.po
Languages: es

source: Frontend Module
es: Módulo Frontend

source: The ``frontend`` module contains the Tkinter-based graphical user interface.
es: El módulo ``frontend`` contiene la interfaz gráfica basada en Tkinter.

source: Main Menu
es: Menú principal

source: Main menu module. Contains the main application window and exit confirmation dialog.
es: Módulo del menú principal. Contiene la ventana principal de la aplicación y el diálogo de confirmación de salida.

source: Create and display the main application menu window.
es: Crear y mostrar la ventana del menú principal de la aplicación.

source: Parameters
es: Parámetros

source: Function to call for normal fitting
es: Función a llamar para ajuste normal

source: Function to call for single fit on multiple datasets
es: Función a llamar para un ajuste sobre varios conjuntos de datos

source: Function to call for multiple fits on single dataset
es: Función a llamar para varios ajustes sobre un único conjunto de datos

source: Function to call for all fits on single dataset
es: Función a llamar para todos los ajustes sobre un único conjunto de datos

source: Function to call for viewing data
es: Función a llamar para ver datos

source: Function to display help information
es: Función para mostrar la información de ayuda

source: Returns
es: Devuelve

source: The main Tk window instance
es: La instancia de la ventana principal Tk

source: Display exit confirmation dialog.
es: Mostrar el diálogo de confirmación de salida.

source: The parent menu window to close if user confirms exit
es: La ventana del menú padre a cerrar si el usuario confirma la salida

source: Create and run the main application menu.
es: Crear y ejecutar el menú principal de la aplicación.

source: This is the entry point for the GUI application.
es: Es el punto de entrada de la aplicación con interfaz gráfica.

source: Image Utilities
es: Utilidades de imagen

source: Shared image loading and scaling for the Tkinter frontend.
es: Carga y escalado compartido de imágenes para el frontend Tkinter.

source: Return the path to use for displaying a plot in the GUI.
es: Devolver la ruta a usar para mostrar un gráfico en la interfaz.

source: When the saved file is PDF, returns the ``_preview.png`` path if it exists, so Tkinter can show the image without breaking.
es: Cuando el archivo guardado es PDF, devuelve la ruta ``_preview.png`` si existe, para que Tkinter pueda mostrar la imagen sin fallos.

source: Full path to the saved plot file (e.g. PDF or PNG).
es: Ruta completa al archivo del gráfico guardado (p. ej. PDF o PNG).

source: Path to the image file to display (preview PNG for PDFs when available).
es: Ruta al archivo de imagen a mostrar (PNG de vista previa para PDF cuando exista).

source: Return the path of an auxiliary preview file to remove after display.
es: Devolver la ruta del archivo de vista previa auxiliar a eliminar tras mostrarlo.

source: If the displayed image is an auxiliary preview file (``_preview.png``), return its path so the caller can delete it after the window is closed.
es: Si la imagen mostrada es un archivo de vista previa auxiliar (``_preview.png``), devolver su ruta para que el llamador pueda borrarlo tras cerrar la ventana.

source: Path actually used for display (may be preview PNG).
es: Ruta realmente usada para mostrar (puede ser el PNG de vista previa).

source: Original output path (e.g. PDF path).
es: Ruta de salida original (p. ej. ruta del PDF).

source: Path to the preview file to delete, or None if no cleanup needed.
es: Ruta del archivo de vista previa a borrar, o None si no hace falta limpieza.

source: Load an image from file and return a Tk PhotoImage scaled to fit within max dimensions.
es: Cargar una imagen desde archivo y devolver un PhotoImage de Tk escalado para ajustarse a las dimensiones máximas.

source: Uses PIL when available. Supports PNG, JPG, JPEG. Returns None if the file cannot be opened (e.g. missing PIL), so callers can fall back to tkinter.PhotoImage(file=path) for raster formats or skip showing.
es: Usa PIL cuando está disponible. Soporta PNG, JPG, JPEG. Devuelve None si el archivo no se puede abrir (p. ej. falta PIL), para que el llamador pueda usar tkinter.PhotoImage(file=path) para formatos raster o omitir la visualización.

source: Path to the image file.
es: Ruta al archivo de imagen.

source: Maximum width in pixels.
es: Ancho máximo en píxeles.

source: Maximum height in pixels.
es: Altura máxima en píxeles.

source: ImageTk.PhotoImage scaled to fit, or None on failure.
es: ImageTk.PhotoImage escalado para ajustar, o None si falla.

source: Keyboard Navigation
es: Navegación por teclado

source: Keyboard navigation: arrow keys to move focus, Enter to activate.
es: Navegación por teclado: flechas para mover el foco, Enter para activar.

source: Bind Enter key events to trigger accept callback on widgets.
es: Vincular eventos de la tecla Enter para ejecutar el callback de aceptar en los widgets.

source: Binds both <Return> and <KP_Enter> events on each widget to the accept_callback function, so that pressing Enter from input widgets (Spinbox, Entry, Combobox, etc.) triggers the accept action.
es: Vincula los eventos <Return> y <KP_Enter> en cada widget a la función accept_callback, de modo que pulsar Enter desde widgets de entrada (Spinbox, Entry, Combobox, etc.) dispare la acción de aceptar.

source: Sequence of Tkinter widgets to bind events to.
es: Secuencia de widgets Tkinter a los que vincular eventos.

source: Callback function with signature ``() -> None`` to call when Enter is pressed.
es: Función callback con firma ``() -> None`` a llamar cuando se pulse Enter.

source: Set up keyboard navigation for a grid of widgets.
es: Configurar la navegación por teclado para una cuadrícula de widgets.

source: Binds arrow keys to move focus between widgets in the grid and Return/Enter keys to activate the focused widget. The grid is a 2D list of focusable widgets (e.g. ttk.Button); use None for empty cells.
es: Vincula las teclas de flecha para mover el foco entre widgets de la cuadrícula y Return/Enter para activar el widget con foco. La cuadrícula es una lista 2D de widgets enfocables (p. ej. ttk.Button); usar None para celdas vacías.

source: 2D sequence of widgets arranged in a grid layout. Use ``None`` for empty cells in the grid.
es: Secuencia 2D de widgets dispuestos en cuadrícula. Usar ``None`` para celdas vacías en la cuadrícula.

source: Optional callback function called when Enter is pressed. Signature: ``on_enter(widget, event) -> bool``. If it returns ``True``, the default behavior (invoke button) is skipped. Use this to handle Enter on non-button widgets (e.g. radiobutton -> confirm dialog).
es: Función callback opcional llamada al pulsar Enter. Firma: ``on_enter(widget, event) -> bool``. Si devuelve ``True``, se omite el comportamiento por defecto (invocar botón). Úsala para manejar Enter en widgets que no son botón (p. ej. radiobutton -> diálogo de confirmación).

source: Dialogs
es: Diálogos

source: Main dialogs package (re-exports from ui_dialogs submodules).
es: Paquete principal de diálogos (reexporta desde submódulos ui_dialogs).

source: UI Dialogs package. Contains all Tkinter dialog windows for user interaction, split by concern.
es: Paquete de diálogos de interfaz. Contiene todas las ventanas de diálogo Tkinter para interacción del usuario, organizadas por función.

source: Load Data Dialog
es: Diálogo de cargar datos

source: Load data dialog using native file picker (replaces ask_file_type + ask_file_name).
es: Diálogo de carga de datos con selector de archivos nativo (sustituye a ask_file_type + ask_file_name).

source: Open native file dialog to select a data file (CSV, TXT, XLSX).
es: Abrir diálogo nativo de archivos para seleccionar un archivo de datos (CSV, TXT, XLSX).

source: Replaces the two-step flow (file type + file name) with a single native OS dialog. Works on Windows, Linux, and macOS.
es: Sustituye el flujo en dos pasos (tipo de archivo + nombre) por un único diálogo nativo del SO. Funciona en Windows, Linux y macOS.

source: Parent Tkinter window (Toplevel or Tk).
es: Ventana Tkinter padre (Toplevel o Tk).

source: Tuple (file_path, file_type) if user selects a file, or (None, None) if user cancels. file_type is one of 'csv', 'txt', 'xlsx'.
es: Tupla (file_path, file_type) si el usuario elige un archivo, o (None, None) si cancela. file_type es uno de 'csv', 'txt', 'xlsx'.

source: Save Data Dialog
es: Diálogo de guardar datos

source: Save data dialog for the data view window.
es: Diálogo de guardar datos para la ventana de vista de datos.

source: Open save file dialog for the current data.
es: Abrir diálogo de guardar archivo para los datos actuales.

source: Data Selection Dialog
es: Diálogo de selección de datos

source: Data selection dialogs: file type, file name, variables, and data preview.
es: Diálogos de selección de datos: tipo de archivo, nombre, variables y vista previa.

source: Dialog to ask for data file type.
es: Diálogo para pedir el tipo de archivo de datos.

source: Presents radio buttons with file type options (xlsx, csv, txt, Exit). User can select one option.
es: Muestra botones de opción con tipos de archivo (xlsx, csv, txt, Salir). El usuario puede elegir una opción.

source: Parent Tkinter window
es: Ventana Tkinter padre

source: Selected file type (one of ``config.DATA_FILE_TYPES``, ``EXIT_SIGNAL``, or empty string ``''``).
es: Tipo de archivo seleccionado (uno de ``config.DATA_FILE_TYPES``, ``EXIT_SIGNAL``, o cadena vacía ``''``).

source: Dialog to select a specific file from the list.
es: Diálogo para seleccionar un archivo concreto de la lista.

source: Parent Tkinter window.
es: Ventana Tkinter padre.

source: List of available file names (without extensions).
es: Lista de nombres de archivo disponibles (sin extensiones).

source: Selected file name (without extension), or empty string if cancelled.
es: Nombre de archivo seleccionado (sin extensión), o cadena vacía si se cancela.

source: Dialog to select independent (x) and dependent (y) variables and plot name.
es: Diálogo para seleccionar variables independiente (x) y dependiente (y) y nombre del gráfico.

source: List of available variable names from the dataset.
es: Lista de nombres de variables disponibles del conjunto de datos.

source: Tuple of ``(x_name, y_name, plot_name)``. Returns ``('', '', '')`` if user cancels.
es: Tupla ``(x_name, y_name, plot_name)``. Devuelve ``('', '', '')`` si el usuario cancela.

source: Dialog to select multiple independent (x) variables for multidimensional fitting.
es: Diálogo para seleccionar varias variables independientes (x) para ajuste multidimensional.

source: Number of independent variables to select.
es: Número de variables independientes a seleccionar.

source: Name of the first x variable already selected.
es: Nombre de la primera variable x ya seleccionada.

source: List of x variable names. Returns empty list if user cancels.
es: Lista de nombres de variables x. Devuelve lista vacía si el usuario cancela.

source: Dialog to display loaded data.
es: Diálogo para mostrar los datos cargados.

source: Provides transform, cleaning, save, and pair-plot options. Transform/clean dialogs are non-modal so focus stays on the data window for multiple ops. Pair plots auto-update when data is transformed (if already open).
es: Ofrece opciones de transformar, limpiar, guardar y gráficos de pares. Los diálogos de transformar/limpiar son no modales para mantener el foco en la ventana de datos en operaciones múltiples. Los gráficos de pares se actualizan automáticamente al transformar datos (si ya están abiertos).

source: Parent Tkinter window (``Tk`` or ``Toplevel``).
es: Ventana Tkinter padre (``Tk`` o ``Toplevel``).

source: DataFrame to display (or string). If DataFrame, converted to string for display using ``to_string()`` method.
es: DataFrame a mostrar (o cadena). Si es DataFrame, se convierte a cadena para mostrar con el método ``to_string()``.

source: Equation Dialog
es: Diálogo de ecuación

source: Equation and parameter dialogs for fitting.
es: Diálogos de ecuación y parámetros para el ajuste.

source: Dialog to select fitting equation type.
es: Diálogo para seleccionar el tipo de ecuación de ajuste.

source: Optionally allows configuring initial values and bounds per parameter. Displays a grid of buttons for predefined equation types, plus options for custom equations and exiting.
es: Opcionalmente permite configurar valores iniciales y límites por parámetro. Muestra una cuadrícula de botones para tipos de ecuación predefinidos, más opciones para ecuaciones personalizadas y salir.

source: Tuple of ``(equation_type, user_initial_guess, user_bounds)``. ``user_initial_guess`` and ``user_bounds`` are ``None`` when not configured.
es: Tupla ``(equation_type, user_initial_guess, user_bounds)``. ``user_initial_guess`` y ``user_bounds`` son ``None`` cuando no se configuran.

source: Dialog to ask for number of parameters and independent variables in a custom function.
es: Diálogo para pedir el número de parámetros y de variables independientes en una función personalizada.

source: Displays a dialog with Spinboxes allowing the user to select the number of parameters (1-12) and number of independent variables (1-10) for a custom fitting function.
es: Muestra un diálogo con Spinboxes para que el usuario elija el número de parámetros (1-12) y de variables independientes (1-10) para una función de ajuste personalizada.

source: Tuple of (number of parameters, number of independent variables), or ``None`` if the user closed the window.
es: Tupla (número de parámetros, número de variables independientes), o ``None`` si el usuario cerró la ventana.

source: Dialog to ask for parameter names in a custom function.
es: Diálogo para pedir los nombres de parámetros en una función personalizada.

source: Displays a series of dialogs (one per parameter) asking the user to enter parameter names. Shows Unicode escape sequence hints for Greek letters. Parameter names are normalized (Unicode escapes replaced, whitespace removed).
es: Muestra una serie de diálogos (uno por parámetro) pidiendo los nombres de parámetros. Muestra pistas de secuencias de escape Unicode para letras griegas. Los nombres se normalizan (reemplazo de escapes Unicode, eliminación de espacios).

source: Number of parameters to collect names for.
es: Número de parámetros para los que recoger nombres.

source: List of parameter names entered by the user. Returns ``[EXIT_SIGNAL]`` if user cancels at any point.
es: Lista de nombres de parámetros introducidos por el usuario. Devuelve ``[EXIT_SIGNAL]`` si el usuario cancela en cualquier momento.

source: Dialog to ask for custom function formula.
es: Diálogo para pedir la fórmula de la función personalizada.

source: Displays a dialog allowing the user to enter a mathematical formula using the previously defined parameter names. Shows syntax hints and Unicode escape sequence reference for Greek letters.
es: Muestra un diálogo para introducir una fórmula matemática con los nombres de parámetros ya definidos. Muestra pistas de sintaxis y referencia de secuencias Unicode para letras griegas.

source: List of parameter names that can be used in the formula.
es: Lista de nombres de parámetros que pueden usarse en la fórmula.

source: Number of independent variables (1 for x, >1 for x_0, x_1, etc.).
es: Número de variables independientes (1 para x, >1 para x_0, x_1, etc.).

source: Formula string entered by the user, with Unicode escape sequences normalized. Returns ``EXIT_SIGNAL`` if user cancels.
es: Cadena de fórmula introducida por el usuario, con secuencias de escape Unicode normalizadas. Devuelve ``EXIT_SIGNAL`` si el usuario cancela.

source: Dialog to ask for number of multiple fits.
es: Diálogo para pedir el número de ajustes múltiples.

source: Displays a dialog with a Spinbox allowing the user to select the number of fits to perform (between min_val and max_val).
es: Muestra un diálogo con un Spinbox para que el usuario elija el número de ajustes a realizar (entre min_val y max_val).

source: Minimum number of fits allowed (default: 2).
es: Número mínimo de ajustes permitidos (por defecto: 2).

source: Maximum number of fits allowed (default: 10).
es: Número máximo de ajustes permitidos (por defecto: 10).

source: Selected number of fits (between ``min_val`` and ``max_val``), or ``None`` if the user closed the window.
es: Número de ajustes seleccionado (entre ``min_val`` y ``max_val``), o ``None`` si el usuario cerró la ventana.

source: Help Dialog
es: Diálogo de ayuda

source: Help dialog and text utilities for Tkinter display.
es: Diálogo de ayuda y utilidades de texto para visualización en Tkinter.

source: Remove Markdown bold markers (**) from text for Tkinter display.
es: Quitar marcadores de negrita Markdown (**) del texto para mostrar en Tkinter.

source: Only strips ** when the content between them has no asterisk, so exponentiation in code (e.g. ``x**2``) is preserved.
es: Solo elimina ** cuando el contenido entre ellos no tiene asterisco, así se preserva la exponenciación en código (p. ej. ``x**2``).

source: String that may contain Markdown bold markers.
es: Cadena que puede contener marcadores de negrita Markdown.

source: String with ``**...**`` removed (content preserved).
es: Cadena con ``**...**`` eliminado (contenido preservado).

source: Display help dialog for the Watch Data window (transform, clean, save options).
es: Mostrar diálogo de ayuda para la ventana Ver datos (transformar, limpiar, guardar).

source: Shows collapsible sections: pair plots, transform (with each option detailed), clean (with each option detailed), and save. Used when the user clicks Help in the data view.
es: Muestra secciones colapsables: gráficos de pares, transformar (con cada opción detallada), limpiar (con cada opción detallada) y guardar. Se usa cuando el usuario hace clic en Ayuda en la vista de datos.

source: Parent Tkinter window (the data view Toplevel).
es: Ventana Tkinter padre (el Toplevel de la vista de datos).

source: Display help and information dialog about the application.
es: Mostrar diálogo de ayuda e información sobre la aplicación.

source: Shows information in collapsible sections (like the config dialog): objective, advantages, fitting modes, custom functions, data format, data location, output location, and statistics.
es: Muestra información en secciones colapsables (como el diálogo de config): objetivo, ventajas, modos de ajuste, funciones personalizadas, formato de datos, ubicación de datos, ubicación de salida y estadísticas.

source: Configuration Dialog
es: Diálogo de configuración

source: Configuration dialog for editing .env settings.
es: Diálogo de configuración para editar ajustes .env.

source: Show configuration dialog to edit .env fields.
es: Mostrar diálogo de configuración para editar campos .env.

source: Pre-fills with current env values (or defaults). On Accept, writes .env and returns True so the caller can restart the app. On Cancel returns False.
es: Rellena con los valores actuales de env (o por defecto). Al aceptar, escribe .env y devuelve True para que el llamador pueda reiniciar la app. Al cancelar devuelve False.

source: ``True`` if user accepted and ``.env`` was written (caller should restart). ``False`` if user cancelled.
es: ``True`` si el usuario aceptó y se escribió ``.env`` (el llamador debe reiniciar). ``False`` si el usuario canceló.

source: Result Dialog
es: Diálogo de resultados

source: Result window for displaying fitting results and plot.
es: Ventana de resultados para mostrar resultados del ajuste y gráfico.

source: Create a Tkinter window to display the fitting results.
es: Crear una ventana Tkinter para mostrar los resultados del ajuste.

source: Creates a new ``Toplevel`` window showing the fitting results including parameter values, uncertainties, statistics, and the fitted equation plot.
es: Crea una ventana ``Toplevel`` nueva que muestra los resultados del ajuste: valores de parámetros, incertidumbres, estadísticas y el gráfico de la ecuación ajustada.

source: Name of the fit for window title.
es: Nombre del ajuste para el título de la ventana.

source: Formatted text with parameters, uncertainties, and statistics.
es: Texto formateado con parámetros, incertidumbres y estadísticas.

source: Formatted equation string with parameter values.
es: Cadena de ecuación formateada con valores de parámetros.

source: Path to the plot image file to display.
es: Ruta al archivo de imagen del gráfico a mostrar.

source: Optional matplotlib Figure for 3D plot (embeds interactive canvas, rotatable with mouse).
es: Figure de matplotlib opcional para gráfico 3D (incluye canvas interactivo, rotable con el ratón).

source: Optional dict with 'fit_func', 'params', 'cov', 'x_names' for prediction feature.
es: Dict opcional con 'fit_func', 'params', 'cov', 'x_names' para la función de predicción.

source: The created ``Toplevel`` window instance.
es: La instancia de la ventana ``Toplevel`` creada.

source: Tooltip binding for Tkinter widgets.
es: Vinculación de tooltips para widgets Tkinter.

source: Bind a tooltip to a Tkinter widget.
es: Vincular un tooltip a un widget Tkinter.

source: Shows a tooltip window after a delay when the mouse enters the widget, and hides it when the mouse leaves. Uses a contrasting background and border so the tooltip is visible over the UI.
es: Muestra una ventana de tooltip tras un retraso al entrar el ratón en el widget y la oculta al salir. Usa fondo y borde contrastados para que el tooltip sea visible sobre la interfaz.

source: Tkinter widget to bind the tooltip to.
es: Widget Tkinter al que vincular el tooltip.

source: Tooltip text to display when mouse hovers over the widget.
es: Texto del tooltip a mostrar cuando el ratón pasa sobre el widget.

source: Delay in milliseconds before showing the tooltip (default: ``500``).
es: Retraso en milisegundos antes de mostrar el tooltip (por defecto: ``500``).
