Repository: DOKOS-TAYOS/RegressionLab
Catalog: sphinx-docs/locale/*/LC_MESSAGES/modules/loaders.po
Languages: es

source: Loaders Module
es: Módulo Loaders

source: The ``loaders`` module handles data loading from different file formats.
es: El módulo ``loaders`` gestiona la carga de datos desde distintos formatos de archivo.

source: Data Loader
es: Cargador de datos

source: Data loading logic module.
es: Módulo de lógica de carga de datos.

source: This module handles all data loading operations without UI dependencies. It provides a clean separation between data access logic (backend) and user interface (frontend).
es: Este módulo gestiona todas las operaciones de carga de datos sin dependencias de la interfaz. Proporciona una separación clara entre la lógica de acceso a datos (backend) y la interfaz de usuario (frontend).

source: Key features:
es: Características principales:

source: Path construction for data files
es: Construcción de rutas para archivos de datos

source: Loading from CSV, TXT and Excel formats
es: Carga desde formatos CSV, TXT y Excel

source: Variable name extraction from datasets
es: Extracción de nombres de variables desde conjuntos de datos

source: File categorization by type
es: Categorización de archivos por tipo

source: All functions are UI-independent and can be used in both GUI and CLI contexts.
es: Todas las funciones son independientes de la interfaz y pueden usarse tanto en contextos GUI como CLI.

source: Load data based on file type.
es: Cargar datos según el tipo de archivo.

source: Parameters
es: Parámetros

source: Complete path to the file
es: Ruta completa al archivo

source: File type ('csv', 'xlsx', 'txt')
es: Tipo de archivo ('csv', 'xlsx', 'txt')

source: Returns
es: Devuelve

source: DataFrame with loaded data.
es: DataFrame con los datos cargados.

source: Raises
es: Lanza

source: If file type is not supported.
es: Si el tipo de archivo no está soportado.

source: If file cannot be loaded (from underlying readers).
es: Si el archivo no puede cargarse (desde los lectores subyacentes).

source: Extract variable names from the dataset.
es: Extraer nombres de variables del conjunto de datos.

source: When filter_uncertainty is False, returns all column names (e.g. 'x', 'ux', 'y', 'uy'). When True, excludes uncertainty columns (e.g. 'ux', 'uy') so only base variables like 'x', 'y' are returned. Uncertainty columns are assumed to be named 'u<varname>'.
es: Cuando filter_uncertainty es False, devuelve todos los nombres de columna (p. ej. 'x', 'ux', 'y', 'uy'). Cuando es True, excluye las columnas de incertidumbre (p. ej. 'ux', 'uy') de modo que solo se devuelven variables base como 'x', 'y'. Las columnas de incertidumbre se asumen con nombre 'u<nombre>'.

source: DataFrame with the data
es: DataFrame con los datos

source: If True, exclude uncertainty columns from the result
es: Si es True, excluir columnas de incertidumbre del resultado

source: List of column names as strings.
es: Lista de nombres de columna como cadenas.

source: Examples
es: Ejemplos

source: Get list of files based on selected type.
es: Obtener lista de archivos según el tipo seleccionado.

source: This function acts as a selector/router that returns the appropriate file list based on the user's file type selection.
es: Esta función actúa como selector/enrutador que devuelve la lista de archivos apropiada según la selección de tipo de archivo del usuario.

source: List of CSV file names (without extension)
es: Lista de nombres de archivos CSV (sin extensión)

source: List of XLSX file names (without extension)
es: Lista de nombres de archivos XLSX (sin extensión)

source: List of TXT file names (without extension)
es: Lista de nombres de archivos TXT (sin extensión)

source: List of files of the specified type
es: Lista de archivos del tipo especificado

source: If file type is not valid
es: Si el tipo de archivo no es válido

source: Complete data loading workflow.
es: Flujo completo de carga de datos.

source: This convenience function combines path preparation and data loading into a single operation. It's the main entry point for loading data files in the application.
es: Esta función de conveniencia combina la preparación de rutas y la carga de datos en una sola operación. Es el punto de entrada principal para cargar archivos de datos en la aplicación.

source: File name without extension (e.g., 'Example')
es: Nombre del archivo sin extensión (p. ej. 'Example')

source: Tuple of (data DataFrame, complete file path) The file path is returned so it can be used for reloading in loop mode
es: Tupla de (DataFrame de datos, ruta completa del archivo). Se devuelve la ruta para poder usarla al recargar en modo bucle.

source: If data cannot be loaded
es: Si los datos no pueden cargarse

source: Loading Utilities
es: Utilidades de carga

source: Loading utilities for data file operations.
es: Utilidades de carga para operaciones con archivos de datos.

source: This module provides functions to:
es: Este módulo proporciona funciones para:

source: Load data from CSV, TXT and Excel files
es: Cargar datos desde archivos CSV, TXT y Excel

source: Scan directories for available data files
es: Escanear directorios en busca de archivos de datos disponibles

source: Get the project root directory path
es: Obtener la ruta del directorio raíz del proyecto

source: All file operations are relative to the project root directory.
es: Todas las operaciones de archivo son relativas al directorio raíz del proyecto.

source: Load data from a CSV file.
es: Cargar datos desde un archivo CSV.

source: Path to the CSV file
es: Ruta al archivo CSV

source: DataFrame with the CSV data, treating 'no' as NaN values
es: DataFrame con los datos CSV, tratando 'no' como valores NaN

source: If file does not exist
es: Si el archivo no existe

source: If file cannot be read
es: Si el archivo no puede leerse

source: Load data from a text file (whitespace or tab separated).
es: Cargar datos desde un archivo de texto (separado por espacios o tabulaciones).

source: Uses pandas read_csv with sep=None (delimiter sniffing) so that tab-separated and space-separated values are detected automatically.
es: Usa pandas read_csv con sep=None (detección de delimitador) para que los valores separados por tabulaciones o espacios se detecten automáticamente.

source: Path to the text file.
es: Ruta al archivo de texto.

source: DataFrame with the text file data, treating 'no' as NaN values.
es: DataFrame con los datos del archivo de texto, tratando 'no' como valores NaN.

source: Load data from an Excel file (.xlsx).
es: Cargar datos desde un archivo Excel (.xlsx).

source: Path to the Excel file
es: Ruta al archivo Excel

source: DataFrame with the Excel data
es: DataFrame con los datos de Excel

source: Get categorized file names from a directory.
es: Obtener nombres de archivos categorizados de un directorio.

source: Scans the specified directory and categorizes files by extension, returning file names without their extensions. This allows the UI to present clean file names to the user while the full path can be reconstructed when needed.
es: Escanea el directorio especificado y categoriza archivos por extensión, devolviendo nombres sin extensión. Así la interfaz puede mostrar nombres limpios y la ruta completa puede reconstruirse cuando haga falta.

source: Name of the directory to scan (default: None, relative to project root)
es: Nombre del directorio a escanear (por defecto: None, relativo a la raíz del proyecto)

source: (csv_files, xlsx_files, txt_files) Each list contains file names without extensions
es: (csv_files, xlsx_files, txt_files) Cada lista contiene nombres de archivo sin extensiones

source: Return type
es: Tipo de retorno

source: If directory does not exist
es: Si el directorio no existe

source: Saving Utilities
es: Utilidades de guardado

source: Save DataFrame to file (CSV, TXT, XLSX).
es: Guardar DataFrame en archivo (CSV, TXT, XLSX).

source: Save a DataFrame to file.
es: Guardar un DataFrame en archivo.

source: DataFrame to save.
es: DataFrame a guardar.

source: Full path to the output file.
es: Ruta completa al archivo de salida.

source: 'csv', 'txt', or 'xlsx'. If None, inferred from path extension.
es: 'csv', 'txt' o 'xlsx'. Si es None, se infiere por la extensión de la ruta.

source: The path where the file was saved.
es: La ruta donde se guardó el archivo.

source: Return the default directory for saving (input folder).
es: Devolver el directorio por defecto para guardar (carpeta input).
