Repository: DOKOS-TAYOS/RegressionLab
Catalog: sphinx-docs/locale/*/LC_MESSAGES/modules/plotting.po
Languages: es

source: Plotting Module
es: Módulo de gráficos

source: The ``plotting`` module handles plot generation and visualization.
es: El módulo ``plotting`` gestiona la generación y visualización de gráficos.

source: Plotting Utilities
es: Utilidades de gráficos

source: Plotting utilities for RegressionLab.
es: Utilidades de gráficos para RegressionLab.

source: This module provides functions to create pair plots (scatter matrices) and save fitted data plots with error bars, using configuration from config (fonts, style).
es: Este módulo proporciona funciones para crear gráficos de pares (matrices de dispersión) y guardar gráficos de datos ajustados con barras de error, usando la configuración de config (fuentes, estilo).

source: Create a grid of scatter plots for all pairs of variables (pair plot).
es: Crear una cuadrícula de gráficos de dispersión para todos los pares de variables (gráfico de pares).

source: Parameters
es: Parámetros

source: DataFrame or dict-like with numeric columns.
es: DataFrame o similar a dict con columnas numéricas.

source: List of column names to use (must be numeric).
es: Lista de nombres de columnas a usar (deben ser numéricas).

source: Optional plot configuration dict. Defaults to PLOT_CONFIG.
es: Diccionario opcional de configuración del gráfico. Por defecto PLOT_CONFIG.

source: Optional font configuration dict. Defaults to FONT_CONFIG.
es: Diccionario opcional de configuración de fuentes. Por defecto FONT_CONFIG.

source: If given, save figure to this path and return path (str). If None, return the Figure for inline display (e.g. Streamlit).
es: Si se proporciona, guarda la figura en esta ruta y devuelve la ruta (str). Si es None, devuelve la Figure para visualización inline (p. ej. Streamlit).

source: Returns
es: Devuelve

source: path to the saved image (str). Otherwise: matplotlib Figure instance.
es: ruta a la imagen guardada (str). Si no: instancia de matplotlib Figure.

source: Return type
es: Tipo de retorno

source: Create and save a plot with experimental data and fitted curve.
es: Crear y guardar un gráfico con datos experimentales y curva ajustada.

source: Independent variable data (array-like).
es: Datos de la variable independiente (array-like).

source: Dependent variable data (array-like).
es: Datos de la variable dependiente (array-like).

source: Uncertainties in x (array-like).
es: Incertidumbres en x (array-like).

source: Uncertainties in y (array-like).
es: Incertidumbres en y (array-like).

source: Fitted y values (array-like).
es: Valores y ajustados (array-like).

source: Name of the fit for plot title.
es: Nombre del ajuste para el título del gráfico.

source: Label for x-axis.
es: Etiqueta del eje x.

source: Label for y-axis.
es: Etiqueta del eje y.

source: Optional full path to save the plot. If None, uses get_output_path(fit_name).
es: Ruta completa opcional para guardar el gráfico. Si es None, usa get_output_path(fit_name).

source: Optional dict with 'fit_func' and 'params' to evaluate the curve at linspace points for a smooth plot. If None, uses x and y_fitted directly.
es: Diccionario opcional con 'fit_func' y 'params' para evaluar la curva en puntos linspace para un gráfico suave. Si es None, usa x e y_fitted directamente.

source: Path to the saved plot file (as string).
es: Ruta al archivo del gráfico guardado (como string).

source: Raises
es: Lanza

source: If the plot file cannot be written.
es: Si no se puede escribir el archivo del gráfico.

source: If matplotlib fails during plot creation or saving.
es: Si matplotlib falla durante la creación o guardado del gráfico.

source: Create a residual plot for multidimensional fitting.
es: Crear un gráfico de residuos para ajuste multidimensional.

source: Shows residuals (y - y_fitted) vs point index.
es: Muestra residuos (y - y_fitted) frente al índice del punto.

source: Residual values (y - y_fitted) for each data point.
es: Valores residuales (y - y_fitted) para cada punto de datos.

source: Indices of data points (0, 1, 2, ...).
es: Índices de los puntos de datos (0, 1, 2, ...).

source: Create a 3D plot for fitting with two independent variables.
es: Crear un gráfico 3D para ajuste con dos variables independientes.

source: Shows data points and fitted surface mesh.
es: Muestra puntos de datos y malla de superficie ajustada.

source: First independent variable data.
es: Datos de la primera variable independiente.

source: Second independent variable data.
es: Datos de la segunda variable independiente.

source: Dependent variable data (observed).
es: Datos de la variable dependiente (observados).

source: Fitted z values.
es: Valores z ajustados.

source: Label for z-axis.
es: Etiqueta del eje z.

source: If True, return (save_path, figure) for embedding in a window (rotatable with mouse).
es: Si es True, devuelve (save_path, figure) para incrustar en una ventana (rotable con el ratón).

source: Optional dict with 'fit_func' and 'params' to evaluate the surface on a linspace grid for a smooth plot. If None, interpolates z_fitted onto the grid.
es: Diccionario opcional con 'fit_func' y 'params' para evaluar la superficie en una cuadrícula linspace para un gráfico suave. Si es None, interpola z_fitted en la cuadrícula.

source: path to the saved plot file (str). If interactive=True: tuple (save_path, figure) for embedding.
es: ruta al archivo del gráfico guardado (str). Si interactive=True: tupla (save_path, figure) para incrustar.
