Repository: DOKOS-TAYOS/RegressionLab
Catalog: sphinx-docs/locale/*/LC_MESSAGES/modules/streamlit_app.po
Languages: es

source: Streamlit Web Application
es: Aplicación web Streamlit

source: The ``streamlit_app`` module contains the Streamlit-based web interface.
es: El módulo ``streamlit_app`` contiene la interfaz web basada en Streamlit.

source: Main Application
es: Aplicación principal

source: Streamlit Application for RegressionLab Web-based interface for curve fitting operations.
es: Aplicación Streamlit para RegressionLab: interfaz web para operaciones de ajuste de curvas.

source: Main Streamlit application.
es: Aplicación principal de Streamlit.

source: Theme Configuration
es: Configuración del tema

source: Streamlit UI theme from config (same rules as tkinter app).
es: Tema de interfaz Streamlit desde config (mismas reglas que la app Tkinter).

source: Uses config.theme.UI_STYLE when available (env + theme.py). Converts color names to hex for CSS via matplotlib. Fallback to config.env only if theme cannot be imported (e.g. headless without tkinter).
es: Usa config.theme.UI_STYLE cuando está disponible (env + theme.py). Convierte nombres de color a hex para CSS vía matplotlib. Recurso a config.env solo si el tema no puede importarse (p. ej. headless sin tkinter).

source: Theme dict from config: prefers config.theme.UI_STYLE (env + paths + theme), fallback to config.env when theme cannot be imported (e.g. headless).
es: Diccionario de tema desde config: prefiere config.theme.UI_STYLE (env + rutas + tema), recurre a config.env cuando el tema no puede importarse (p. ej. headless).

source: Returns dict with hex colors and font settings for Streamlit CSS.
es: Devuelve un dict con colores hex y configuración de fuentes para el CSS de Streamlit.

source: Generate global Streamlit CSS using theme (same visual rules as tkinter).
es: Generar CSS global de Streamlit usando el tema (mismas reglas visuales que tkinter).

source: Application Sections
es: Secciones de la aplicación

source: The ``streamlit_app.sections`` subpackage contains UI sections organized by functionality.
es: El subpaquete ``streamlit_app.sections`` contiene secciones de interfaz organizadas por funcionalidad.

source: Main Sections Package
es: Paquete de secciones principales

source: Streamlit app sections: sidebar, data, fitting, results, help, modes.
es: Secciones de la app Streamlit: barra lateral, datos, ajuste, resultados, ayuda, modos.

source: Sidebar Section
es: Sección barra lateral

source: Sidebar, session state, and logo for the Streamlit app.
es: Barra lateral, estado de sesión y logo de la app Streamlit.

source: Initialize Streamlit session state variables (language from config env).
es: Inicializar variables de estado de sesión de Streamlit (idioma desde config env).

source: Cycle to the next supported language (es -> en -> de -> es).
es: Cambiar al siguiente idioma soportado (es -> en -> de -> es).

source: Setup and render the sidebar with language selector and mode options.
es: Configurar y renderizar la barra lateral con selector de idioma y opciones de modo.

source: Parameters
es: Parámetros

source: Application version string to display in the sidebar.
es: Cadena de versión de la aplicación a mostrar en la barra lateral.

source: Returns
es: Devuelve

source: Selected operation mode (e.g. 'normal_fitting', 'watch_data').
es: Modo de operación seleccionado (p. ej. 'normal_fitting', 'watch_data').

source: Display application logo or fallback header (colors from config theme).
es: Mostrar logo de la aplicación o cabecera alternativa (colores del tema en config).

source: Data Section
es: Sección de datos

source: Data loading and display for the Streamlit app.
es: Carga y visualización de datos para la app Streamlit.

source: Load data from an uploaded file (CSV, XLSX, or TXT).
es: Cargar datos desde un archivo subido (CSV, XLSX o TXT).

source: Streamlit UploadedFile object (e.g. from st.file_uploader).
es: Objeto Streamlit UploadedFile (p. ej. de st.file_uploader).

source: DataFrame with loaded data, or None if loading fails.
es: DataFrame con los datos cargados, o None si falla la carga.

source: Show data in an expander with optional pair plots and data analysis (transform/clean/save).
es: Mostrar datos en un expandible con gráficos de pares opcionales y análisis de datos (transformar/limpiar/guardar).

source: DataFrame or data to display.
es: DataFrame o datos a mostrar.

source: If set (e.g. 'view_data'), enables transform/clean/save and uses session state for the current data. Required for analysis features.
es: Si se establece (p. ej. 'view_data'), activa transformar/limpiar/guardar y usa el estado de sesión para los datos actuales. Necesario para las funciones de análisis.

source: When key_prefix is set, used to detect file changes. When file_id changes, the displayed data is reset to the new loaded data.
es: Cuando key_prefix está definido, se usa para detectar cambios de archivo. Cuando file_id cambia, los datos mostrados se restablecen a los nuevos datos cargados.

source: Get or create a temporary directory for plots. Uses session-specific temp directory.
es: Obtener o crear un directorio temporal para gráficos. Usa directorio temporal por sesión.

source: Public wrapper for variable names (used by fitting and modes).
es: Envoltorio público para nombres de variables (usado por ajuste y modos).

source: Fitting Section
es: Sección de ajuste

source: Fitting logic and equation selection UI for the Streamlit app.
es: Lógica de ajuste y UI de selección de ecuación para la app Streamlit.

source: Perform curve fitting for the given dataset and equation selection.
es: Realizar ajuste de curvas para el conjunto de datos y la ecuación seleccionados.

source: This helper wraps the core fitting logic used by the Streamlit UI: it resolves either a predefined fitting function or a custom :class:`~fitting.custom_function_evaluator.CustomFunctionEvaluator`, computes the fit and generates the corresponding plot.
es: Este helper envuelve la lógica de ajuste usada por la UI Streamlit: resuelve una función de ajuste predefinida o un :class:`~fitting.custom_function_evaluator.CustomFunctionEvaluator` personalizado, calcula el ajuste y genera el gráfico correspondiente.

source: Dataset with columns ``x_name``, ``y_name`` and optionally their uncertainties ``u{x_name}``, ``u{y_name}``.
es: Conjunto de datos con columnas ``x_name``, ``y_name`` y opcionalmente sus incertidumbres ``u{x_name}``, ``u{y_name}``.

source: Name of the independent variable column.
es: Nombre de la columna de variable independiente.

source: Name of the dependent variable column.
es: Nombre de la columna de variable dependiente.

source: Internal equation identifier or ``'custom_formula'``.
es: Identificador interno de ecuación o ``'custom_formula'``.

source: Base name used for the generated plot.
es: Nombre base usado para el gráfico generado.

source: Custom formula string when ``equation_name`` is ``'custom_formula'``.
es: Cadena de fórmula personalizada cuando ``equation_name`` es ``'custom_formula'``.

source: List of parameter names used in ``custom_formula``.
es: Lista de nombres de parámetros usados en ``custom_formula``.

source: If set, override plot title visibility (from env) for this fit. ``None`` uses the value from ``PLOT_SHOW_TITLE``.
es: Si se establece, sobrescribe la visibilidad del título del gráfico (desde env) para este ajuste. ``None`` usa el valor de ``PLOT_SHOW_TITLE``.

source: Dictionary with keys ``equation_name``, ``parameters``, ``equation``, ``plot_path`` and ``plot_name`` when the fit succeeds, or ``None`` if the operation fails or is not supported.
es: Diccionario con claves ``equation_name``, ``parameters``, ``equation``, ``plot_path`` y ``plot_name`` cuando el ajuste tiene éxito, o ``None`` si la operación falla o no está soportada.

source: Show variable selection widgets and return the chosen variables and plot name.
es: Mostrar widgets de selección de variables y devolver las variables elegidas y el nombre del gráfico.

source: Dataset from which variables are extracted.
es: Conjunto de datos del que se extraen las variables.

source: Optional prefix for Streamlit widget keys to avoid clashes.
es: Prefijo opcional para las claves de widgets Streamlit para evitar conflictos.

source: Tuple ``(x_name, y_name, plot_name)`` selected by the user.
es: Tupla ``(x_name, y_name, plot_name)`` seleccionada por el usuario.

source: Show equation type selector in the sidebar/content area.
es: Mostrar selector de tipo de ecuación en la barra lateral o área de contenido.

source: List of available equation identifiers.
es: Lista de identificadores de ecuación disponibles.

source: Tuple ``(equation_key, custom_formula, parameter_names)`` where ``custom_formula`` and ``parameter_names`` are only populated when the custom‑formula option is selected.
es: Tupla ``(equation_key, custom_formula, parameter_names)`` donde ``custom_formula`` y ``parameter_names`` solo se rellenan cuando se selecciona la opción de fórmula personalizada.

source: Show checkbox to toggle plot title visibility for the next fit.
es: Mostrar casilla para activar/desactivar la visibilidad del título del gráfico en el próximo ajuste.

source: Default value comes from PLOT_CONFIG (env PLOT_SHOW_TITLE).
es: El valor por defecto viene de PLOT_CONFIG (env PLOT_SHOW_TITLE).

source: Prefix for Streamlit widget key to avoid clashes.
es: Prefijo para la clave del widget Streamlit para evitar conflictos.

source: Whether to show the plot title (True) or not (False).
es: Si mostrar el título del gráfico (True) o no (False).

source: Public wrapper around :func:`_create_equation_options`.
es: Envoltorio público de :func:`_create_equation_options`.

source: This function is imported by the modes module to build the mapping from translated labels to equation identifiers.
es: Esta función es importada por el módulo modes para construir la correspondencia entre etiquetas traducidas e identificadores de ecuación.

source: Results Section
es: Sección de resultados

source: Results display for the Streamlit app.
es: Visualización de resultados para la app Streamlit.

source: Display fitting results: equation (formula + formatted) left, params center, stats right; plot; download below.
es: Mostrar resultados del ajuste: ecuación (fórmula + formateada) a la izquierda, parámetros al centro, estadísticos a la derecha; gráfico; descarga abajo.

source: Help Section
es: Sección de ayuda

source: Help and information section for the Streamlit app.
es: Sección de ayuda e información para la app Streamlit.

source: Display help information in an expandable section.
es: Mostrar información de ayuda en una sección expandible.

source: Modes Section
es: Sección de modos

source: Operation modes: normal, multiple datasets, checker, total fitting, view data.
es: Modos de operación: normal, múltiples conjuntos, verificador, ajuste total, ver datos.

source: Handle view-data mode: load file and show data without fitting (like Tkinter 'Mirar datos').
es: Gestionar modo ver datos: cargar archivo y mostrar datos sin ajuste (como Tkinter 'Ver datos').

source: Handle normal fitting mode (single file, single equation), with optional loop mode.
es: Gestionar modo de ajuste normal (un archivo, una ecuación), con modo bucle opcional.

source: Handle multiple datasets mode (multiple files, single equation), with loop hint.
es: Gestionar modo múltiples conjuntos (varios archivos, una ecuación), con indicación de bucle.

source: Handle checker fitting mode (single file, multiple equations).
es: Gestionar modo ajuste verificador (un archivo, varias ecuaciones).

source: Handle total fitting mode (single file, all equations).
es: Gestionar modo ajuste total (un archivo, todas las ecuaciones).
