Repository: DOKOS-TAYOS/RegressionLab
Catalog: sphinx-docs/locale/*/LC_MESSAGES/modules/utils.po
Languages: es

source: Utilities Module
es: Módulo de utilidades

source: The ``utils`` module contains general utilities and helper functions.
es: El módulo ``utils`` contiene utilidades generales y funciones auxiliares.

source: Logger
es: Registro (logger)

source: Logging configuration for RegressionLab.
es: Configuración de registro para RegressionLab.

source: This module provides centralized logging configuration and utilities. It supports both file and console logging with customizable log levels.
es: Este módulo proporciona configuración centralizada de registro y utilidades. Soporta registro en archivo y consola con niveles de log personalizables.

source: Custom formatter that adds color to console log output.
es: Formateador personalizado que añade color a la salida de log en consola.

source: Colors are applied based on log level:
es: Los colores se aplican según el nivel de log:

source: DEBUG: Cyan
es: DEBUG: Cian

source: INFO: Green
es: INFO: Verde

source: WARNING: Yellow
es: WARNING: Amarillo

source: ERROR: Red
es: ERROR: Rojo

source: CRITICAL: Bright Red
es: CRITICAL: Rojo brillante

source: Format the log record with colors.
es: Formatear el registro de log con colores.

source: Parameters
es: Parámetros

source: The log record to format
es: El registro de log a formatear

source: Returns
es: Devuelve

source: Formatted and colored log string
es: Cadena de log formateada y con color

source: Get log level from environment variable.
es: Obtener nivel de log desde variable de entorno.

source: Logging level constant (e.g., logging.INFO)
es: Constante de nivel de log (p. ej. logging.INFO)

source: Get log file path from environment variable.
es: Obtener ruta del archivo de log desde variable de entorno.

source: Path to log file
es: Ruta al archivo de log

source: Check if console logging is enabled via environment variable.
es: Comprobar si el registro en consola está activado vía variable de entorno.

source: True if console logging should be enabled
es: True si el registro en consola debe estar activado

source: Configure application-wide logging.
es: Configurar el registro para toda la aplicación.

source: This function sets up logging to both file and console (optional). If no parameters are provided, it uses environment variables or defaults.
es: Esta función configura el registro en archivo y consola (opcional). Si no se proporcionan parámetros, usa variables de entorno o valores por defecto.

source: Path to log file. If None, uses LOG_FILE env var or default
es: Ruta al archivo de log. Si es None, usa la variable de entorno LOG_FILE o el valor por defecto

source: Logging level. If None, uses LOG_LEVEL env var or INFO
es: Nivel de log. Si es None, usa la variable de entorno LOG_LEVEL o INFO

source: Enable console logging. If None, uses LOG_CONSOLE env var or True
es: Activar registro en consola. Si es None, usa la variable de entorno LOG_CONSOLE o True

source: Format string for log messages
es: Cadena de formato para mensajes de log

source: Format string for timestamps
es: Cadena de formato para marcas de tiempo

source: Examples
es: Ejemplos

source: Get a logger instance for a specific module.
es: Obtener una instancia de logger para un módulo específico.

source: Name of the logger (typically __name__ of the module)
es: Nombre del logger (típicamente __name__ del módulo)

source: Logger instance
es: Instancia del logger

source: Log a function call with its parameters.
es: Registrar una llamada a función con sus parámetros.

source: Logger instance to use
es: Instancia del logger a usar

source: Name of the function being called
es: Nombre de la función que se llama

source: Function parameters to log
es: Parámetros de la función a registrar

source: Log an exception with context.
es: Registrar una excepción con contexto.

source: Logger instance to use.
es: Instancia del logger a usar.

source: Exception that occurred.
es: Excepción que ocurrió.

source: Optional context description.
es: Descripción opcional del contexto.

source: Exceptions
es: Excepciones

source: Custom exceptions for the RegressionLab application.
es: Excepciones personalizadas para la aplicación RegressionLab.

source: This module defines specific exception types for different error scenarios, providing better error handling and debugging capabilities.
es: Este módulo define tipos de excepción específicos para distintos escenarios de error, proporcionando mejor manejo de errores y capacidades de depuración.

source: Base exception class for all RegressionLab-related errors.
es: Clase base de excepción para todos los errores relacionados con RegressionLab.

source: Exception raised when data loading fails.
es: Excepción que se lanza cuando falla la carga de datos.

source: Exception raised when data validation fails.
es: Excepción que se lanza cuando falla la validación de datos.

source: Exception raised when a requested file or directory is not found.
es: Excepción que se lanza cuando no se encuentra el archivo o directorio solicitado.

source: Note: This is a RegressionLab-specific exception (subclass of DataLoadError). It is distinct from builtins.FileNotFoundError but serves the same semantic purpose.
es: Nota: Es una excepción específica de RegressionLab (subclase de DataLoadError). Se distingue de builtins.FileNotFoundError pero cumple el mismo propósito semántico.

source: Exception raised when file type is not supported.
es: Excepción que se lanza cuando el tipo de archivo no está soportado.

source: Exception raised when curve fitting fails.
es: Excepción que se lanza cuando falla el ajuste de curvas.

source: Exception raised when equation evaluation fails.
es: Excepción que se lanza cuando falla la evaluación de la ecuación.

source: Exception raised when configuration is invalid.
es: Excepción que se lanza cuando la configuración no es válida.

source: Exception raised when input validation fails.
es: Excepción que se lanza cuando falla la validación de entrada.

source: Validators
es: Validadores

source: Data validation utilities for the RegressionLab application.
es: Utilidades de validación de datos para la aplicación RegressionLab.

source: This module provides functions to validate data integrity, file paths, and parameter values before processing.
es: Este módulo proporciona funciones para validar integridad de datos, rutas de archivo y valores de parámetros antes del procesamiento.

source: Validate that a file path exists and is accessible.
es: Validar que una ruta de archivo exista y sea accesible.

source: Path to the file
es: Ruta al archivo

source: Raises
es: Lanza

source: If file does not exist
es: Si el archivo no existe

source: If path is not a file
es: Si la ruta no es un archivo

source: Validate that a file type is supported.
es: Validar que un tipo de archivo esté soportado.

source: File extension (e.g., 'csv', 'xlsx').
es: Extensión del archivo (p. ej. 'csv', 'xlsx').

source: List of allowed file types. If None, uses the central list from :data:`config.DATA_FILE_TYPES`.
es: Lista de tipos de archivo permitidos. Si es None, usa la lista central de :data:`config.DATA_FILE_TYPES`.

source: If file type is not supported.
es: Si el tipo de archivo no está soportado.

source: Validate that a DataFrame is suitable for fitting.
es: Validar que un DataFrame sea adecuado para el ajuste.

source: DataFrame to validate
es: DataFrame a validar

source: Minimum number of rows required
es: Número mínimo de filas requerido

source: If DataFrame is invalid
es: Si el DataFrame no es válido

source: Comprehensive validation for fitting data.
es: Validación completa para datos de ajuste.

source: Validates:
es: Valida:

source: DataFrame is not empty
es: El DataFrame no está vacío

source: Required columns exist
es: Existen las columnas requeridas

source: Data is numeric
es: Los datos son numéricos

source: Uncertainty columns exist and are valid
es: Las columnas de incertidumbre existen y son válidas

source: DataFrame or dict with data to fit (dict is converted to DataFrame).
es: DataFrame o dict con datos a ajustar (el dict se convierte en DataFrame).

source: Name of the independent variable column
es: Nombre de la columna de variable independiente

source: Name of the dependent variable column
es: Nombre de la columna de variable dependiente

source: If any validation fails
es: Si falla cualquier validación

source: Validate parameter names for custom equations.
es: Validar nombres de parámetros para ecuaciones personalizadas.

source: List of parameter names
es: Lista de nombres de parámetros

source: If parameter names are invalid
es: Si los nombres de parámetros no son válidos

source: Parse a string to float; empty or invalid input returns None.
es: Convertir una cadena a float; entrada vacía o inválida devuelve None.

source: Useful for optional numeric fields in dialogs (e.g. initial guess, bounds).
es: Útil para campos numéricos opcionales en diálogos (p. ej. estimación inicial, límites).

source: String to parse (e.g. from an Entry widget).
es: Cadena a parsear (p. ej. de un widget Entry).

source: The parsed float, or None if empty or invalid.
es: El float parseado, o None si está vacío o es inválido.

source: Comprehensive validation of data file format.
es: Validación completa del formato del archivo de datos.

source: This function validates: - Column names are valid and not duplicated - All columns contain numeric data - No completely empty rows - Minimum requirements (rows and columns)
es: Esta función valida: - Los nombres de columna son válidos y no están duplicados - Todas las columnas contienen datos numéricos - No hay filas completamente vacías - Requisitos mínimos (filas y columnas)

source: If data format is invalid
es: Si el formato de datos no es válido

source: Update Checker
es: Comprobador de actualizaciones

source: Update checker for RegressionLab.
es: Comprobador de actualizaciones para RegressionLab.

source: Checks weekly if a newer version is available in the repository. If so, shows a dialog (when enabled via env) and can perform git pull without overwriting user data (input/, output/, .env, etc.).
es: Comprueba semanalmente si hay una versión más reciente en el repositorio. Si es así, muestra un diálogo (cuando está activado vía env) y puede ejecutar git pull sin sobrescribir datos del usuario (input/, output/, .env, etc.).

source: Return True if we should run the update check (once per week).
es: Devuelve True si debemos ejecutar la comprobación de actualizaciones (una vez por semana).

source: True if enough time has passed since last check, or no previous check.
es: True si ha pasado suficiente tiempo desde la última comprobación, o no hubo comprobación previa.

source: Record that an update check was performed (touch the file).
es: Registrar que se realizó una comprobación de actualizaciones (touch del archivo).

source: Fetch the latest version from the remote pyproject.toml.
es: Obtener la última versión desde el pyproject.toml remoto.

source: URL to pyproject.toml. If None, uses env UPDATE_CHECK_URL or default.
es: URL al pyproject.toml. Si es None, usa la variable de entorno UPDATE_CHECK_URL o el valor por defecto.

source: Version string (e.g. '1.0.0') or None if fetch failed.
es: Cadena de versión (p. ej. '1.0.0') o None si falló la obtención.

source: Check if a newer version is available.
es: Comprobar si hay una versión más reciente disponible.

source: Current application version.
es: Versión actual de la aplicación.

source: The latest version string if newer, else None.
es: La cadena de la última versión si es más reciente, si no None.

source: Perform git pull in the project root.
es: Ejecutar git pull en la raíz del proyecto.

source: Before pulling, this function stashes any local changes in input/ and output/ directories to prevent them from being overwritten. After the pull completes, the stashed changes are restored. Files in .env and other .gitignore entries are automatically protected by git.
es: Antes de hacer pull, esta función guarda en stash los cambios locales en input/ y output/ para evitar que se sobrescriban. Tras completar el pull, se restauran los cambios guardados. Los archivos .env y otras entradas .gitignore están protegidos automáticamente por git.

source: Tuple of (success, message). Message is user-friendly.
es: Tupla (success, message). El mensaje es amigable para el usuario.
